; ModuleID = 'blob.c'
source_filename = "blob.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.blobvar_S = type { %struct.growarray, i32, i8 }
%struct.growarray = type { i32, i32, i32, i32, i8* }
%struct.typval_T = type { i32, i8, %union.anon }
%union.anon = type { i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@e_write = external global [0 x i8], align 1
@.str = private unnamed_addr constant [3 x i8] c"0z\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c".\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"%02X\00", align 1
@e_blobidx = external global [0 x i8], align 1
@.str.3 = private unnamed_addr constant [57 x i8] c"E972: Blob value does not have the right number of bytes\00", align 1

; Function Attrs: nounwind uwtable
define %struct.blobvar_S* @blob_alloc() local_unnamed_addr #0 !dbg !120 {
  %1 = tail call i8* @alloc_clear(i64 32) #6, !dbg !125

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 6.0.1-14 (tags/RELEASE_601/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !86)
!1 = !DIFile(filename: "blob.c", directory: "/home/sahil/vim/src")
!2 = !{!3, !21, !28, !34, !42, !47, !56, !61, !66, !73, !79}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1374, size: 32, elements: !5)
!4 = !DIFile(filename: "./structs.h", directory: "/home/sahil/vim/src")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!6 = !DIEnumerator(name: "VAR_UNKNOWN", value: 0)
!7 = !DIEnumerator(name: "VAR_ANY", value: 1)
!8 = !DIEnumerator(name: "VAR_VOID", value: 2)
!9 = !DIEnumerator(name: "VAR_BOOL", value: 3)
!10 = !DIEnumerator(name: "VAR_SPECIAL", value: 4)
!11 = !DIEnumerator(name: "VAR_NUMBER", value: 5)
!12 = !DIEnumerator(name: "VAR_FLOAT", value: 6)
!13 = !DIEnumerator(name: "VAR_STRING", value: 7)
!14 = !DIEnumerator(name: "VAR_BLOB", value: 8)
!15 = !DIEnumerator(name: "VAR_FUNC", value: 9)
!16 = !DIEnumerator(name: "VAR_PARTIAL", value: 10)
!17 = !DIEnumerator(name: "VAR_LIST", value: 11)
!18 = !DIEnumerator(name: "VAR_DICT", value: 12)
!19 = !DIEnumerator(name: "VAR_JOB", value: 13)
!20 = !DIEnumerator(name: "VAR_CHANNEL", value: 14)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1585, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26, !27}
!23 = !DIEnumerator(name: "UF_NOT_COMPILED", value: 0)
!24 = !DIEnumerator(name: "UF_TO_BE_COMPILED", value: 1)
!25 = !DIEnumerator(name: "UF_COMPILING", value: 2)
!26 = !DIEnumerator(name: "UF_COMPILED", value: 3)
!27 = !DIEnumerator(name: "UF_COMPILE_ERROR", value: 4)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 2061, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "JOB_FAILED", value: 0)
!31 = !DIEnumerator(name: "JOB_STARTED", value: 1)
!32 = !DIEnumerator(name: "JOB_ENDED", value: 2)
!33 = !DIEnumerator(name: "JOB_FINISHED", value: 3)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 2517, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !41}
!36 = !DIEnumerator(name: "POPPOS_BOTLEFT", value: 0)
!37 = !DIEnumerator(name: "POPPOS_TOPLEFT", value: 1)
!38 = !DIEnumerator(name: "POPPOS_BOTRIGHT", value: 2)
!39 = !DIEnumerator(name: "POPPOS_TOPRIGHT", value: 3)
!40 = !DIEnumerator(name: "POPPOS_CENTER", value: 4)
!41 = !DIEnumerator(name: "POPPOS_NONE", value: 5)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 2526, size: 32, elements: !43)
!43 = !{!44, !45, !46}
!44 = !DIEnumerator(name: "POPCLOSE_NONE", value: 0)
!45 = !DIEnumerator(name: "POPCLOSE_BUTTON", value: 1)
!46 = !DIEnumerator(name: "POPCLOSE_CLICK", value: 2)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 55, size: 32, elements: !49)
!48 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkvisual.h", directory: "/home/sahil/vim/src")
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "GDK_VISUAL_STATIC_GRAY", value: 0)
!51 = !DIEnumerator(name: "GDK_VISUAL_GRAYSCALE", value: 1)
!52 = !DIEnumerator(name: "GDK_VISUAL_STATIC_COLOR", value: 2)
!53 = !DIEnumerator(name: "GDK_VISUAL_PSEUDO_COLOR", value: 3)
!54 = !DIEnumerator(name: "GDK_VISUAL_TRUE_COLOR", value: 4)
!55 = !DIEnumerator(name: "GDK_VISUAL_DIRECT_COLOR", value: 5)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 118, size: 32, elements: !58)
!57 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdktypes.h", directory: "/home/sahil/vim/src")
!58 = !{!59, !60}
!59 = !DIEnumerator(name: "GDK_LSB_FIRST", value: 0)
!60 = !DIEnumerator(name: "GDK_MSB_FIRST", value: 1)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 43, size: 32, elements: !63)
!62 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkfont.h", directory: "/home/sahil/vim/src")
!63 = !{!64, !65}
!64 = !DIEnumerator(name: "GDK_FONT_FONT", value: 0)
!65 = !DIEnumerator(name: "GDK_FONT_FONTSET", value: 1)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 52, size: 32, elements: !68)
!67 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkrc.h", directory: "/home/sahil/vim/src")
!68 = !{!69, !70, !71, !72}
!69 = !DIEnumerator(name: "GTK_RC_FG", value: 1)
!70 = !DIEnumerator(name: "GTK_RC_BG", value: 2)
!71 = !DIEnumerator(name: "GTK_RC_TEXT", value: 4)
!72 = !DIEnumerator(name: "GTK_RC_BASE", value: 8)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 2140, size: 32, elements: !74)
!74 = !{!75, !76, !77, !78}
!75 = !DIEnumerator(name: "MODE_NL", value: 0)
!76 = !DIEnumerator(name: "MODE_RAW", value: 1)
!77 = !DIEnumerator(name: "MODE_JSON", value: 2)
!78 = !DIEnumerator(name: "MODE_JS", value: 3)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 2148, size: 32, elements: !80)
!80 = !{!81, !82, !83, !84, !85}
!81 = !DIEnumerator(name: "JIO_PIPE", value: 0)
!82 = !DIEnumerator(name: "JIO_NULL", value: 1)
!83 = !DIEnumerator(name: "JIO_FILE", value: 2)
!84 = !DIEnumerator(name: "JIO_BUFFER", value: 3)
!85 = !DIEnumerator(name: "JIO_OUT", value: 4)
!86 = !{!87, !101, !105, !109, !112, !96, !113, !114}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "blob_T", file: !4, line: 1349, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blobvar_S", file: !4, line: 1561, size: 256, elements: !90)
!90 = !{!91, !102, !103}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "bv_ga", scope: !89, file: !4, line: 1563, baseType: !92, size: 192)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !4, line: 55, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !4, line: 48, size: 192, elements: !94)
!94 = !{!95, !97, !98, !99, !100}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !93, file: !4, line: 50, baseType: !96, size: 32)
!96 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !93, file: !4, line: 51, baseType: !96, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !93, file: !4, line: 52, baseType: !96, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !93, file: !4, line: 53, baseType: !96, size: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !93, file: !4, line: 54, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "bv_refcount", scope: !89, file: !4, line: 1564, baseType: !96, size: 32, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bv_lock", scope: !89, file: !4, line: 1565, baseType: !104, size: 8, offset: 224)
!104 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !107, line: 324, baseType: !108)
!107 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!108 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 62, baseType: !111)
!110 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!111 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!113 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !4, line: 1327, baseType: !115)
!115 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!116 = !{i32 2, !"Dwarf Version", i32 4}
!117 = !{i32 2, !"Debug Info Version", i32 3}
!118 = !{i32 1, !"wchar_size", i32 4}
!119 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!120 = distinct !DISubprogram(name: "blob_alloc", scope: !1, file: !1, line: 23, type: !121, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !123)
!121 = !DISubroutineType(types: !122)
!122 = !{!87}
!123 = !{!124}
!124 = !DILocalVariable(name: "blob", scope: !120, file: !1, line: 25, type: !87)
!125 = !DILocation(line: 25, column: 20, scope: !120)
!126 = !DILocation(line: 25, column: 13, scope: !120)
!127 = !DILocation(line: 27, column: 14, scope: !128)
!128 = distinct !DILexicalBlock(scope: !120, file: !1, line: 27, column: 9)
!129 = !DILocation(line: 27, column: 9, scope: !120)
!130 = !DILocation(line: 28, column: 18, scope: !128)
!131 = !DILocation(line: 28, column: 2, scope: !128)
!132 = !DILocation(line: 29, column: 5, scope: !120)
!133 = distinct !DISubprogram(name: "rettv_blob_alloc", scope: !1, file: !1, line: 37, type: !134, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1785)
!134 = !DISubroutineType(types: !135)
!135 = !{!96, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !4, line: 1432, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1412, size: 128, elements: !139)
!139 = !{!140, !142, !143}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !138, file: !4, line: 1414, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !4, line: 1391, baseType: !3)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !138, file: !4, line: 1415, baseType: !104, size: 8, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !138, file: !4, line: 1431, baseType: !144, size: 64, offset: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !4, line: 1416, size: 64, elements: !145)
!145 = !{!146, !147, !150, !151, !208, !243, !385, !1783, !1784}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !144, file: !4, line: 1418, baseType: !114, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !144, file: !4, line: 1420, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !4, line: 1344, baseType: !149)
!149 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !144, file: !4, line: 1422, baseType: !105, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !144, file: !4, line: 1423, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !4, line: 1346, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !4, line: 1471, size: 768, elements: !155)
!155 = !{!156, !164, !171, !186, !200, !201, !202, !203, !204, !205, !206, !207}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !154, file: !4, line: 1473, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !4, line: 1446, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !4, line: 1448, size: 256, elements: !160)
!160 = !{!161, !162, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !159, file: !4, line: 1450, baseType: !157, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !159, file: !4, line: 1451, baseType: !157, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !159, file: !4, line: 1452, baseType: !137, size: 128, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !154, file: !4, line: 1474, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !4, line: 1456, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !4, line: 1458, size: 128, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !167, file: !4, line: 1460, baseType: !157, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !167, file: !4, line: 1461, baseType: !165, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !154, file: !4, line: 1487, baseType: !172, size: 192, offset: 128)
!172 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !154, file: !4, line: 1475, size: 192, elements: !173)
!173 = !{!174, !180}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !172, file: !4, line: 1481, baseType: !175, size: 192)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !172, file: !4, line: 1476, size: 192, elements: !176)
!176 = !{!177, !178, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !175, file: !4, line: 1478, baseType: !114, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !175, file: !4, line: 1479, baseType: !114, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !175, file: !4, line: 1480, baseType: !96, size: 32, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !172, file: !4, line: 1486, baseType: !181, size: 192)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !172, file: !4, line: 1482, size: 192, elements: !182)
!182 = !{!183, !184, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !181, file: !4, line: 1483, baseType: !157, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !181, file: !4, line: 1484, baseType: !157, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !181, file: !4, line: 1485, baseType: !96, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !154, file: !4, line: 1488, baseType: !187, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !4, line: 1394, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !4, line: 1395, size: 192, elements: !190)
!190 = !{!191, !192, !195, !196, !197, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !189, file: !4, line: 1396, baseType: !141, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !189, file: !4, line: 1397, baseType: !193, size: 8, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !4, line: 1342, baseType: !194)
!194 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !189, file: !4, line: 1398, baseType: !104, size: 8, offset: 40)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !189, file: !4, line: 1399, baseType: !104, size: 8, offset: 48)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !189, file: !4, line: 1400, baseType: !187, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !189, file: !4, line: 1401, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !154, file: !4, line: 1489, baseType: !152, size: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !154, file: !4, line: 1490, baseType: !152, size: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !154, file: !4, line: 1491, baseType: !152, size: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !154, file: !4, line: 1492, baseType: !96, size: 32, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !154, file: !4, line: 1493, baseType: !96, size: 32, offset: 608)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !154, file: !4, line: 1494, baseType: !96, size: 32, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !154, file: !4, line: 1496, baseType: !96, size: 32, offset: 672)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !154, file: !4, line: 1497, baseType: !104, size: 8, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !144, file: !4, line: 1424, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !4, line: 1347, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !4, line: 1545, size: 2816, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !239, !240, !241, !242}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !211, file: !4, line: 1547, baseType: !104, size: 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !211, file: !4, line: 1548, baseType: !104, size: 8, offset: 8)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !211, file: !4, line: 1549, baseType: !96, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !211, file: !4, line: 1550, baseType: !96, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !211, file: !4, line: 1551, baseType: !218, size: 2432, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !4, line: 1290, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !4, line: 1277, size: 2432, elements: !220)
!220 = !{!221, !223, !224, !225, !226, !227, !228, !235}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !219, file: !4, line: 1279, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !107, line: 345, baseType: !111)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !219, file: !4, line: 1281, baseType: !222, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !219, file: !4, line: 1282, baseType: !222, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !219, file: !4, line: 1283, baseType: !96, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !219, file: !4, line: 1284, baseType: !96, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !219, file: !4, line: 1285, baseType: !96, size: 32, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !219, file: !4, line: 1287, baseType: !229, size: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !4, line: 1265, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !4, line: 1261, size: 128, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !231, file: !4, line: 1263, baseType: !222, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !231, file: !4, line: 1264, baseType: !105, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !219, file: !4, line: 1289, baseType: !236, size: 2048, offset: 384)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 2048, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !211, file: !4, line: 1552, baseType: !187, size: 64, offset: 2560)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !211, file: !4, line: 1553, baseType: !209, size: 64, offset: 2624)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !211, file: !4, line: 1554, baseType: !209, size: 64, offset: 2688)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !211, file: !4, line: 1555, baseType: !209, size: 64, offset: 2752)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !144, file: !4, line: 1425, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !4, line: 1348, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !4, line: 1994, size: 832, elements: !247)
!247 = !{!248, !249, !250, !360, !361, !371, !381, !382, !383, !384}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !246, file: !4, line: 1996, baseType: !96, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !246, file: !4, line: 1997, baseType: !105, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !246, file: !4, line: 1999, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !4, line: 1658, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1597, size: 3072, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !274, !275, !276, !277, !278, !288, !289, !290, !291, !293, !294, !295, !296, !297, !298, !299, !309, !310, !311, !355, !356}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !253, file: !4, line: 1599, baseType: !96, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !253, file: !4, line: 1600, baseType: !96, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !253, file: !4, line: 1601, baseType: !96, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !253, file: !4, line: 1602, baseType: !96, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !253, file: !4, line: 1603, baseType: !260, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !4, line: 1591, baseType: !21)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !253, file: !4, line: 1604, baseType: !96, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !253, file: !4, line: 1605, baseType: !92, size: 192, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !253, file: !4, line: 1606, baseType: !92, size: 192, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !253, file: !4, line: 1609, baseType: !199, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !253, file: !4, line: 1610, baseType: !187, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !253, file: !4, line: 1611, baseType: !92, size: 192, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !253, file: !4, line: 1612, baseType: !244, size: 64, offset: 896)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !253, file: !4, line: 1615, baseType: !105, size: 64, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !253, file: !4, line: 1616, baseType: !187, size: 64, offset: 1024)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !253, file: !4, line: 1617, baseType: !187, size: 64, offset: 1088)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !253, file: !4, line: 1618, baseType: !96, size: 32, offset: 1152)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !253, file: !4, line: 1619, baseType: !273, size: 64, offset: 1216)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !253, file: !4, line: 1626, baseType: !92, size: 192, offset: 1280)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !253, file: !4, line: 1628, baseType: !96, size: 32, offset: 1472)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !253, file: !4, line: 1629, baseType: !96, size: 32, offset: 1504)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !253, file: !4, line: 1631, baseType: !96, size: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !253, file: !4, line: 1632, baseType: !279, size: 128, offset: 1600)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !107, line: 1786, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !281, line: 8, size: 128, elements: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!282 = !{!283, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !280, file: !281, line: 10, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !285, line: 160, baseType: !113)
!285 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !280, file: !281, line: 11, baseType: !287, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !285, line: 162, baseType: !113)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !253, file: !4, line: 1633, baseType: !279, size: 128, offset: 1728)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !253, file: !4, line: 1634, baseType: !279, size: 128, offset: 1856)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !253, file: !4, line: 1636, baseType: !273, size: 64, offset: 1984)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !253, file: !4, line: 1637, baseType: !292, size: 64, offset: 2048)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !253, file: !4, line: 1638, baseType: !292, size: 64, offset: 2112)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !253, file: !4, line: 1639, baseType: !279, size: 128, offset: 2176)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !253, file: !4, line: 1640, baseType: !279, size: 128, offset: 2304)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !253, file: !4, line: 1641, baseType: !279, size: 128, offset: 2432)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !253, file: !4, line: 1642, baseType: !96, size: 32, offset: 2560)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !253, file: !4, line: 1643, baseType: !96, size: 32, offset: 2592)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !253, file: !4, line: 1645, baseType: !300, size: 192, offset: 2624)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !4, line: 92, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 85, size: 192, elements: !302)
!302 = !{!303, !305, !306, !308}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !301, file: !4, line: 87, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !4, line: 62, baseType: !96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !301, file: !4, line: 88, baseType: !96, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !301, file: !4, line: 89, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !107, line: 1687, baseType: !113)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !301, file: !4, line: 91, baseType: !96, size: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !253, file: !4, line: 1648, baseType: !96, size: 32, offset: 2816)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !253, file: !4, line: 1649, baseType: !96, size: 32, offset: 2848)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !253, file: !4, line: 1651, baseType: !312, size: 64, offset: 2880)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !4, line: 1582, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !4, line: 1682, size: 17280, elements: !315)
!315 = !{!316, !317, !318, !319, !339, !340, !341, !342, !343, !344, !346, !347, !348, !349, !350, !351, !352, !353, !354}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !314, file: !4, line: 1684, baseType: !251, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !314, file: !4, line: 1685, baseType: !96, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !314, file: !4, line: 1686, baseType: !96, size: 32, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !314, file: !4, line: 1691, baseType: !320, size: 4608, offset: 128)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 4608, elements: !337)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !314, file: !4, line: 1687, size: 384, elements: !322)
!322 = !{!323, !333}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !321, file: !4, line: 1689, baseType: !324, size: 192)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !4, line: 1519, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !4, line: 1513, size: 192, elements: !326)
!326 = !{!327, !328, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !325, file: !4, line: 1515, baseType: !137, size: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !325, file: !4, line: 1516, baseType: !106, size: 8, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !325, file: !4, line: 1517, baseType: !330, size: 8, offset: 136)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 8, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 1)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "room", scope: !321, file: !4, line: 1690, baseType: !334, size: 160, offset: 192)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 160, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 20)
!337 = !{!338}
!338 = !DISubrange(count: 12)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars", scope: !314, file: !4, line: 1692, baseType: !210, size: 2816, offset: 4736)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars_var", scope: !314, file: !4, line: 1693, baseType: !324, size: 192, offset: 7552)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars", scope: !314, file: !4, line: 1694, baseType: !210, size: 2816, offset: 7744)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars_var", scope: !314, file: !4, line: 1695, baseType: !324, size: 192, offset: 10560)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "l_varlist", scope: !314, file: !4, line: 1696, baseType: !153, size: 768, offset: 10752)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "l_listitems", scope: !314, file: !4, line: 1697, baseType: !345, size: 5120, offset: 11520)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 5120, elements: !335)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rettv", scope: !314, file: !4, line: 1698, baseType: !136, size: 64, offset: 16640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !314, file: !4, line: 1699, baseType: !307, size: 64, offset: 16704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dbg_tick", scope: !314, file: !4, line: 1700, baseType: !96, size: 32, offset: 16768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !314, file: !4, line: 1701, baseType: !96, size: 32, offset: 16800)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prof_child", scope: !314, file: !4, line: 1703, baseType: !279, size: 128, offset: 16832)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !314, file: !4, line: 1705, baseType: !312, size: 64, offset: 16960)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fc_refcount", scope: !314, file: !4, line: 1709, baseType: !96, size: 32, offset: 17024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fc_copyID", scope: !314, file: !4, line: 1711, baseType: !96, size: 32, offset: 17056)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fc_funcs", scope: !314, file: !4, line: 1712, baseType: !92, size: 192, offset: 17088)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name_exp", scope: !253, file: !4, line: 1653, baseType: !105, size: 64, offset: 2944)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name", scope: !253, file: !4, line: 1655, baseType: !357, size: 32, offset: 3008)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 32, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 4)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pt_auto", scope: !246, file: !4, line: 2001, baseType: !96, size: 32, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pt_outer", scope: !246, file: !4, line: 2005, baseType: !362, size: 256, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "outer_T", file: !4, line: 1986, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_S", file: !4, line: 1987, size: 256, elements: !364)
!364 = !{!365, !367, !368, !370}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "out_stack", scope: !363, file: !4, line: 1988, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame_idx", scope: !363, file: !4, line: 1989, baseType: !96, size: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "out_up", scope: !363, file: !4, line: 1990, baseType: !369, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "out_up_is_copy", scope: !363, file: !4, line: 1991, baseType: !96, size: 32, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pt_funcstack", scope: !246, file: !4, line: 2007, baseType: !372, size: 64, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "funcstack_T", file: !4, line: 1984, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcstack_S", file: !4, line: 1972, size: 320, elements: !375)
!375 = !{!376, !377, !378, !379, !380}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ga", scope: !374, file: !4, line: 1974, baseType: !92, size: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fs_var_offset", scope: !374, file: !4, line: 1978, baseType: !96, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fs_refcount", scope: !374, file: !4, line: 1981, baseType: !96, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fs_min_refcount", scope: !374, file: !4, line: 1982, baseType: !96, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fs_copyID", scope: !374, file: !4, line: 1983, baseType: !96, size: 32, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argc", scope: !246, file: !4, line: 2010, baseType: !96, size: 32, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argv", scope: !246, file: !4, line: 2011, baseType: !136, size: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pt_dict", scope: !246, file: !4, line: 2013, baseType: !209, size: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pt_copyID", scope: !246, file: !4, line: 2014, baseType: !96, size: 32, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !144, file: !4, line: 1427, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !4, line: 1365, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !4, line: 2072, size: 1024, elements: !389)
!389 = !{!390, !391, !392, !396, !397, !398, !400, !401, !402, !403, !410, !1683, !1684, !1685, !1781}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !388, file: !4, line: 2074, baseType: !386, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !388, file: !4, line: 2075, baseType: !386, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !388, file: !4, line: 2077, baseType: !393, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !394, line: 97, baseType: !395)
!394 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !285, line: 154, baseType: !96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !388, file: !4, line: 2083, baseType: !105, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !388, file: !4, line: 2084, baseType: !105, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !388, file: !4, line: 2085, baseType: !399, size: 32, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !4, line: 2067, baseType: !28)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !388, file: !4, line: 2086, baseType: !105, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !388, file: !4, line: 2088, baseType: !105, size: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !388, file: !4, line: 2093, baseType: !96, size: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !388, file: !4, line: 2094, baseType: !404, size: 192, offset: 576)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !4, line: 1360, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1356, size: 192, elements: !406)
!406 = !{!407, !408, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !405, file: !4, line: 1357, baseType: !105, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !405, file: !4, line: 1358, baseType: !244, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !405, file: !4, line: 1359, baseType: !96, size: 32, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !388, file: !4, line: 2096, baseType: !411, size: 64, offset: 768)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !4, line: 63, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !4, line: 2629, size: 73152, elements: !414)
!414 = !{!415, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !524, !527, !528, !532, !533, !543, !544, !545, !546, !547, !548, !549, !550, !1356, !1357, !1358, !1363, !1364, !1365, !1369, !1377, !1378, !1379, !1380, !1381, !1383, !1384, !1385, !1386, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1630, !1631, !1632, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1666, !1667, !1668, !1669, !1670, !1677, !1678, !1682}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !413, file: !4, line: 2631, baseType: !416, size: 832)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !4, line: 766, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !4, line: 737, size: 832, elements: !418)
!418 = !{!419, !420, !482, !491, !492, !493, !494, !496, !497, !498, !499, !500, !501, !502, !509, !510}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !417, file: !4, line: 739, baseType: !307, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !417, file: !4, line: 741, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !4, line: 459, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !4, line: 671, size: 9856, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !449, !450, !451, !453, !454, !467, !468, !469, !470, !471, !472, !473, !474, !475, !479, !480, !481}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !423, file: !4, line: 673, baseType: !105, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !423, file: !4, line: 674, baseType: !105, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !423, file: !4, line: 675, baseType: !96, size: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !423, file: !4, line: 676, baseType: !96, size: 32, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !423, file: !4, line: 677, baseType: !96, size: 32, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !423, file: !4, line: 678, baseType: !431, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !4, line: 458, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !4, line: 506, size: 448, elements: !434)
!434 = !{!435, !444, !445, !446, !447, !448}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !433, file: !4, line: 508, baseType: !436, size: 192)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !4, line: 469, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !4, line: 471, size: 192, elements: !438)
!438 = !{!439, !441, !442}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !437, file: !4, line: 473, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !437, file: !4, line: 474, baseType: !440, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !437, file: !4, line: 475, baseType: !443, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !4, line: 460, baseType: !113)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !433, file: !4, line: 511, baseType: !431, size: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !433, file: !4, line: 512, baseType: !431, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !433, file: !4, line: 513, baseType: !105, size: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !433, file: !4, line: 514, baseType: !96, size: 32, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !433, file: !4, line: 518, baseType: !104, size: 8, offset: 416)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !423, file: !4, line: 679, baseType: !431, size: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !423, file: !4, line: 680, baseType: !431, size: 64, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !423, file: !4, line: 681, baseType: !452, size: 32, offset: 448)
!452 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !423, file: !4, line: 682, baseType: !452, size: 32, offset: 480)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !423, file: !4, line: 683, baseType: !455, size: 4352, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !4, line: 489, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !4, line: 480, size: 4352, elements: !457)
!457 = !{!458, !459, !460, !462, !466}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !456, file: !4, line: 482, baseType: !222, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !456, file: !4, line: 484, baseType: !222, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !456, file: !4, line: 485, baseType: !461, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !456, file: !4, line: 487, baseType: !463, size: 4096, offset: 192)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 4096, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !456, file: !4, line: 488, baseType: !104, size: 8, offset: 4288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !423, file: !4, line: 684, baseType: !455, size: 4352, offset: 4864)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !423, file: !4, line: 685, baseType: !443, size: 64, offset: 9216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !423, file: !4, line: 686, baseType: !443, size: 64, offset: 9280)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !423, file: !4, line: 687, baseType: !443, size: 64, offset: 9344)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !423, file: !4, line: 688, baseType: !443, size: 64, offset: 9408)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !423, file: !4, line: 689, baseType: !452, size: 32, offset: 9472)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !423, file: !4, line: 690, baseType: !96, size: 32, offset: 9504)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !423, file: !4, line: 692, baseType: !411, size: 64, offset: 9536)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !423, file: !4, line: 693, baseType: !476, size: 64, offset: 9600)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 64, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 8)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !423, file: !4, line: 697, baseType: !105, size: 64, offset: 9664)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !423, file: !4, line: 698, baseType: !96, size: 32, offset: 9728)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !423, file: !4, line: 699, baseType: !476, size: 64, offset: 9760)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !417, file: !4, line: 743, baseType: !483, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !4, line: 717, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !4, line: 711, size: 256, elements: !486)
!486 = !{!487, !488, !489, !490}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !485, file: !4, line: 713, baseType: !443, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !485, file: !4, line: 714, baseType: !307, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !485, file: !4, line: 715, baseType: !307, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !485, file: !4, line: 716, baseType: !96, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !417, file: !4, line: 744, baseType: !96, size: 32, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !417, file: !4, line: 745, baseType: !96, size: 32, offset: 224)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !417, file: !4, line: 751, baseType: !96, size: 32, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !417, file: !4, line: 753, baseType: !495, size: 32, offset: 288)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !107, line: 1688, baseType: !96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !417, file: !4, line: 754, baseType: !307, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !417, file: !4, line: 755, baseType: !105, size: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !417, file: !4, line: 757, baseType: !431, size: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !417, file: !4, line: 758, baseType: !307, size: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !417, file: !4, line: 759, baseType: !307, size: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !417, file: !4, line: 760, baseType: !96, size: 32, offset: 640)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !417, file: !4, line: 762, baseType: !503, size: 64, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !4, line: 724, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !4, line: 720, size: 128, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !505, file: !4, line: 722, baseType: !96, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !505, file: !4, line: 723, baseType: !113, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !417, file: !4, line: 763, baseType: !96, size: 32, offset: 768)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !417, file: !4, line: 764, baseType: !96, size: 32, offset: 800)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !413, file: !4, line: 2634, baseType: !411, size: 64, offset: 832)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !413, file: !4, line: 2635, baseType: !411, size: 64, offset: 896)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !413, file: !4, line: 2637, baseType: !96, size: 32, offset: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !413, file: !4, line: 2639, baseType: !96, size: 32, offset: 992)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !413, file: !4, line: 2640, baseType: !96, size: 32, offset: 1024)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !413, file: !4, line: 2642, baseType: !96, size: 32, offset: 1056)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !413, file: !4, line: 2651, baseType: !105, size: 64, offset: 1088)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !413, file: !4, line: 2652, baseType: !105, size: 64, offset: 1152)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !413, file: !4, line: 2654, baseType: !105, size: 64, offset: 1216)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !413, file: !4, line: 2658, baseType: !96, size: 32, offset: 1280)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !413, file: !4, line: 2659, baseType: !522, size: 64, offset: 1344)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !394, line: 59, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !285, line: 145, baseType: !111)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !413, file: !4, line: 2660, baseType: !525, size: 64, offset: 1408)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !394, line: 47, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !285, line: 148, baseType: !111)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !413, file: !4, line: 2667, baseType: !96, size: 32, offset: 1472)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !413, file: !4, line: 2668, baseType: !529, size: 72, offset: 1504)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 72, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 9)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !413, file: !4, line: 2672, baseType: !96, size: 32, offset: 1600)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !413, file: !4, line: 2674, baseType: !534, size: 320, offset: 1664)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !4, line: 1532, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !4, line: 1526, size: 320, elements: !536)
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !535, file: !4, line: 1528, baseType: !137, size: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !535, file: !4, line: 1529, baseType: !106, size: 8, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !535, file: !4, line: 1530, baseType: !540, size: 136, offset: 136)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 136, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 17)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !413, file: !4, line: 2679, baseType: !114, size: 64, offset: 1984)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !413, file: !4, line: 2681, baseType: !114, size: 64, offset: 2048)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !413, file: !4, line: 2684, baseType: !96, size: 32, offset: 2112)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !413, file: !4, line: 2691, baseType: !96, size: 32, offset: 2144)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !413, file: !4, line: 2693, baseType: !307, size: 64, offset: 2176)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !413, file: !4, line: 2694, baseType: !307, size: 64, offset: 2240)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !413, file: !4, line: 2696, baseType: !113, size: 64, offset: 2304)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !413, file: !4, line: 2699, baseType: !551, size: 64, offset: 2368)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !4, line: 60, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !4, line: 325, size: 11648, elements: !554)
!554 = !{!555, !556, !557, !1351, !1352, !1353, !1354, !1355}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !553, file: !4, line: 327, baseType: !551, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !553, file: !4, line: 328, baseType: !551, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !553, file: !4, line: 329, baseType: !558, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !4, line: 59, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !4, line: 3365, size: 72064, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !721, !722, !737, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !794, !795, !796, !797, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !818, !819, !821, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !842, !843, !844, !845, !846, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !906, !907, !908, !909, !910, !1163, !1171, !1172, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1264, !1265, !1266, !1267, !1308, !1309, !1319, !1320, !1321, !1322, !1323, !1343, !1344, !1345, !1346, !1350}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !560, file: !4, line: 3367, baseType: !96, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !560, file: !4, line: 3369, baseType: !411, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !560, file: !4, line: 3371, baseType: !558, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !560, file: !4, line: 3372, baseType: !558, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !560, file: !4, line: 3375, baseType: !567, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !4, line: 2618, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 2542, size: 9920, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !586, !587, !588, !589, !590, !648, !656, !657, !658, !659, !660, !697, !698, !699, !700, !701, !702, !704, !705, !709, !710, !711, !712, !713, !714, !715, !716, !720}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !569, file: !4, line: 2544, baseType: !218, size: 2432)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !569, file: !4, line: 2545, baseType: !218, size: 2432, offset: 2432)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !569, file: !4, line: 2546, baseType: !96, size: 32, offset: 4864)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !569, file: !4, line: 2548, baseType: !96, size: 32, offset: 4896)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !569, file: !4, line: 2550, baseType: !96, size: 32, offset: 4928)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !569, file: !4, line: 2551, baseType: !96, size: 32, offset: 4960)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !569, file: !4, line: 2552, baseType: !96, size: 32, offset: 4992)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !569, file: !4, line: 2553, baseType: !92, size: 192, offset: 5056)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !569, file: !4, line: 2554, baseType: !92, size: 192, offset: 5248)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !569, file: !4, line: 2555, baseType: !96, size: 32, offset: 5440)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !569, file: !4, line: 2556, baseType: !96, size: 32, offset: 5472)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !569, file: !4, line: 2557, baseType: !96, size: 32, offset: 5504)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !569, file: !4, line: 2559, baseType: !96, size: 32, offset: 5536)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !569, file: !4, line: 2560, baseType: !585, size: 16, offset: 5568)
!585 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !569, file: !4, line: 2561, baseType: !113, size: 64, offset: 5632)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !569, file: !4, line: 2562, baseType: !113, size: 64, offset: 5696)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !569, file: !4, line: 2563, baseType: !113, size: 64, offset: 5760)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !569, file: !4, line: 2564, baseType: !105, size: 64, offset: 5824)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !569, file: !4, line: 2565, baseType: !591, size: 64, offset: 5888)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !593, line: 56, baseType: !594)
!593 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !593, line: 49, size: 192, elements: !595)
!595 = !{!596, !644, !645, !646, !647}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !594, file: !593, line: 51, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !593, line: 42, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !593, line: 167, size: 320, elements: !600)
!600 = !{!601, !605, !609, !624, !643}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !599, file: !593, line: 169, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!591, !105, !96}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !599, file: !593, line: 170, baseType: !606, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !591}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !599, file: !593, line: 171, baseType: !610, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!96, !613, !105, !495, !96}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !593, line: 137, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 131, size: 1408, elements: !616)
!616 = !{!617, !618, !622, !623}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !615, file: !593, line: 133, baseType: !591, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !615, file: !593, line: 134, baseType: !619, size: 640, offset: 64)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 640, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 10)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !615, file: !593, line: 135, baseType: !619, size: 640, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !615, file: !593, line: 136, baseType: !96, size: 32, offset: 1344)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !599, file: !593, line: 172, baseType: !625, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!113, !628, !558, !411, !307, !495, !292, !273}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !593, line: 154, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 147, size: 2688, elements: !631)
!631 = !{!632, !633, !640, !641, !642}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !630, file: !593, line: 149, baseType: !591, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !630, file: !593, line: 150, baseType: !634, size: 1280, offset: 64)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 1280, elements: !620)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !4, line: 41, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 37, size: 128, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !636, file: !4, line: 39, baseType: !307, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !636, file: !4, line: 40, baseType: !495, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !630, file: !593, line: 151, baseType: !634, size: 1280, offset: 1344)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !630, file: !593, line: 152, baseType: !96, size: 32, offset: 2624)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !630, file: !593, line: 153, baseType: !495, size: 32, offset: 2656)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !599, file: !593, line: 173, baseType: !105, size: 64, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !594, file: !593, line: 52, baseType: !452, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !594, file: !593, line: 53, baseType: !452, size: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !594, file: !593, line: 54, baseType: !452, size: 32, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !594, file: !593, line: 55, baseType: !96, size: 32, offset: 160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !569, file: !4, line: 2567, baseType: !649, size: 384, offset: 5952)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !4, line: 2475, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 2470, size: 384, elements: !651)
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !650, file: !4, line: 2471, baseType: !279, size: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !650, file: !4, line: 2472, baseType: !279, size: 128, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !650, file: !4, line: 2473, baseType: !113, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !650, file: !4, line: 2474, baseType: !113, size: 64, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !569, file: !4, line: 2569, baseType: !96, size: 32, offset: 6336)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !569, file: !4, line: 2570, baseType: !96, size: 32, offset: 6368)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !569, file: !4, line: 2572, baseType: !96, size: 32, offset: 6400)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !569, file: !4, line: 2575, baseType: !96, size: 32, offset: 6432)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !569, file: !4, line: 2592, baseType: !661, size: 64, offset: 6464)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !4, line: 1061, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !4, line: 1063, size: 1728, elements: !664)
!664 = !{!665, !666, !667, !689, !690, !691, !693, !696}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !663, file: !4, line: 1065, baseType: !661, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !663, file: !4, line: 1066, baseType: !307, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !663, file: !4, line: 1071, baseType: !668, size: 1344, offset: 128)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !663, file: !4, line: 1067, size: 1344, elements: !669)
!669 = !{!670, !688}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !668, file: !4, line: 1069, baseType: !671, size: 1344)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 1344, elements: !686)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !4, line: 1055, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !4, line: 1046, size: 192, elements: !674)
!674 = !{!675, !676, !677, !678, !679}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !673, file: !4, line: 1048, baseType: !96, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !673, file: !4, line: 1049, baseType: !96, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !673, file: !4, line: 1051, baseType: !96, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !673, file: !4, line: 1052, baseType: !96, size: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !673, file: !4, line: 1054, baseType: !680, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !593, line: 165, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 161, size: 704, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !682, file: !593, line: 163, baseType: !585, size: 16)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !682, file: !593, line: 164, baseType: !619, size: 640, offset: 64)
!686 = !{!687}
!687 = !DISubrange(count: 7)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !668, file: !4, line: 1070, baseType: !92, size: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !663, file: !4, line: 1072, baseType: !96, size: 32, offset: 1472)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !663, file: !4, line: 1073, baseType: !96, size: 32, offset: 1504)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !663, file: !4, line: 1074, baseType: !692, size: 64, offset: 1536)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !663, file: !4, line: 1076, baseType: !694, size: 16, offset: 1600)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !107, line: 1689, baseType: !695)
!695 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !663, file: !4, line: 1077, baseType: !307, size: 64, offset: 1664)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !569, file: !4, line: 2593, baseType: !96, size: 32, offset: 6528)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !569, file: !4, line: 2594, baseType: !661, size: 64, offset: 6592)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !569, file: !4, line: 2595, baseType: !661, size: 64, offset: 6656)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !569, file: !4, line: 2596, baseType: !96, size: 32, offset: 6720)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !569, file: !4, line: 2597, baseType: !307, size: 64, offset: 6784)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !569, file: !4, line: 2598, baseType: !703, size: 16, offset: 6848)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !107, line: 325, baseType: !695)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !569, file: !4, line: 2603, baseType: !92, size: 192, offset: 6912)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !569, file: !4, line: 2604, baseType: !706, size: 2048, offset: 7104)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 2048, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !569, file: !4, line: 2605, baseType: !105, size: 64, offset: 9152)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !569, file: !4, line: 2606, baseType: !105, size: 64, offset: 9216)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !569, file: !4, line: 2607, baseType: !591, size: 64, offset: 9280)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !569, file: !4, line: 2608, baseType: !105, size: 64, offset: 9344)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !569, file: !4, line: 2609, baseType: !105, size: 64, offset: 9408)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !569, file: !4, line: 2610, baseType: !105, size: 64, offset: 9472)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !569, file: !4, line: 2611, baseType: !96, size: 32, offset: 9536)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !569, file: !4, line: 2616, baseType: !717, size: 256, offset: 9568)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 256, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !569, file: !4, line: 2617, baseType: !105, size: 64, offset: 9856)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !560, file: !4, line: 3378, baseType: !96, size: 32, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !560, file: !4, line: 3381, baseType: !723, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !4, line: 61, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !4, line: 3231, size: 512, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !725, file: !4, line: 3233, baseType: !104, size: 8)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !725, file: !4, line: 3234, baseType: !96, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !725, file: !4, line: 3235, baseType: !96, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !725, file: !4, line: 3236, baseType: !96, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !725, file: !4, line: 3237, baseType: !96, size: 32, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !725, file: !4, line: 3238, baseType: !723, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !725, file: !4, line: 3239, baseType: !723, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !725, file: !4, line: 3241, baseType: !723, size: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !725, file: !4, line: 3244, baseType: !723, size: 64, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !725, file: !4, line: 3245, baseType: !558, size: 64, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !560, file: !4, line: 3383, baseType: !738, size: 128, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !4, line: 31, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 26, size: 128, elements: !740)
!740 = !{!741, !742, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !739, file: !4, line: 28, baseType: !307, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !739, file: !4, line: 29, baseType: !495, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !739, file: !4, line: 30, baseType: !495, size: 32, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !560, file: !4, line: 3385, baseType: !495, size: 32, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !560, file: !4, line: 3389, baseType: !96, size: 32, offset: 608)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !560, file: !4, line: 3394, baseType: !307, size: 64, offset: 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !560, file: !4, line: 3400, baseType: !104, size: 8, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !560, file: !4, line: 3401, baseType: !307, size: 64, offset: 768)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !560, file: !4, line: 3402, baseType: !495, size: 32, offset: 832)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !560, file: !4, line: 3403, baseType: !495, size: 32, offset: 864)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !560, file: !4, line: 3404, baseType: !307, size: 64, offset: 896)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !560, file: !4, line: 3405, baseType: !495, size: 32, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !560, file: !4, line: 3406, baseType: !495, size: 32, offset: 992)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !560, file: !4, line: 3408, baseType: !755, size: 352, offset: 1024)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !4, line: 3358, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 3343, size: 352, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !756, file: !4, line: 3345, baseType: !96, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !756, file: !4, line: 3346, baseType: !96, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !756, file: !4, line: 3347, baseType: !96, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !756, file: !4, line: 3348, baseType: !96, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !756, file: !4, line: 3349, baseType: !96, size: 32, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !756, file: !4, line: 3350, baseType: !96, size: 32, offset: 160)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !756, file: !4, line: 3351, baseType: !96, size: 32, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !756, file: !4, line: 3352, baseType: !96, size: 32, offset: 224)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !756, file: !4, line: 3353, baseType: !96, size: 32, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !756, file: !4, line: 3354, baseType: !96, size: 32, offset: 288)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !756, file: !4, line: 3356, baseType: !96, size: 32, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !560, file: !4, line: 3414, baseType: !307, size: 64, offset: 1408)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !560, file: !4, line: 3416, baseType: !104, size: 8, offset: 1472)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !560, file: !4, line: 3419, baseType: !307, size: 64, offset: 1536)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !560, file: !4, line: 3423, baseType: !96, size: 32, offset: 1600)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !560, file: !4, line: 3424, baseType: !96, size: 32, offset: 1632)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !560, file: !4, line: 3425, baseType: !96, size: 32, offset: 1664)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !560, file: !4, line: 3427, baseType: !96, size: 32, offset: 1696)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !560, file: !4, line: 3429, baseType: !495, size: 32, offset: 1728)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !560, file: !4, line: 3432, baseType: !495, size: 32, offset: 1760)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !560, file: !4, line: 3435, baseType: !96, size: 32, offset: 1792)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !560, file: !4, line: 3437, baseType: !96, size: 32, offset: 1824)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !560, file: !4, line: 3445, baseType: !96, size: 32, offset: 1856)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !560, file: !4, line: 3446, baseType: !96, size: 32, offset: 1888)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !560, file: !4, line: 3449, baseType: !96, size: 32, offset: 1920)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !560, file: !4, line: 3450, baseType: !96, size: 32, offset: 1952)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !560, file: !4, line: 3451, baseType: !96, size: 32, offset: 1984)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !560, file: !4, line: 3452, baseType: !96, size: 32, offset: 2016)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !560, file: !4, line: 3454, baseType: !787, size: 320, offset: 2048)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !4, line: 3330, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 3324, size: 320, elements: !789)
!789 = !{!790, !791, !792, !793}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !788, file: !4, line: 3326, baseType: !96, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !788, file: !4, line: 3327, baseType: !96, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !788, file: !4, line: 3328, baseType: !738, size: 128, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !788, file: !4, line: 3329, baseType: !738, size: 128, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !560, file: !4, line: 3457, baseType: !96, size: 32, offset: 2368)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !560, file: !4, line: 3458, baseType: !96, size: 32, offset: 2400)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !560, file: !4, line: 3459, baseType: !105, size: 64, offset: 2432)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !560, file: !4, line: 3460, baseType: !798, size: 32, offset: 2496)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !4, line: 2524, baseType: !34)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !560, file: !4, line: 3461, baseType: !96, size: 32, offset: 2528)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !560, file: !4, line: 3462, baseType: !96, size: 32, offset: 2560)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !560, file: !4, line: 3463, baseType: !558, size: 64, offset: 2624)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !560, file: !4, line: 3464, baseType: !96, size: 32, offset: 2688)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !560, file: !4, line: 3465, baseType: !96, size: 32, offset: 2720)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !560, file: !4, line: 3466, baseType: !96, size: 32, offset: 2752)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !560, file: !4, line: 3467, baseType: !96, size: 32, offset: 2784)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !560, file: !4, line: 3468, baseType: !96, size: 32, offset: 2816)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !560, file: !4, line: 3469, baseType: !96, size: 32, offset: 2848)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !560, file: !4, line: 3470, baseType: !96, size: 32, offset: 2880)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !560, file: !4, line: 3471, baseType: !96, size: 32, offset: 2912)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !560, file: !4, line: 3472, baseType: !96, size: 32, offset: 2944)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !560, file: !4, line: 3473, baseType: !96, size: 32, offset: 2976)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !560, file: !4, line: 3474, baseType: !96, size: 32, offset: 3008)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !560, file: !4, line: 3475, baseType: !96, size: 32, offset: 3040)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !560, file: !4, line: 3476, baseType: !105, size: 64, offset: 3072)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !560, file: !4, line: 3477, baseType: !105, size: 64, offset: 3136)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !560, file: !4, line: 3478, baseType: !817, size: 128, offset: 3200)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !358)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !560, file: !4, line: 3479, baseType: !817, size: 128, offset: 3328)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !560, file: !4, line: 3480, baseType: !820, size: 256, offset: 3456)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 256, elements: !358)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !560, file: !4, line: 3481, baseType: !822, size: 256, offset: 3712)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 256, elements: !477)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !560, file: !4, line: 3483, baseType: !96, size: 32, offset: 3968)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !560, file: !4, line: 3484, baseType: !96, size: 32, offset: 4000)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !560, file: !4, line: 3485, baseType: !114, size: 64, offset: 4032)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !560, file: !4, line: 3487, baseType: !114, size: 64, offset: 4096)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !560, file: !4, line: 3490, baseType: !96, size: 32, offset: 4160)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !560, file: !4, line: 3493, baseType: !307, size: 64, offset: 4224)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !560, file: !4, line: 3495, baseType: !404, size: 192, offset: 4288)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !560, file: !4, line: 3496, baseType: !404, size: 192, offset: 4480)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !560, file: !4, line: 3497, baseType: !96, size: 32, offset: 4672)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !560, file: !4, line: 3498, baseType: !96, size: 32, offset: 4704)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !560, file: !4, line: 3500, baseType: !558, size: 64, offset: 4736)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !560, file: !4, line: 3501, baseType: !307, size: 64, offset: 4800)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !560, file: !4, line: 3502, baseType: !495, size: 32, offset: 4864)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !560, file: !4, line: 3503, baseType: !495, size: 32, offset: 4896)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !560, file: !4, line: 3504, baseType: !96, size: 32, offset: 4928)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !560, file: !4, line: 3505, baseType: !96, size: 32, offset: 4960)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !560, file: !4, line: 3506, baseType: !96, size: 32, offset: 4992)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !560, file: !4, line: 3507, baseType: !841, size: 32, offset: 5024)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !4, line: 2530, baseType: !42)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !560, file: !4, line: 3509, baseType: !152, size: 64, offset: 5056)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !560, file: !4, line: 3510, baseType: !105, size: 64, offset: 5120)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !560, file: !4, line: 3511, baseType: !96, size: 32, offset: 5184)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !560, file: !4, line: 3512, baseType: !96, size: 32, offset: 5216)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !560, file: !4, line: 3514, baseType: !847, size: 64, offset: 5248)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !4, line: 2478, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !4, line: 2479, size: 704, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !849, file: !4, line: 2481, baseType: !113, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !849, file: !4, line: 2483, baseType: !847, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !849, file: !4, line: 2484, baseType: !847, size: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !849, file: !4, line: 2485, baseType: !279, size: 128, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !849, file: !4, line: 2486, baseType: !104, size: 8, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !849, file: !4, line: 2487, baseType: !104, size: 8, offset: 328)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !849, file: !4, line: 2488, baseType: !96, size: 32, offset: 352)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !849, file: !4, line: 2489, baseType: !113, size: 64, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !849, file: !4, line: 2490, baseType: !404, size: 192, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !849, file: !4, line: 2491, baseType: !96, size: 32, offset: 640)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !560, file: !4, line: 3517, baseType: !96, size: 32, offset: 5312)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !560, file: !4, line: 3534, baseType: !96, size: 32, offset: 5344)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !560, file: !4, line: 3535, baseType: !738, size: 128, offset: 5376)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !560, file: !4, line: 3537, baseType: !495, size: 32, offset: 5504)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !560, file: !4, line: 3543, baseType: !96, size: 32, offset: 5536)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !560, file: !4, line: 3545, baseType: !96, size: 32, offset: 5568)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !560, file: !4, line: 3548, baseType: !96, size: 32, offset: 5600)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !560, file: !4, line: 3550, baseType: !495, size: 32, offset: 5632)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !560, file: !4, line: 3562, baseType: !96, size: 32, offset: 5664)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !560, file: !4, line: 3562, baseType: !96, size: 32, offset: 5696)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !560, file: !4, line: 3574, baseType: !96, size: 32, offset: 5728)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !560, file: !4, line: 3575, baseType: !873, size: 64, offset: 5760)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !4, line: 3225, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !4, line: 3216, size: 192, elements: !876)
!876 = !{!877, !878, !879, !880, !881}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !875, file: !4, line: 3218, baseType: !307, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !875, file: !4, line: 3219, baseType: !703, size: 16, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !875, file: !4, line: 3220, baseType: !104, size: 8, offset: 80)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !875, file: !4, line: 3222, baseType: !104, size: 8, offset: 88)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !875, file: !4, line: 3223, baseType: !307, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !560, file: !4, line: 3578, baseType: !92, size: 192, offset: 5824)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !560, file: !4, line: 3579, baseType: !104, size: 8, offset: 6016)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !560, file: !4, line: 3581, baseType: !104, size: 8, offset: 6024)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !560, file: !4, line: 3585, baseType: !96, size: 32, offset: 6048)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !560, file: !4, line: 3593, baseType: !96, size: 32, offset: 6080)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !560, file: !4, line: 3594, baseType: !96, size: 32, offset: 6112)
