; ModuleID = 'blowfish.c'
source_filename = "blowfish.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.struct_bf_test_data = type { [64 x i8], [9 x i8], [9 x i8], [9 x i8], [9 x i8], i32 }
%struct.cryptstate_T = type { i32, i8* }
%struct.bf_state_T = type { [18 x i32], [4 x [256 x i32]], i32, i32, [64 x i8], i32 }

@.str = private unnamed_addr constant [25 x i8] c"E818: sha256 test failed\00", align 1
@.str.1 = private unnamed_addr constant [27 x i8] c"E819: Blowfish test failed\00", align 1
@.str.2 = private unnamed_addr constant [47 x i8] c"E831: bf_key_init() called with empty password\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"%2x\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "sbx_init", scope: !2, file: !3, line: 68, type: !24, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.1-14 (tags/RELEASE_601/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !40)
!3 = !DIFile(filename: "blowfish.c", directory: "/home/sahil/vim/src")
!4 = !{}
!5 = !{!6, !9, !36, !37, !29, !39}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !7, line: 324, baseType: !8)
!7 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "bf_state_T", file: !3, line: 55, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 48, size: 33952, elements: !12)
!12 = !{!13, !23, !28, !30, !31, !35}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "pax", scope: !11, file: !3, line: 49, baseType: !14, size: 576)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 576, elements: !21)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32_T", file: !7, line: 1438, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 26, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "/home/sahil/vim/src")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !19, line: 42, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !{!22}
!22 = !DISubrange(count: 18)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sbx", scope: !11, file: !3, line: 50, baseType: !24, size: 32768, offset: 576)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32768, elements: !25)
!25 = !{!26, !27}
!26 = !DISubrange(count: 4)
!27 = !DISubrange(count: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "randbyte_offset", scope: !11, file: !3, line: 51, baseType: !29, size: 32, offset: 33344)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "update_offset", scope: !11, file: !3, line: 52, baseType: !29, size: 32, offset: 33376)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cfb_buffer", scope: !11, file: !3, line: 53, baseType: !32, size: 512, offset: 33408)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cfb_len", scope: !11, file: !3, line: 54, baseType: !29, size: 32, offset: 33920)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!40 = !{!0, !41, !43}
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "pax_init", scope: !2, file: !3, line: 59, type: !14, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "bf_test_data", scope: !2, file: !3, line: 494, type: !45, isLocal: true, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 832, elements: !58)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "struct_bf_test_data", file: !3, line: 488, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 481, size: 832, elements: !48)
!48 = !{!49, !50, !54, !55, !56, !57}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !47, file: !3, line: 482, baseType: !32, size: 512)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "salt", scope: !47, file: !3, line: 483, baseType: !51, size: 72, offset: 512)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 72, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 9)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "plaintxt", scope: !47, file: !3, line: 484, baseType: !51, size: 72, offset: 584)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cryptxt", scope: !47, file: !3, line: 485, baseType: !51, size: 72, offset: 656)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "badcryptxt", scope: !47, file: !3, line: 486, baseType: !51, size: 72, offset: 728)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "keysum", scope: !47, file: !3, line: 487, baseType: !15, size: 32, offset: 800)
!58 = !{!59}
!59 = !DISubrange(count: 1)
!60 = !{i32 2, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{i32 1, !"wchar_size", i32 4}
!63 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!64 = distinct !DISubprogram(name: "crypt_blowfish_encode", scope: !3, file: !3, line: 597, type: !65, isLocal: false, isDefinition: true, scopeLine: 602, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !77)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !39, !74, !39}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "cryptstate_T", file: !69, line: 2503, baseType: !70)
!69 = !DIFile(filename: "./structs.h", directory: "/home/sahil/vim/src")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 2500, size: 128, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "method_nr", scope: !70, file: !69, line: 2501, baseType: !29, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "method_state", scope: !70, file: !69, line: 2502, baseType: !36, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 62, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85}
!78 = !DILocalVariable(name: "state", arg: 1, scope: !64, file: !3, line: 598, type: !67)
!79 = !DILocalVariable(name: "from", arg: 2, scope: !64, file: !3, line: 599, type: !39)
!80 = !DILocalVariable(name: "len", arg: 3, scope: !64, file: !3, line: 600, type: !74)
!81 = !DILocalVariable(name: "to", arg: 4, scope: !64, file: !3, line: 601, type: !39)
!82 = !DILocalVariable(name: "bfs", scope: !64, file: !3, line: 603, type: !9)
!83 = !DILocalVariable(name: "i", scope: !64, file: !3, line: 604, type: !74)
!84 = !DILocalVariable(name: "ztemp", scope: !64, file: !3, line: 605, type: !29)
!85 = !DILocalVariable(name: "t", scope: !64, file: !3, line: 605, type: !29)
!86 = !DILocation(line: 598, column: 19, scope: !64)
!87 = !DILocation(line: 599, column: 13, scope: !64)
!88 = !DILocation(line: 600, column: 12, scope: !64)
!89 = !DILocation(line: 601, column: 13, scope: !64)
!90 = !DILocation(line: 603, column: 30, scope: !64)
!91 = !{!92, !96, i64 8}
!92 = !{!"", !93, i64 0, !96, i64 8}
!93 = !{!"int", !94, i64 0}
!94 = !{!"omnipotent char", !95, i64 0}
!95 = !{!"Simple C/C++ TBAA"}
!96 = !{!"any pointer", !94, i64 0}
!97 = !DILocation(line: 603, column: 17, scope: !64)
!98 = !DILocation(line: 604, column: 12, scope: !64)
!99 = !DILocation(line: 607, column: 19, scope: !100)
!100 = distinct !DILexicalBlock(scope: !101, file: !3, line: 607, column: 5)
!101 = distinct !DILexicalBlock(scope: !64, file: !3, line: 607, column: 5)
!102 = !DILocation(line: 607, column: 5, scope: !101)
!103 = !DILocation(line: 609, column: 10, scope: !104)
!104 = distinct !DILexicalBlock(scope: !100, file: !3, line: 608, column: 5)
!105 = !{!94, !94, i64 0}
!106 = !DILocation(line: 610, column: 2, scope: !107)
!107 = distinct !DILexicalBlock(scope: !108, file: !3, line: 610, column: 2)
!108 = distinct !DILexicalBlock(scope: !104, file: !3, line: 610, column: 2)
!109 = !{!110, !93, i64 4168}
!110 = !{!"", !94, i64 0, !94, i64 72, !93, i64 4168, !93, i64 4172, !94, i64 4176, !93, i64 4240}
!111 = !DILocation(line: 610, column: 2, scope: !108)
!112 = !DILocalVariable(name: "bfs", arg: 1, scope: !113, file: !3, line: 380, type: !9)
!113 = distinct !DISubprogram(name: "bf_e_cblock", scope: !3, file: !3, line: 379, type: !114, isLocal: true, isDefinition: true, scopeLine: 382, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !116)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !9, !39}
!116 = !{!112, !117, !118}
!117 = !DILocalVariable(name: "block", arg: 2, scope: !113, file: !3, line: 381, type: !39)
!118 = !DILocalVariable(name: "bk", scope: !113, file: !3, line: 383, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "block8", file: !3, line: 35, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !3, line: 32, size: 64, elements: !121)
!121 = !{!122, !126}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ul", scope: !120, file: !3, line: 33, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 2)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "uc", scope: !120, file: !3, line: 34, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 8)
!130 = !DILocation(line: 380, column: 17, scope: !113, inlinedAt: !131)
!131 = distinct !DILocation(line: 610, column: 2, scope: !107)
!132 = !DILocation(line: 381, column: 13, scope: !113, inlinedAt: !131)
