; ModuleID = 'change.c'
source_filename = "change.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!168 = !DIFile(filename: "./structs.h", directory: "/home/sahil/vim/src")
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!170 = !DIEnumerator(name: "VAR_UNKNOWN", value: 0)
!171 = !DIEnumerator(name: "VAR_ANY", value: 1)
!172 = !DIEnumerator(name: "VAR_VOID", value: 2)
!173 = !DIEnumerator(name: "VAR_BOOL", value: 3)
!174 = !DIEnumerator(name: "VAR_SPECIAL", value: 4)
!175 = !DIEnumerator(name: "VAR_NUMBER", value: 5)
!176 = !DIEnumerator(name: "VAR_FLOAT", value: 6)
!177 = !DIEnumerator(name: "VAR_STRING", value: 7)
!178 = !DIEnumerator(name: "VAR_BLOB", value: 8)
!179 = !DIEnumerator(name: "VAR_FUNC", value: 9)
!180 = !DIEnumerator(name: "VAR_PARTIAL", value: 10)
!181 = !DIEnumerator(name: "VAR_LIST", value: 11)
!182 = !DIEnumerator(name: "VAR_DICT", value: 12)
!183 = !DIEnumerator(name: "VAR_JOB", value: 13)
!184 = !DIEnumerator(name: "VAR_CHANNEL", value: 14)
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 1585, size: 32, elements: !186)
!186 = !{!187, !188, !189, !190, !191}
!187 = !DIEnumerator(name: "UF_NOT_COMPILED", value: 0)
!188 = !DIEnumerator(name: "UF_TO_BE_COMPILED", value: 1)
!189 = !DIEnumerator(name: "UF_COMPILING", value: 2)
!190 = !DIEnumerator(name: "UF_COMPILED", value: 3)
!191 = !DIEnumerator(name: "UF_COMPILE_ERROR", value: 4)
!192 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 2061, size: 32, elements: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DIEnumerator(name: "JOB_FAILED", value: 0)
!195 = !DIEnumerator(name: "JOB_STARTED", value: 1)
!196 = !DIEnumerator(name: "JOB_ENDED", value: 2)
!197 = !DIEnumerator(name: "JOB_FINISHED", value: 3)
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 2517, size: 32, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205}
!200 = !DIEnumerator(name: "POPPOS_BOTLEFT", value: 0)
!201 = !DIEnumerator(name: "POPPOS_TOPLEFT", value: 1)
!202 = !DIEnumerator(name: "POPPOS_BOTRIGHT", value: 2)
!203 = !DIEnumerator(name: "POPPOS_TOPRIGHT", value: 3)
!204 = !DIEnumerator(name: "POPPOS_CENTER", value: 4)
!205 = !DIEnumerator(name: "POPPOS_NONE", value: 5)
!206 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 2526, size: 32, elements: !207)
!207 = !{!208, !209, !210}
!208 = !DIEnumerator(name: "POPCLOSE_NONE", value: 0)
!209 = !DIEnumerator(name: "POPCLOSE_BUTTON", value: 1)
!210 = !DIEnumerator(name: "POPCLOSE_CLICK", value: 2)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !212, line: 55, size: 32, elements: !213)
!212 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkvisual.h", directory: "/home/sahil/vim/src")
!213 = !{!214, !215, !216, !217, !218, !219}
!214 = !DIEnumerator(name: "GDK_VISUAL_STATIC_GRAY", value: 0)
!215 = !DIEnumerator(name: "GDK_VISUAL_GRAYSCALE", value: 1)
!216 = !DIEnumerator(name: "GDK_VISUAL_STATIC_COLOR", value: 2)
!217 = !DIEnumerator(name: "GDK_VISUAL_PSEUDO_COLOR", value: 3)
!218 = !DIEnumerator(name: "GDK_VISUAL_TRUE_COLOR", value: 4)
!219 = !DIEnumerator(name: "GDK_VISUAL_DIRECT_COLOR", value: 5)
!220 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !221, line: 118, size: 32, elements: !222)
!221 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdktypes.h", directory: "/home/sahil/vim/src")
!222 = !{!223, !224}
!223 = !DIEnumerator(name: "GDK_LSB_FIRST", value: 0)
!224 = !DIEnumerator(name: "GDK_MSB_FIRST", value: 1)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !226, line: 43, size: 32, elements: !227)
!226 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkfont.h", directory: "/home/sahil/vim/src")
!227 = !{!228, !229}
!228 = !DIEnumerator(name: "GDK_FONT_FONT", value: 0)
!229 = !DIEnumerator(name: "GDK_FONT_FONTSET", value: 1)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !231, line: 52, size: 32, elements: !232)
!231 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkrc.h", directory: "/home/sahil/vim/src")
!232 = !{!233, !234, !235, !236}
!233 = !DIEnumerator(name: "GTK_RC_FG", value: 1)
!234 = !DIEnumerator(name: "GTK_RC_BG", value: 2)
!235 = !DIEnumerator(name: "GTK_RC_TEXT", value: 4)
!236 = !DIEnumerator(name: "GTK_RC_BASE", value: 8)
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 2140, size: 32, elements: !238)
!238 = !{!239, !240, !241, !242}
!239 = !DIEnumerator(name: "MODE_NL", value: 0)
!240 = !DIEnumerator(name: "MODE_RAW", value: 1)
!241 = !DIEnumerator(name: "MODE_JSON", value: 2)
!242 = !DIEnumerator(name: "MODE_JS", value: 3)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 2148, size: 32, elements: !244)
!244 = !{!245, !246, !247, !248, !249}
!245 = !DIEnumerator(name: "JIO_PIPE", value: 0)
!246 = !DIEnumerator(name: "JIO_NULL", value: 1)
!247 = !DIEnumerator(name: "JIO_FILE", value: 2)
!248 = !DIEnumerator(name: "JIO_BUFFER", value: 3)
!249 = !DIEnumerator(name: "JIO_OUT", value: 4)
!250 = !{!251, !252, !254, !257, !258, !356, !334, !1810, !577, !534, !386}
!251 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !6, line: 324, baseType: !256)
!256 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "listener_T", file: !168, line: 2411, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listener_S", file: !168, line: 2412, size: 320, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "lr_next", scope: !260, file: !168, line: 2414, baseType: !258, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "lr_id", scope: !260, file: !168, line: 2415, baseType: !251, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "lr_callback", scope: !260, file: !168, line: 2416, baseType: !265, size: 192, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !168, line: 1360, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 1356, size: 192, elements: !267)
!267 = !{!268, !269, !1927}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !266, file: !168, line: 1357, baseType: !254, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !266, file: !168, line: 1358, baseType: !270, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !168, line: 1348, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !168, line: 1994, size: 832, elements: !273)
!273 = !{!274, !275, !276, !1902, !1903, !1913, !1923, !1924, !1925, !1926}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !272, file: !168, line: 1996, baseType: !251, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !272, file: !168, line: 1997, baseType: !254, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !272, file: !168, line: 1999, baseType: !277, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !168, line: 1658, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 1597, size: 3072, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !287, !288, !297, !298, !313, !314, !315, !316, !317, !318, !319, !320, !322, !323, !324, !325, !326, !337, !338, !339, !340, !342, !343, !344, !345, !346, !347, !348, !358, !359, !360, !1899, !1900}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !279, file: !168, line: 1599, baseType: !251, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !279, file: !168, line: 1600, baseType: !251, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !279, file: !168, line: 1601, baseType: !251, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !279, file: !168, line: 1602, baseType: !251, size: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !279, file: !168, line: 1603, baseType: !286, size: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !168, line: 1591, baseType: !185)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !279, file: !168, line: 1604, baseType: !251, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !279, file: !168, line: 1605, baseType: !289, size: 192, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !168, line: 55, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !168, line: 48, size: 192, elements: !291)
!291 = !{!292, !293, !294, !295, !296}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !290, file: !168, line: 50, baseType: !251, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !290, file: !168, line: 51, baseType: !251, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !290, file: !168, line: 52, baseType: !251, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !290, file: !168, line: 53, baseType: !251, size: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !290, file: !168, line: 54, baseType: !257, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !279, file: !168, line: 1606, baseType: !289, size: 192, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !279, file: !168, line: 1609, baseType: !299, size: 64, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !168, line: 1394, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !168, line: 1395, size: 192, elements: !303)
!303 = !{!304, !306, !309, !310, !311, !312}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !302, file: !168, line: 1396, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !168, line: 1391, baseType: !167)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !302, file: !168, line: 1397, baseType: !307, size: 8, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !168, line: 1342, baseType: !308)
!308 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !302, file: !168, line: 1398, baseType: !253, size: 8, offset: 40)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !302, file: !168, line: 1399, baseType: !253, size: 8, offset: 48)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !302, file: !168, line: 1400, baseType: !300, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !302, file: !168, line: 1401, baseType: !299, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !279, file: !168, line: 1610, baseType: !300, size: 64, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !279, file: !168, line: 1611, baseType: !289, size: 192, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !279, file: !168, line: 1612, baseType: !270, size: 64, offset: 896)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !279, file: !168, line: 1615, baseType: !254, size: 64, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !279, file: !168, line: 1616, baseType: !300, size: 64, offset: 1024)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !279, file: !168, line: 1617, baseType: !300, size: 64, offset: 1088)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !279, file: !168, line: 1618, baseType: !251, size: 32, offset: 1152)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !279, file: !168, line: 1619, baseType: !321, size: 64, offset: 1216)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !279, file: !168, line: 1626, baseType: !289, size: 192, offset: 1280)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !279, file: !168, line: 1628, baseType: !251, size: 32, offset: 1472)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !279, file: !168, line: 1629, baseType: !251, size: 32, offset: 1504)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !279, file: !168, line: 1631, baseType: !251, size: 32, offset: 1536)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !279, file: !168, line: 1632, baseType: !327, size: 128, offset: 1600)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !6, line: 1786, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !329, line: 8, size: 128, elements: !330)
!329 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!330 = !{!331, !335}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !328, file: !329, line: 10, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !333, line: 160, baseType: !334)
!333 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!334 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !328, file: !329, line: 11, baseType: !336, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !333, line: 162, baseType: !334)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !279, file: !168, line: 1633, baseType: !327, size: 128, offset: 1728)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !279, file: !168, line: 1634, baseType: !327, size: 128, offset: 1856)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !279, file: !168, line: 1636, baseType: !321, size: 64, offset: 1984)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !279, file: !168, line: 1637, baseType: !341, size: 64, offset: 2048)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !279, file: !168, line: 1638, baseType: !341, size: 64, offset: 2112)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !279, file: !168, line: 1639, baseType: !327, size: 128, offset: 2176)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !279, file: !168, line: 1640, baseType: !327, size: 128, offset: 2304)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !279, file: !168, line: 1641, baseType: !327, size: 128, offset: 2432)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !279, file: !168, line: 1642, baseType: !251, size: 32, offset: 2560)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !279, file: !168, line: 1643, baseType: !251, size: 32, offset: 2592)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !279, file: !168, line: 1645, baseType: !349, size: 192, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !168, line: 92, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 85, size: 192, elements: !351)
!351 = !{!352, !354, !355, !357}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !350, file: !168, line: 87, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !168, line: 62, baseType: !251)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !350, file: !168, line: 88, baseType: !251, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !350, file: !168, line: 89, baseType: !356, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !6, line: 1687, baseType: !334)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !350, file: !168, line: 91, baseType: !251, size: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !279, file: !168, line: 1648, baseType: !251, size: 32, offset: 2816)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !279, file: !168, line: 1649, baseType: !251, size: 32, offset: 2848)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !279, file: !168, line: 1651, baseType: !361, size: 64, offset: 2880)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !168, line: 1582, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !168, line: 1682, size: 17280, elements: !364)
!364 = !{!365, !366, !367, !368, !1883, !1884, !1885, !1886, !1887, !1888, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !363, file: !168, line: 1684, baseType: !277, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !363, file: !168, line: 1685, baseType: !251, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !363, file: !168, line: 1686, baseType: !251, size: 32, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !363, file: !168, line: 1691, baseType: !369, size: 4608, offset: 128)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 4608, elements: !1881)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !363, file: !168, line: 1687, size: 384, elements: !371)
!371 = !{!372, !1879}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !370, file: !168, line: 1689, baseType: !373, size: 192)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !168, line: 1519, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !168, line: 1513, size: 192, elements: !375)
!375 = !{!376, !1877, !1878}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !374, file: !168, line: 1515, baseType: !377, size: 128)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !168, line: 1432, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 1412, size: 128, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !378, file: !168, line: 1414, baseType: !305, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !378, file: !168, line: 1415, baseType: !253, size: 8, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !378, file: !168, line: 1431, baseType: !383, size: 64, offset: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !378, file: !168, line: 1416, size: 64, elements: !384)
!384 = !{!385, !388, !391, !392, !436, !472, !473, !1868, !1869}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !383, file: !168, line: 1418, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !168, line: 1327, baseType: !387)
!387 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !383, file: !168, line: 1420, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !168, line: 1344, baseType: !390)
!390 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !383, file: !168, line: 1422, baseType: !254, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !383, file: !168, line: 1423, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !168, line: 1346, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !168, line: 1471, size: 768, elements: !396)
!396 = !{!397, !405, !412, !427, !428, !429, !430, !431, !432, !433, !434, !435}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !395, file: !168, line: 1473, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !168, line: 1446, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !168, line: 1448, size: 256, elements: !401)
!401 = !{!402, !403, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !400, file: !168, line: 1450, baseType: !398, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !400, file: !168, line: 1451, baseType: !398, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !400, file: !168, line: 1452, baseType: !377, size: 128, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !395, file: !168, line: 1474, baseType: !406, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !168, line: 1456, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !168, line: 1458, size: 128, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !408, file: !168, line: 1460, baseType: !398, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !408, file: !168, line: 1461, baseType: !406, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !395, file: !168, line: 1487, baseType: !413, size: 192, offset: 128)
!413 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !168, line: 1475, size: 192, elements: !414)
!414 = !{!415, !421}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !413, file: !168, line: 1481, baseType: !416, size: 192)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !413, file: !168, line: 1476, size: 192, elements: !417)
!417 = !{!418, !419, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !416, file: !168, line: 1478, baseType: !386, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !416, file: !168, line: 1479, baseType: !386, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !416, file: !168, line: 1480, baseType: !251, size: 32, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !413, file: !168, line: 1486, baseType: !422, size: 192)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !413, file: !168, line: 1482, size: 192, elements: !423)
!423 = !{!424, !425, !426}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !422, file: !168, line: 1483, baseType: !398, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !422, file: !168, line: 1484, baseType: !398, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !422, file: !168, line: 1485, baseType: !251, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !395, file: !168, line: 1488, baseType: !300, size: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !395, file: !168, line: 1489, baseType: !393, size: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !395, file: !168, line: 1490, baseType: !393, size: 64, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !395, file: !168, line: 1491, baseType: !393, size: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !395, file: !168, line: 1492, baseType: !251, size: 32, offset: 576)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !395, file: !168, line: 1493, baseType: !251, size: 32, offset: 608)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !395, file: !168, line: 1494, baseType: !251, size: 32, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !395, file: !168, line: 1496, baseType: !251, size: 32, offset: 672)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !395, file: !168, line: 1497, baseType: !253, size: 8, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !383, file: !168, line: 1424, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !168, line: 1347, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !168, line: 1545, size: 2816, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !468, !469, !470, !471}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !439, file: !168, line: 1547, baseType: !253, size: 8)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !439, file: !168, line: 1548, baseType: !253, size: 8, offset: 8)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !439, file: !168, line: 1549, baseType: !251, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !439, file: !168, line: 1550, baseType: !251, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !439, file: !168, line: 1551, baseType: !446, size: 2432, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !168, line: 1290, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !168, line: 1277, size: 2432, elements: !448)
!448 = !{!449, !452, !453, !454, !455, !456, !457, !464}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !447, file: !168, line: 1279, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !6, line: 345, baseType: !451)
!451 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !447, file: !168, line: 1281, baseType: !450, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !447, file: !168, line: 1282, baseType: !450, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !447, file: !168, line: 1283, baseType: !251, size: 32, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !447, file: !168, line: 1284, baseType: !251, size: 32, offset: 224)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !447, file: !168, line: 1285, baseType: !251, size: 32, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !447, file: !168, line: 1287, baseType: !458, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !168, line: 1265, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !168, line: 1261, size: 128, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !460, file: !168, line: 1263, baseType: !450, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !460, file: !168, line: 1264, baseType: !254, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !447, file: !168, line: 1289, baseType: !465, size: 2048, offset: 384)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 2048, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !439, file: !168, line: 1552, baseType: !300, size: 64, offset: 2560)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !439, file: !168, line: 1553, baseType: !437, size: 64, offset: 2624)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !439, file: !168, line: 1554, baseType: !437, size: 64, offset: 2688)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !439, file: !168, line: 1555, baseType: !437, size: 64, offset: 2752)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !383, file: !168, line: 1425, baseType: !270, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !383, file: !168, line: 1427, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !168, line: 1365, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !168, line: 2072, size: 1024, elements: !477)
!477 = !{!478, !479, !480, !484, !485, !486, !488, !489, !490, !491, !492, !1765, !1766, !1767, !1866}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !476, file: !168, line: 2074, baseType: !474, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !476, file: !168, line: 2075, baseType: !474, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !476, file: !168, line: 2077, baseType: !481, size: 32, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !482, line: 97, baseType: !483)
!482 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !333, line: 154, baseType: !251)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !476, file: !168, line: 2083, baseType: !254, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !476, file: !168, line: 2084, baseType: !254, size: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !476, file: !168, line: 2085, baseType: !487, size: 32, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !168, line: 2067, baseType: !192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !476, file: !168, line: 2086, baseType: !254, size: 64, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !476, file: !168, line: 2088, baseType: !254, size: 64, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !476, file: !168, line: 2093, baseType: !251, size: 32, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !476, file: !168, line: 2094, baseType: !265, size: 192, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !476, file: !168, line: 2096, baseType: !493, size: 64, offset: 768)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !168, line: 63, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !168, line: 2629, size: 73152, elements: !496)
!496 = !{!497, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !606, !609, !610, !614, !615, !625, !626, !627, !628, !629, !630, !631, !632, !1442, !1443, !1444, !1449, !1450, !1451, !1455, !1463, !1464, !1465, !1466, !1467, !1469, !1470, !1471, !1472, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1748, !1749, !1750, !1751, !1752, !1759, !1760, !1764}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !495, file: !168, line: 2631, baseType: !498, size: 832)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !168, line: 766, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !168, line: 737, size: 832, elements: !500)
!500 = !{!501, !502, !564, !573, !574, !575, !576, !578, !579, !580, !581, !582, !583, !584, !591, !592}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !499, file: !168, line: 739, baseType: !356, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !499, file: !168, line: 741, baseType: !503, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !168, line: 459, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !168, line: 671, size: 9856, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !531, !532, !533, !535, !536, !549, !550, !551, !552, !553, !554, !555, !556, !557, !561, !562, !563}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !505, file: !168, line: 673, baseType: !254, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !505, file: !168, line: 674, baseType: !254, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !505, file: !168, line: 675, baseType: !251, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !505, file: !168, line: 676, baseType: !251, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !505, file: !168, line: 677, baseType: !251, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !505, file: !168, line: 678, baseType: !513, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !168, line: 458, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !168, line: 506, size: 448, elements: !516)
!516 = !{!517, !526, !527, !528, !529, !530}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !515, file: !168, line: 508, baseType: !518, size: 192)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !168, line: 469, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !168, line: 471, size: 192, elements: !520)
!520 = !{!521, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !519, file: !168, line: 473, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !519, file: !168, line: 474, baseType: !522, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !519, file: !168, line: 475, baseType: !525, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !168, line: 460, baseType: !334)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !515, file: !168, line: 511, baseType: !513, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !515, file: !168, line: 512, baseType: !513, size: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !515, file: !168, line: 513, baseType: !254, size: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !515, file: !168, line: 514, baseType: !251, size: 32, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !515, file: !168, line: 518, baseType: !253, size: 8, offset: 416)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !505, file: !168, line: 679, baseType: !513, size: 64, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !505, file: !168, line: 680, baseType: !513, size: 64, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !505, file: !168, line: 681, baseType: !534, size: 32, offset: 448)
!534 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !505, file: !168, line: 682, baseType: !534, size: 32, offset: 480)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !505, file: !168, line: 683, baseType: !537, size: 4352, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !168, line: 489, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !168, line: 480, size: 4352, elements: !539)
!539 = !{!540, !541, !542, !544, !548}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !538, file: !168, line: 482, baseType: !450, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !538, file: !168, line: 484, baseType: !450, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !538, file: !168, line: 485, baseType: !543, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !538, file: !168, line: 487, baseType: !545, size: 4096, offset: 192)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 4096, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !538, file: !168, line: 488, baseType: !253, size: 8, offset: 4288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !505, file: !168, line: 684, baseType: !537, size: 4352, offset: 4864)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !505, file: !168, line: 685, baseType: !525, size: 64, offset: 9216)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !505, file: !168, line: 686, baseType: !525, size: 64, offset: 9280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !505, file: !168, line: 687, baseType: !525, size: 64, offset: 9344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !505, file: !168, line: 688, baseType: !525, size: 64, offset: 9408)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !505, file: !168, line: 689, baseType: !534, size: 32, offset: 9472)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !505, file: !168, line: 690, baseType: !251, size: 32, offset: 9504)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !505, file: !168, line: 692, baseType: !493, size: 64, offset: 9536)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !505, file: !168, line: 693, baseType: !558, size: 64, offset: 9600)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 64, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 8)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !505, file: !168, line: 697, baseType: !254, size: 64, offset: 9664)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !505, file: !168, line: 698, baseType: !251, size: 32, offset: 9728)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !505, file: !168, line: 699, baseType: !558, size: 64, offset: 9760)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !499, file: !168, line: 743, baseType: !565, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !168, line: 717, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !168, line: 711, size: 256, elements: !568)
!568 = !{!569, !570, !571, !572}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !567, file: !168, line: 713, baseType: !525, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !567, file: !168, line: 714, baseType: !356, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !567, file: !168, line: 715, baseType: !356, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !567, file: !168, line: 716, baseType: !251, size: 32, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !499, file: !168, line: 744, baseType: !251, size: 32, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !499, file: !168, line: 745, baseType: !251, size: 32, offset: 224)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !499, file: !168, line: 751, baseType: !251, size: 32, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !499, file: !168, line: 753, baseType: !577, size: 32, offset: 288)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !6, line: 1688, baseType: !251)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !499, file: !168, line: 754, baseType: !356, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !499, file: !168, line: 755, baseType: !254, size: 64, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !499, file: !168, line: 757, baseType: !513, size: 64, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !499, file: !168, line: 758, baseType: !356, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !499, file: !168, line: 759, baseType: !356, size: 64, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !499, file: !168, line: 760, baseType: !251, size: 32, offset: 640)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !499, file: !168, line: 762, baseType: !585, size: 64, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !168, line: 724, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !168, line: 720, size: 128, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !587, file: !168, line: 722, baseType: !251, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !587, file: !168, line: 723, baseType: !334, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !499, file: !168, line: 763, baseType: !251, size: 32, offset: 768)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !499, file: !168, line: 764, baseType: !251, size: 32, offset: 800)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !495, file: !168, line: 2634, baseType: !493, size: 64, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !495, file: !168, line: 2635, baseType: !493, size: 64, offset: 896)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !495, file: !168, line: 2637, baseType: !251, size: 32, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !495, file: !168, line: 2639, baseType: !251, size: 32, offset: 992)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !495, file: !168, line: 2640, baseType: !251, size: 32, offset: 1024)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !495, file: !168, line: 2642, baseType: !251, size: 32, offset: 1056)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !495, file: !168, line: 2651, baseType: !254, size: 64, offset: 1088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !495, file: !168, line: 2652, baseType: !254, size: 64, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !495, file: !168, line: 2654, baseType: !254, size: 64, offset: 1216)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !495, file: !168, line: 2658, baseType: !251, size: 32, offset: 1280)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !495, file: !168, line: 2659, baseType: !604, size: 64, offset: 1344)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !482, line: 59, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !333, line: 145, baseType: !451)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !495, file: !168, line: 2660, baseType: !607, size: 64, offset: 1408)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !482, line: 47, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !333, line: 148, baseType: !451)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !495, file: !168, line: 2667, baseType: !251, size: 32, offset: 1472)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !495, file: !168, line: 2668, baseType: !611, size: 72, offset: 1504)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 72, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 9)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !495, file: !168, line: 2672, baseType: !251, size: 32, offset: 1600)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !495, file: !168, line: 2674, baseType: !616, size: 320, offset: 1664)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !168, line: 1532, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !168, line: 1526, size: 320, elements: !618)
!618 = !{!619, !620, !621}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !617, file: !168, line: 1528, baseType: !377, size: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !617, file: !168, line: 1529, baseType: !255, size: 8, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !617, file: !168, line: 1530, baseType: !622, size: 136, offset: 136)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 136, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 17)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !495, file: !168, line: 2679, baseType: !386, size: 64, offset: 1984)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !495, file: !168, line: 2681, baseType: !386, size: 64, offset: 2048)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !495, file: !168, line: 2684, baseType: !251, size: 32, offset: 2112)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !495, file: !168, line: 2691, baseType: !251, size: 32, offset: 2144)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !495, file: !168, line: 2693, baseType: !356, size: 64, offset: 2176)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !495, file: !168, line: 2694, baseType: !356, size: 64, offset: 2240)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !495, file: !168, line: 2696, baseType: !334, size: 64, offset: 2304)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !495, file: !168, line: 2699, baseType: !633, size: 64, offset: 2368)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !168, line: 60, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !168, line: 325, size: 11648, elements: !636)
!636 = !{!637, !638, !639, !1437, !1438, !1439, !1440, !1441}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !635, file: !168, line: 327, baseType: !633, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !635, file: !168, line: 328, baseType: !633, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !635, file: !168, line: 329, baseType: !640, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !168, line: 59, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !168, line: 3365, size: 72064, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !803, !804, !819, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !876, !877, !878, !879, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !902, !903, !905, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !926, !927, !928, !929, !930, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !990, !991, !992, !993, !994, !1247, !1255, !1256, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1348, !1349, !1350, !1351, !1392, !1393, !1405, !1406, !1407, !1408, !1409, !1429, !1430, !1431, !1432, !1436}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !642, file: !168, line: 3367, baseType: !251, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !642, file: !168, line: 3369, baseType: !493, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !642, file: !168, line: 3371, baseType: !640, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !642, file: !168, line: 3372, baseType: !640, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !642, file: !168, line: 3375, baseType: !649, size: 64, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !168, line: 2618, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 2542, size: 9920, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !668, !669, !670, !671, !672, !730, !738, !739, !740, !741, !742, !779, !780, !781, !782, !783, !784, !786, !787, !791, !792, !793, !794, !795, !796, !797, !798, !802}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !651, file: !168, line: 2544, baseType: !446, size: 2432)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !651, file: !168, line: 2545, baseType: !446, size: 2432, offset: 2432)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !651, file: !168, line: 2546, baseType: !251, size: 32, offset: 4864)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !651, file: !168, line: 2548, baseType: !251, size: 32, offset: 4896)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !651, file: !168, line: 2550, baseType: !251, size: 32, offset: 4928)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !651, file: !168, line: 2551, baseType: !251, size: 32, offset: 4960)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !651, file: !168, line: 2552, baseType: !251, size: 32, offset: 4992)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !651, file: !168, line: 2553, baseType: !289, size: 192, offset: 5056)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !651, file: !168, line: 2554, baseType: !289, size: 192, offset: 5248)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !651, file: !168, line: 2555, baseType: !251, size: 32, offset: 5440)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !651, file: !168, line: 2556, baseType: !251, size: 32, offset: 5472)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !651, file: !168, line: 2557, baseType: !251, size: 32, offset: 5504)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !651, file: !168, line: 2559, baseType: !251, size: 32, offset: 5536)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !651, file: !168, line: 2560, baseType: !667, size: 16, offset: 5568)
!667 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !651, file: !168, line: 2561, baseType: !334, size: 64, offset: 5632)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !651, file: !168, line: 2562, baseType: !334, size: 64, offset: 5696)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !651, file: !168, line: 2563, baseType: !334, size: 64, offset: 5760)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !651, file: !168, line: 2564, baseType: !254, size: 64, offset: 5824)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !651, file: !168, line: 2565, baseType: !673, size: 64, offset: 5888)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !675, line: 56, baseType: !676)
!675 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !675, line: 49, size: 192, elements: !677)
!677 = !{!678, !726, !727, !728, !729}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !676, file: !675, line: 51, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !675, line: 42, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !675, line: 167, size: 320, elements: !682)
!682 = !{!683, !687, !691, !706, !725}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !681, file: !675, line: 169, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!673, !254, !251}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !681, file: !675, line: 170, baseType: !688, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !673}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !681, file: !675, line: 171, baseType: !692, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!251, !695, !254, !577, !251}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !675, line: 137, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !675, line: 131, size: 1408, elements: !698)
!698 = !{!699, !700, !704, !705}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !697, file: !675, line: 133, baseType: !673, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !697, file: !675, line: 134, baseType: !701, size: 640, offset: 64)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 640, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 10)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !697, file: !675, line: 135, baseType: !701, size: 640, offset: 704)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !697, file: !675, line: 136, baseType: !251, size: 32, offset: 1344)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !681, file: !675, line: 172, baseType: !707, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!334, !710, !640, !493, !356, !577, !341, !321}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !675, line: 154, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !675, line: 147, size: 2688, elements: !713)
!713 = !{!714, !715, !722, !723, !724}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !712, file: !675, line: 149, baseType: !673, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !712, file: !675, line: 150, baseType: !716, size: 1280, offset: 64)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 1280, elements: !702)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !168, line: 41, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 37, size: 128, elements: !719)
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !718, file: !168, line: 39, baseType: !356, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !718, file: !168, line: 40, baseType: !577, size: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !712, file: !675, line: 151, baseType: !716, size: 1280, offset: 1344)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !712, file: !675, line: 152, baseType: !251, size: 32, offset: 2624)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !712, file: !675, line: 153, baseType: !577, size: 32, offset: 2656)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !681, file: !675, line: 173, baseType: !254, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !676, file: !675, line: 52, baseType: !534, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !676, file: !675, line: 53, baseType: !534, size: 32, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !676, file: !675, line: 54, baseType: !534, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !676, file: !675, line: 55, baseType: !251, size: 32, offset: 160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !651, file: !168, line: 2567, baseType: !731, size: 384, offset: 5952)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !168, line: 2475, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 2470, size: 384, elements: !733)
!733 = !{!734, !735, !736, !737}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !732, file: !168, line: 2471, baseType: !327, size: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !732, file: !168, line: 2472, baseType: !327, size: 128, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !732, file: !168, line: 2473, baseType: !334, size: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !732, file: !168, line: 2474, baseType: !334, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !651, file: !168, line: 2569, baseType: !251, size: 32, offset: 6336)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !651, file: !168, line: 2570, baseType: !251, size: 32, offset: 6368)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !651, file: !168, line: 2572, baseType: !251, size: 32, offset: 6400)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !651, file: !168, line: 2575, baseType: !251, size: 32, offset: 6432)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !651, file: !168, line: 2592, baseType: !743, size: 64, offset: 6464)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !168, line: 1061, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !168, line: 1063, size: 1728, elements: !746)
!746 = !{!747, !748, !749, !771, !772, !773, !775, !778}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !745, file: !168, line: 1065, baseType: !743, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !745, file: !168, line: 1066, baseType: !356, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !745, file: !168, line: 1071, baseType: !750, size: 1344, offset: 128)
!750 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !745, file: !168, line: 1067, size: 1344, elements: !751)
!751 = !{!752, !770}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !750, file: !168, line: 1069, baseType: !753, size: 1344)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 1344, elements: !768)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !168, line: 1055, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !168, line: 1046, size: 192, elements: !756)
!756 = !{!757, !758, !759, !760, !761}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !755, file: !168, line: 1048, baseType: !251, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !755, file: !168, line: 1049, baseType: !251, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !755, file: !168, line: 1051, baseType: !251, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !755, file: !168, line: 1052, baseType: !251, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !755, file: !168, line: 1054, baseType: !762, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !675, line: 165, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !675, line: 161, size: 704, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !764, file: !675, line: 163, baseType: !667, size: 16)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !764, file: !675, line: 164, baseType: !701, size: 640, offset: 64)
!768 = !{!769}
!769 = !DISubrange(count: 7)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !750, file: !168, line: 1070, baseType: !289, size: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !745, file: !168, line: 1072, baseType: !251, size: 32, offset: 1472)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !745, file: !168, line: 1073, baseType: !251, size: 32, offset: 1504)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !745, file: !168, line: 1074, baseType: !774, size: 64, offset: 1536)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !745, file: !168, line: 1076, baseType: !776, size: 16, offset: 1600)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !6, line: 1689, baseType: !777)
!777 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !745, file: !168, line: 1077, baseType: !356, size: 64, offset: 1664)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !651, file: !168, line: 2593, baseType: !251, size: 32, offset: 6528)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !651, file: !168, line: 2594, baseType: !743, size: 64, offset: 6592)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !651, file: !168, line: 2595, baseType: !743, size: 64, offset: 6656)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !651, file: !168, line: 2596, baseType: !251, size: 32, offset: 6720)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !651, file: !168, line: 2597, baseType: !356, size: 64, offset: 6784)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !651, file: !168, line: 2598, baseType: !785, size: 16, offset: 6848)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !6, line: 325, baseType: !777)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !651, file: !168, line: 2603, baseType: !289, size: 192, offset: 6912)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !651, file: !168, line: 2604, baseType: !788, size: 2048, offset: 7104)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 2048, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !651, file: !168, line: 2605, baseType: !254, size: 64, offset: 9152)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !651, file: !168, line: 2606, baseType: !254, size: 64, offset: 9216)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !651, file: !168, line: 2607, baseType: !673, size: 64, offset: 9280)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !651, file: !168, line: 2608, baseType: !254, size: 64, offset: 9344)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !651, file: !168, line: 2609, baseType: !254, size: 64, offset: 9408)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !651, file: !168, line: 2610, baseType: !254, size: 64, offset: 9472)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !651, file: !168, line: 2611, baseType: !251, size: 32, offset: 9536)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !651, file: !168, line: 2616, baseType: !799, size: 256, offset: 9568)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 256, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !651, file: !168, line: 2617, baseType: !254, size: 64, offset: 9856)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !642, file: !168, line: 3378, baseType: !251, size: 32, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !642, file: !168, line: 3381, baseType: !805, size: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !168, line: 61, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !168, line: 3231, size: 512, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !807, file: !168, line: 3233, baseType: !253, size: 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !807, file: !168, line: 3234, baseType: !251, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !807, file: !168, line: 3235, baseType: !251, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !807, file: !168, line: 3236, baseType: !251, size: 32, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !807, file: !168, line: 3237, baseType: !251, size: 32, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !807, file: !168, line: 3238, baseType: !805, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !807, file: !168, line: 3239, baseType: !805, size: 64, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !807, file: !168, line: 3241, baseType: !805, size: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !807, file: !168, line: 3244, baseType: !805, size: 64, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !807, file: !168, line: 3245, baseType: !640, size: 64, offset: 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !642, file: !168, line: 3383, baseType: !820, size: 128, offset: 448)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !168, line: 31, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 26, size: 128, elements: !822)
!822 = !{!823, !824, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !821, file: !168, line: 28, baseType: !356, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !821, file: !168, line: 29, baseType: !577, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !821, file: !168, line: 30, baseType: !577, size: 32, offset: 96)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !642, file: !168, line: 3385, baseType: !577, size: 32, offset: 576)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !642, file: !168, line: 3389, baseType: !251, size: 32, offset: 608)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !642, file: !168, line: 3394, baseType: !356, size: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !642, file: !168, line: 3400, baseType: !253, size: 8, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !642, file: !168, line: 3401, baseType: !356, size: 64, offset: 768)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !642, file: !168, line: 3402, baseType: !577, size: 32, offset: 832)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !642, file: !168, line: 3403, baseType: !577, size: 32, offset: 864)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !642, file: !168, line: 3404, baseType: !356, size: 64, offset: 896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !642, file: !168, line: 3405, baseType: !577, size: 32, offset: 960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !642, file: !168, line: 3406, baseType: !577, size: 32, offset: 992)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !642, file: !168, line: 3408, baseType: !837, size: 352, offset: 1024)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !168, line: 3358, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 3343, size: 352, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !838, file: !168, line: 3345, baseType: !251, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !838, file: !168, line: 3346, baseType: !251, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !838, file: !168, line: 3347, baseType: !251, size: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !838, file: !168, line: 3348, baseType: !251, size: 32, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !838, file: !168, line: 3349, baseType: !251, size: 32, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !838, file: !168, line: 3350, baseType: !251, size: 32, offset: 160)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !838, file: !168, line: 3351, baseType: !251, size: 32, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !838, file: !168, line: 3352, baseType: !251, size: 32, offset: 224)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !838, file: !168, line: 3353, baseType: !251, size: 32, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !838, file: !168, line: 3354, baseType: !251, size: 32, offset: 288)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !838, file: !168, line: 3356, baseType: !251, size: 32, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !642, file: !168, line: 3414, baseType: !356, size: 64, offset: 1408)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !642, file: !168, line: 3416, baseType: !253, size: 8, offset: 1472)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !642, file: !168, line: 3419, baseType: !356, size: 64, offset: 1536)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !642, file: !168, line: 3423, baseType: !251, size: 32, offset: 1600)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !642, file: !168, line: 3424, baseType: !251, size: 32, offset: 1632)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !642, file: !168, line: 3425, baseType: !251, size: 32, offset: 1664)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !642, file: !168, line: 3427, baseType: !251, size: 32, offset: 1696)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !642, file: !168, line: 3429, baseType: !577, size: 32, offset: 1728)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !642, file: !168, line: 3432, baseType: !577, size: 32, offset: 1760)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !642, file: !168, line: 3435, baseType: !251, size: 32, offset: 1792)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !642, file: !168, line: 3437, baseType: !251, size: 32, offset: 1824)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !642, file: !168, line: 3445, baseType: !251, size: 32, offset: 1856)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !642, file: !168, line: 3446, baseType: !251, size: 32, offset: 1888)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !642, file: !168, line: 3449, baseType: !251, size: 32, offset: 1920)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !642, file: !168, line: 3450, baseType: !251, size: 32, offset: 1952)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !642, file: !168, line: 3451, baseType: !251, size: 32, offset: 1984)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !642, file: !168, line: 3452, baseType: !251, size: 32, offset: 2016)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !642, file: !168, line: 3454, baseType: !869, size: 320, offset: 2048)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !168, line: 3330, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 3324, size: 320, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !870, file: !168, line: 3326, baseType: !251, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !870, file: !168, line: 3327, baseType: !251, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !870, file: !168, line: 3328, baseType: !820, size: 128, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !870, file: !168, line: 3329, baseType: !820, size: 128, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !642, file: !168, line: 3457, baseType: !251, size: 32, offset: 2368)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !642, file: !168, line: 3458, baseType: !251, size: 32, offset: 2400)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !642, file: !168, line: 3459, baseType: !254, size: 64, offset: 2432)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !642, file: !168, line: 3460, baseType: !880, size: 32, offset: 2496)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !168, line: 2524, baseType: !198)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !642, file: !168, line: 3461, baseType: !251, size: 32, offset: 2528)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !642, file: !168, line: 3462, baseType: !251, size: 32, offset: 2560)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !642, file: !168, line: 3463, baseType: !640, size: 64, offset: 2624)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !642, file: !168, line: 3464, baseType: !251, size: 32, offset: 2688)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !642, file: !168, line: 3465, baseType: !251, size: 32, offset: 2720)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !642, file: !168, line: 3466, baseType: !251, size: 32, offset: 2752)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !642, file: !168, line: 3467, baseType: !251, size: 32, offset: 2784)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !642, file: !168, line: 3468, baseType: !251, size: 32, offset: 2816)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !642, file: !168, line: 3469, baseType: !251, size: 32, offset: 2848)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !642, file: !168, line: 3470, baseType: !251, size: 32, offset: 2880)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !642, file: !168, line: 3471, baseType: !251, size: 32, offset: 2912)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !642, file: !168, line: 3472, baseType: !251, size: 32, offset: 2944)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !642, file: !168, line: 3473, baseType: !251, size: 32, offset: 2976)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !642, file: !168, line: 3474, baseType: !251, size: 32, offset: 3008)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !642, file: !168, line: 3475, baseType: !251, size: 32, offset: 3040)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !642, file: !168, line: 3476, baseType: !254, size: 64, offset: 3072)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !642, file: !168, line: 3477, baseType: !254, size: 64, offset: 3136)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !642, file: !168, line: 3478, baseType: !899, size: 128, offset: 3200)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 128, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 4)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !642, file: !168, line: 3479, baseType: !899, size: 128, offset: 3328)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !642, file: !168, line: 3480, baseType: !904, size: 256, offset: 3456)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 256, elements: !900)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !642, file: !168, line: 3481, baseType: !906, size: 256, offset: 3712)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 256, elements: !559)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !642, file: !168, line: 3483, baseType: !251, size: 32, offset: 3968)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !642, file: !168, line: 3484, baseType: !251, size: 32, offset: 4000)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !642, file: !168, line: 3485, baseType: !386, size: 64, offset: 4032)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !642, file: !168, line: 3487, baseType: !386, size: 64, offset: 4096)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !642, file: !168, line: 3490, baseType: !251, size: 32, offset: 4160)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !642, file: !168, line: 3493, baseType: !356, size: 64, offset: 4224)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !642, file: !168, line: 3495, baseType: !265, size: 192, offset: 4288)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !642, file: !168, line: 3496, baseType: !265, size: 192, offset: 4480)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !642, file: !168, line: 3497, baseType: !251, size: 32, offset: 4672)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !642, file: !168, line: 3498, baseType: !251, size: 32, offset: 4704)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !642, file: !168, line: 3500, baseType: !640, size: 64, offset: 4736)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !642, file: !168, line: 3501, baseType: !356, size: 64, offset: 4800)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !642, file: !168, line: 3502, baseType: !577, size: 32, offset: 4864)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !642, file: !168, line: 3503, baseType: !577, size: 32, offset: 4896)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !642, file: !168, line: 3504, baseType: !251, size: 32, offset: 4928)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !642, file: !168, line: 3505, baseType: !251, size: 32, offset: 4960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !642, file: !168, line: 3506, baseType: !251, size: 32, offset: 4992)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !642, file: !168, line: 3507, baseType: !925, size: 32, offset: 5024)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !168, line: 2530, baseType: !206)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !642, file: !168, line: 3509, baseType: !393, size: 64, offset: 5056)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !642, file: !168, line: 3510, baseType: !254, size: 64, offset: 5120)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !642, file: !168, line: 3511, baseType: !251, size: 32, offset: 5184)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !642, file: !168, line: 3512, baseType: !251, size: 32, offset: 5216)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !642, file: !168, line: 3514, baseType: !931, size: 64, offset: 5248)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !168, line: 2478, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !168, line: 2479, size: 704, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !933, file: !168, line: 2481, baseType: !334, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !933, file: !168, line: 2483, baseType: !931, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !933, file: !168, line: 2484, baseType: !931, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !933, file: !168, line: 2485, baseType: !327, size: 128, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !933, file: !168, line: 2486, baseType: !253, size: 8, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !933, file: !168, line: 2487, baseType: !253, size: 8, offset: 328)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !933, file: !168, line: 2488, baseType: !251, size: 32, offset: 352)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !933, file: !168, line: 2489, baseType: !334, size: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !933, file: !168, line: 2490, baseType: !265, size: 192, offset: 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !933, file: !168, line: 2491, baseType: !251, size: 32, offset: 640)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !642, file: !168, line: 3517, baseType: !251, size: 32, offset: 5312)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !642, file: !168, line: 3534, baseType: !251, size: 32, offset: 5344)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !642, file: !168, line: 3535, baseType: !820, size: 128, offset: 5376)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !642, file: !168, line: 3537, baseType: !577, size: 32, offset: 5504)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !642, file: !168, line: 3543, baseType: !251, size: 32, offset: 5536)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !642, file: !168, line: 3545, baseType: !251, size: 32, offset: 5568)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !642, file: !168, line: 3548, baseType: !251, size: 32, offset: 5600)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !642, file: !168, line: 3550, baseType: !577, size: 32, offset: 5632)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !642, file: !168, line: 3562, baseType: !251, size: 32, offset: 5664)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !642, file: !168, line: 3562, baseType: !251, size: 32, offset: 5696)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !642, file: !168, line: 3574, baseType: !251, size: 32, offset: 5728)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !642, file: !168, line: 3575, baseType: !957, size: 64, offset: 5760)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !168, line: 3225, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !168, line: 3216, size: 192, elements: !960)
!960 = !{!961, !962, !963, !964, !965}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !959, file: !168, line: 3218, baseType: !356, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !959, file: !168, line: 3219, baseType: !785, size: 16, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !959, file: !168, line: 3220, baseType: !253, size: 8, offset: 80)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !959, file: !168, line: 3222, baseType: !253, size: 8, offset: 88)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !959, file: !168, line: 3223, baseType: !356, size: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !642, file: !168, line: 3578, baseType: !289, size: 192, offset: 5824)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !642, file: !168, line: 3579, baseType: !253, size: 8, offset: 6016)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !642, file: !168, line: 3581, baseType: !253, size: 8, offset: 6024)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !642, file: !168, line: 3585, baseType: !251, size: 32, offset: 6048)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !642, file: !168, line: 3593, baseType: !251, size: 32, offset: 6080)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !642, file: !168, line: 3594, baseType: !251, size: 32, offset: 6112)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_top", scope: !642, file: !168, line: 3596, baseType: !356, size: 64, offset: 6144)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_bot", scope: !642, file: !168, line: 3597, baseType: !356, size: 64, offset: 6208)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_status", scope: !642, file: !168, line: 3598, baseType: !251, size: 32, offset: 6272)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_cursor", scope: !642, file: !168, line: 3602, baseType: !820, size: 128, offset: 6336)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_virtcol", scope: !642, file: !168, line: 3603, baseType: !577, size: 32, offset: 6464)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topline", scope: !642, file: !168, line: 3604, baseType: !356, size: 64, offset: 6528)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_line_count", scope: !642, file: !168, line: 3605, baseType: !356, size: 64, offset: 6592)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topfill", scope: !642, file: !168, line: 3607, baseType: !251, size: 32, offset: 6656)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_empty", scope: !642, file: !168, line: 3609, baseType: !253, size: 8, offset: 6688)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "w_alt_fnum", scope: !642, file: !168, line: 3612, baseType: !251, size: 32, offset: 6720)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "w_alist", scope: !642, file: !168, line: 3614, baseType: !983, size: 64, offset: 6784)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "alist_T", file: !168, line: 863, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arglist", file: !168, line: 858, size: 256, elements: !986)
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "al_ga", scope: !985, file: !168, line: 860, baseType: !289, size: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "al_refcount", scope: !985, file: !168, line: 861, baseType: !251, size: 32, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !985, file: !168, line: 862, baseType: !251, size: 32, offset: 224)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx", scope: !642, file: !168, line: 3615, baseType: !251, size: 32, offset: 6848)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx_invalid", scope: !642, file: !168, line: 3617, baseType: !251, size: 32, offset: 6880)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "w_localdir", scope: !642, file: !168, line: 3619, baseType: !254, size: 64, offset: 6912)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "w_prevdir", scope: !642, file: !168, line: 3621, baseType: !254, size: 64, offset: 6976)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "w_winbar", scope: !642, file: !168, line: 3623, baseType: !995, size: 64, offset: 7040)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "vimmenu_T", file: !168, line: 67, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VimMenu", file: !168, line: 3889, size: 1984, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1012, !1013, !1014, !1015, !1017, !1018, !1020, !1021, !1022, !1023, !1244, !1245, !1246}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !997, file: !168, line: 3891, baseType: !251, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !997, file: !168, line: 3892, baseType: !251, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !168, line: 3893, baseType: !254, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "dname", scope: !997, file: !168, line: 3894, baseType: !254, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "en_name", scope: !997, file: !168, line: 3896, baseType: !254, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "en_dname", scope: !997, file: !168, line: 3898, baseType: !254, size: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic", scope: !997, file: !168, line: 3901, baseType: !251, size: 32, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "actext", scope: !997, file: !168, line: 3902, baseType: !254, size: 64, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !997, file: !168, line: 3903, baseType: !251, size: 32, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !997, file: !168, line: 3905, baseType: !1009, size: 64, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !995}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "iconfile", scope: !997, file: !168, line: 3908, baseType: !254, size: 64, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "iconidx", scope: !997, file: !168, line: 3909, baseType: !251, size: 32, offset: 640)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "icon_builtin", scope: !997, file: !168, line: 3910, baseType: !251, size: 32, offset: 672)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "strings", scope: !997, file: !168, line: 3912, baseType: !1016, size: 512, offset: 704)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 512, elements: !559)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "noremap", scope: !997, file: !168, line: 3913, baseType: !906, size: 256, offset: 1216)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !997, file: !168, line: 3914, baseType: !1019, size: 64, offset: 1472)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 64, elements: !559)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !997, file: !168, line: 3915, baseType: !995, size: 64, offset: 1536)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !997, file: !168, line: 3916, baseType: !995, size: 64, offset: 1600)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !997, file: !168, line: 3917, baseType: !995, size: 64, offset: 1664)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !997, file: !168, line: 3923, baseType: !1024, size: 64, offset: 1728)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWidget", file: !1026, line: 69, baseType: !1027)
!1026 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkstyle.h", directory: "/home/sahil/vim/src")
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWidget", file: !1028, line: 530, size: 768, elements: !1029)
!1028 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkwidget.h", directory: "/home/sahil/vim/src")
!1029 = !{!1030, !1066, !1068, !1070, !1071, !1074, !1225, !1231, !1240, !1243}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1027, file: !1028, line: 538, baseType: !1031, size: 256)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkObject", file: !1032, line: 49, baseType: !1033)
!1032 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtktypeutils.h", directory: "/home/sahil/vim/src")
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkObject", file: !1034, line: 107, size: 256, elements: !1035)
!1034 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkobject.h", directory: "/home/sahil/vim/src")
!1035 = !{!1036, !1064}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1033, file: !1034, line: 109, baseType: !1037, size: 192)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInitiallyUnowned", file: !1038, line: 189, baseType: !1039)
!1038 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gobject.h", directory: "/home/sahil/vim/src")
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GObject", file: !1038, line: 245, size: 192, elements: !1040)
!1040 = !{!1041, !1055, !1059}
