; ModuleID = 'clipboard.c'
source_filename = "clipboard.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Clipboard_T = type { i32, i32, %struct.pos_T, %struct.pos_T, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, %struct.pos_T, i16, i16, i64, %struct._GdkAtom* }
%struct.pos_T = type { i64, i32, i32 }
%struct._GdkAtom = type opaque

!119 = !DIEnumerator(name: "GDK_VISUAL_STATIC_COLOR", value: 2)
!120 = !DIEnumerator(name: "GDK_VISUAL_PSEUDO_COLOR", value: 3)
!121 = !DIEnumerator(name: "GDK_VISUAL_TRUE_COLOR", value: 4)
!122 = !DIEnumerator(name: "GDK_VISUAL_DIRECT_COLOR", value: 5)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 118, size: 32, elements: !125)
!124 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdktypes.h", directory: "/home/sahil/vim/src")
!125 = !{!126, !127}
!126 = !DIEnumerator(name: "GDK_LSB_FIRST", value: 0)
!127 = !DIEnumerator(name: "GDK_MSB_FIRST", value: 1)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !129, line: 43, size: 32, elements: !130)
!129 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkfont.h", directory: "/home/sahil/vim/src")
!130 = !{!131, !132}
!131 = !DIEnumerator(name: "GDK_FONT_FONT", value: 0)
!132 = !DIEnumerator(name: "GDK_FONT_FONTSET", value: 1)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !134, line: 52, size: 32, elements: !135)
!134 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkrc.h", directory: "/home/sahil/vim/src")
!135 = !{!136, !137, !138, !139}
!136 = !DIEnumerator(name: "GTK_RC_FG", value: 1)
!137 = !DIEnumerator(name: "GTK_RC_BG", value: 2)
!138 = !DIEnumerator(name: "GTK_RC_TEXT", value: 4)
!139 = !DIEnumerator(name: "GTK_RC_BASE", value: 8)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !58, line: 4251, size: 32, elements: !141)
!141 = !{!142, !143, !144}
!142 = !DIEnumerator(name: "IGNORE_POPUP", value: 0)
!143 = !DIEnumerator(name: "FIND_POPUP", value: 1)
!144 = !DIEnumerator(name: "FAIL_POPUP", value: 2)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !146, line: 174, size: 32, elements: !147)
!146 = !DIFile(filename: "/usr/include/X11/Xutil.h", directory: "/home/sahil/vim/src")
!147 = !{!148, !149, !150, !151, !152}
!148 = !DIEnumerator(name: "XStringStyle", value: 0)
!149 = !DIEnumerator(name: "XCompoundTextStyle", value: 1)
!150 = !DIEnumerator(name: "XTextStyle", value: 2)
!151 = !DIEnumerator(name: "XStdICCTextStyle", value: 3)
!152 = !DIEnumerator(name: "XUTF8StringStyle", value: 4)
!153 = !{!154, !155, !156, !158, !160, !163, !164, !166, !168, !171, !172, !173, !174, !176}
!154 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !6, line: 325, baseType: !157)
!157 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !161, line: 62, baseType: !162)
!161 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!162 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!163 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atom", file: !165, line: 74, baseType: !162)
!165 = !DIFile(filename: "/usr/include/X11/X.h", directory: "/home/sahil/vim/src")
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtPointer", file: !167, line: 158, baseType: !155)
!167 = !DIFile(filename: "/usr/include/X11/Intrinsic.h", directory: "/home/sahil/vim/src")
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !6, line: 324, baseType: !170)
!170 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !6, line: 345, baseType: !162)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cardinal", file: !167, line: 154, baseType: !175)
!175 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!177 = !{!178, !698, !700, !702, !704, !706, !708, !710, !0, !712, !714, !716, !753, !755}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "success", scope: !180, file: !3, line: 1704, type: !154, isLocal: true, isDefinition: true)
!180 = distinct !DISubprogram(name: "clip_x11_request_selection", scope: !3, file: !3, line: 1697, type: !181, isLocal: false, isDefinition: true, scopeLine: 1701, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !224)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !183, !186, !190}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "Widget", file: !167, line: 107, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WidgetRec", file: !167, line: 107, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !188, line: 487, baseType: !189)
!188 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "/home/sahil/vim/src")
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !188, line: 255, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clipboard_T", file: !6, line: 2101, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2060, size: 832, elements: !193)
!193 = !{!194, !195, !196, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !192, file: !6, line: 2062, baseType: !154, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "owned", scope: !192, file: !6, line: 2063, baseType: !154, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !192, file: !6, line: 2064, baseType: !197, size: 128, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !58, line: 31, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 26, size: 128, elements: !199)
!199 = !{!200, !202, !204}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !198, file: !58, line: 28, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !6, line: 1687, baseType: !163)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !198, file: !58, line: 29, baseType: !203, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !6, line: 1688, baseType: !154)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !198, file: !58, line: 30, baseType: !203, size: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !192, file: !6, line: 2065, baseType: !197, size: 128, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "vmode", scope: !192, file: !6, line: 2066, baseType: !154, size: 32, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "origin_row", scope: !192, file: !6, line: 2069, baseType: !156, size: 16, offset: 352)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "origin_start_col", scope: !192, file: !6, line: 2070, baseType: !156, size: 16, offset: 368)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "origin_end_col", scope: !192, file: !6, line: 2071, baseType: !156, size: 16, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "word_start_col", scope: !192, file: !6, line: 2072, baseType: !156, size: 16, offset: 400)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "word_end_col", scope: !192, file: !6, line: 2073, baseType: !156, size: 16, offset: 416)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "min_col", scope: !192, file: !6, line: 2076, baseType: !156, size: 16, offset: 432)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "max_col", scope: !192, file: !6, line: 2077, baseType: !156, size: 16, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "min_row", scope: !192, file: !6, line: 2078, baseType: !156, size: 16, offset: 464)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "max_row", scope: !192, file: !6, line: 2079, baseType: !156, size: 16, offset: 480)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !6, line: 2082, baseType: !197, size: 128, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !192, file: !6, line: 2083, baseType: !156, size: 16, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !192, file: !6, line: 2084, baseType: !156, size: 16, offset: 656)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sel_atom", scope: !192, file: !6, line: 2087, baseType: !164, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "gtk_sel_atom", scope: !192, file: !6, line: 2091, baseType: !221, size: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkAtom", file: !124, line: 80, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkAtom", file: !124, line: 80, flags: DIFlagFwdDecl)
!224 = !{!225, !226, !227, !228, !690, !691, !692, !697}
!225 = !DILocalVariable(name: "myShell", arg: 1, scope: !180, file: !3, line: 1698, type: !183)
!226 = !DILocalVariable(name: "dpy", arg: 2, scope: !180, file: !3, line: 1699, type: !186)
!227 = !DILocalVariable(name: "cbd", arg: 3, scope: !180, file: !3, line: 1700, type: !190)
!228 = !DILocalVariable(name: "event", scope: !180, file: !3, line: 1702, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "XEvent", file: !188, line: 1009, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_XEvent", file: !188, line: 973, size: 1536, elements: !231)
!231 = !{!232, !233, !244, !264, !283, !302, !323, !334, !348, !365, !376, !386, !402, !412, !423, !434, !444, !458, !475, !487, !498, !516, !527, !538, !550, !561, !575, !588, !601, !628, !640, !651, !664, !674, !686}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !230, file: !188, line: 974, baseType: !154, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "xany", scope: !230, file: !188, line: 975, baseType: !234, size: 320)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "XAnyEvent", file: !188, line: 940, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 934, size: 320, elements: !236)
!236 = !{!237, !238, !239, !240, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !235, file: !188, line: 935, baseType: !154, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !235, file: !188, line: 936, baseType: !162, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !235, file: !188, line: 937, baseType: !154, size: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !235, file: !188, line: 938, baseType: !186, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !235, file: !188, line: 939, baseType: !242, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !165, line: 96, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !165, line: 66, baseType: !162)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "xkey", scope: !230, file: !188, line: 976, baseType: !245, size: 768)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeyEvent", file: !188, line: 571, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 557, size: 768, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !257, !258, !259, !260, !261, !262, !263}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !246, file: !188, line: 558, baseType: !154, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !246, file: !188, line: 559, baseType: !162, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !246, file: !188, line: 560, baseType: !154, size: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !246, file: !188, line: 561, baseType: !186, size: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !246, file: !188, line: 562, baseType: !242, size: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !246, file: !188, line: 563, baseType: !242, size: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !246, file: !188, line: 564, baseType: !242, size: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !246, file: !188, line: 565, baseType: !256, size: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", file: !165, line: 77, baseType: !162)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !246, file: !188, line: 566, baseType: !154, size: 32, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !246, file: !188, line: 566, baseType: !154, size: 32, offset: 544)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !246, file: !188, line: 567, baseType: !154, size: 32, offset: 576)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !246, file: !188, line: 567, baseType: !154, size: 32, offset: 608)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !246, file: !188, line: 568, baseType: !175, size: 32, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !246, file: !188, line: 569, baseType: !175, size: 32, offset: 672)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !246, file: !188, line: 570, baseType: !154, size: 32, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "xbutton", scope: !230, file: !188, line: 977, baseType: !265, size: 768)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "XButtonEvent", file: !188, line: 589, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 575, size: 768, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !188, line: 576, baseType: !154, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !266, file: !188, line: 577, baseType: !162, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !266, file: !188, line: 578, baseType: !154, size: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !266, file: !188, line: 579, baseType: !186, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !266, file: !188, line: 580, baseType: !242, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !266, file: !188, line: 581, baseType: !242, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !266, file: !188, line: 582, baseType: !242, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !266, file: !188, line: 583, baseType: !256, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !266, file: !188, line: 584, baseType: !154, size: 32, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !266, file: !188, line: 584, baseType: !154, size: 32, offset: 544)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !266, file: !188, line: 585, baseType: !154, size: 32, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !266, file: !188, line: 585, baseType: !154, size: 32, offset: 608)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !266, file: !188, line: 586, baseType: !175, size: 32, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !266, file: !188, line: 587, baseType: !175, size: 32, offset: 672)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !266, file: !188, line: 588, baseType: !154, size: 32, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "xmotion", scope: !230, file: !188, line: 978, baseType: !284, size: 768)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMotionEvent", file: !188, line: 607, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 593, size: 768, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !285, file: !188, line: 594, baseType: !154, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !285, file: !188, line: 595, baseType: !162, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !285, file: !188, line: 596, baseType: !154, size: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !285, file: !188, line: 597, baseType: !186, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !285, file: !188, line: 598, baseType: !242, size: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !285, file: !188, line: 599, baseType: !242, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !285, file: !188, line: 600, baseType: !242, size: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !285, file: !188, line: 601, baseType: !256, size: 64, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !285, file: !188, line: 602, baseType: !154, size: 32, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !285, file: !188, line: 602, baseType: !154, size: 32, offset: 544)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !285, file: !188, line: 603, baseType: !154, size: 32, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !285, file: !188, line: 603, baseType: !154, size: 32, offset: 608)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !285, file: !188, line: 604, baseType: !175, size: 32, offset: 640)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "is_hint", scope: !285, file: !188, line: 605, baseType: !159, size: 8, offset: 672)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !285, file: !188, line: 606, baseType: !154, size: 32, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "xcrossing", scope: !230, file: !188, line: 979, baseType: !303, size: 832)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCrossingEvent", file: !188, line: 630, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 610, size: 832, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !188, line: 611, baseType: !154, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !304, file: !188, line: 612, baseType: !162, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !304, file: !188, line: 613, baseType: !154, size: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !304, file: !188, line: 614, baseType: !186, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !304, file: !188, line: 615, baseType: !242, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !304, file: !188, line: 616, baseType: !242, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !304, file: !188, line: 617, baseType: !242, size: 64, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !304, file: !188, line: 618, baseType: !256, size: 64, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !304, file: !188, line: 619, baseType: !154, size: 32, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !304, file: !188, line: 619, baseType: !154, size: 32, offset: 544)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !304, file: !188, line: 620, baseType: !154, size: 32, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !304, file: !188, line: 620, baseType: !154, size: 32, offset: 608)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !304, file: !188, line: 621, baseType: !154, size: 32, offset: 640)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !304, file: !188, line: 622, baseType: !154, size: 32, offset: 672)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !304, file: !188, line: 627, baseType: !154, size: 32, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "focus", scope: !304, file: !188, line: 628, baseType: !154, size: 32, offset: 736)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !304, file: !188, line: 629, baseType: !175, size: 32, offset: 768)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "xfocus", scope: !230, file: !188, line: 980, baseType: !324, size: 384)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "XFocusChangeEvent", file: !188, line: 648, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 634, size: 384, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !325, file: !188, line: 635, baseType: !154, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !325, file: !188, line: 636, baseType: !162, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !325, file: !188, line: 637, baseType: !154, size: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !325, file: !188, line: 638, baseType: !186, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !325, file: !188, line: 639, baseType: !242, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !325, file: !188, line: 640, baseType: !154, size: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !325, file: !188, line: 642, baseType: !154, size: 32, offset: 352)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "xexpose", scope: !230, file: !188, line: 981, baseType: !335, size: 512)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExposeEvent", file: !188, line: 671, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 662, size: 512, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346, !347}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !336, file: !188, line: 663, baseType: !154, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !336, file: !188, line: 664, baseType: !162, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !336, file: !188, line: 665, baseType: !154, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !336, file: !188, line: 666, baseType: !186, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !336, file: !188, line: 667, baseType: !242, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !336, file: !188, line: 668, baseType: !154, size: 32, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !336, file: !188, line: 668, baseType: !154, size: 32, offset: 352)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !336, file: !188, line: 669, baseType: !154, size: 32, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !336, file: !188, line: 669, baseType: !154, size: 32, offset: 416)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !336, file: !188, line: 670, baseType: !154, size: 32, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "xgraphicsexpose", scope: !230, file: !188, line: 982, baseType: !349, size: 576)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGraphicsExposeEvent", file: !188, line: 684, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 673, size: 576, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !358, !359, !360, !361, !362, !363, !364}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !188, line: 674, baseType: !154, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !350, file: !188, line: 675, baseType: !162, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !350, file: !188, line: 676, baseType: !154, size: 32, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !350, file: !188, line: 677, baseType: !186, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !350, file: !188, line: 678, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !165, line: 97, baseType: !243)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !350, file: !188, line: 679, baseType: !154, size: 32, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !350, file: !188, line: 679, baseType: !154, size: 32, offset: 352)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !350, file: !188, line: 680, baseType: !154, size: 32, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !350, file: !188, line: 680, baseType: !154, size: 32, offset: 416)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !350, file: !188, line: 681, baseType: !154, size: 32, offset: 448)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !350, file: !188, line: 682, baseType: !154, size: 32, offset: 480)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !350, file: !188, line: 683, baseType: !154, size: 32, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "xnoexpose", scope: !230, file: !188, line: 983, baseType: !366, size: 384)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "XNoExposeEvent", file: !188, line: 694, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 686, size: 384, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !188, line: 687, baseType: !154, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !367, file: !188, line: 688, baseType: !162, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !367, file: !188, line: 689, baseType: !154, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !367, file: !188, line: 690, baseType: !186, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !367, file: !188, line: 691, baseType: !357, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !367, file: !188, line: 692, baseType: !154, size: 32, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !367, file: !188, line: 693, baseType: !154, size: 32, offset: 352)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "xvisibility", scope: !230, file: !188, line: 984, baseType: !377, size: 384)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "XVisibilityEvent", file: !188, line: 703, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 696, size: 384, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !378, file: !188, line: 697, baseType: !154, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !378, file: !188, line: 698, baseType: !162, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !378, file: !188, line: 699, baseType: !154, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !378, file: !188, line: 700, baseType: !186, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !378, file: !188, line: 701, baseType: !242, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !378, file: !188, line: 702, baseType: !154, size: 32, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "xcreatewindow", scope: !230, file: !188, line: 985, baseType: !387, size: 576)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCreateWindowEvent", file: !188, line: 716, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 705, size: 576, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !388, file: !188, line: 706, baseType: !154, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !388, file: !188, line: 707, baseType: !162, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !388, file: !188, line: 708, baseType: !154, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !388, file: !188, line: 709, baseType: !186, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !388, file: !188, line: 710, baseType: !242, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !388, file: !188, line: 711, baseType: !242, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !388, file: !188, line: 712, baseType: !154, size: 32, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !388, file: !188, line: 712, baseType: !154, size: 32, offset: 416)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !388, file: !188, line: 713, baseType: !154, size: 32, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !388, file: !188, line: 713, baseType: !154, size: 32, offset: 480)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !388, file: !188, line: 714, baseType: !154, size: 32, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !388, file: !188, line: 715, baseType: !154, size: 32, offset: 544)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "xdestroywindow", scope: !230, file: !188, line: 986, baseType: !403, size: 384)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDestroyWindowEvent", file: !188, line: 725, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 718, size: 384, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !404, file: !188, line: 719, baseType: !154, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !404, file: !188, line: 720, baseType: !162, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !404, file: !188, line: 721, baseType: !154, size: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !404, file: !188, line: 722, baseType: !186, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !404, file: !188, line: 723, baseType: !242, size: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !404, file: !188, line: 724, baseType: !242, size: 64, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "xunmap", scope: !230, file: !188, line: 987, baseType: !413, size: 448)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "XUnmapEvent", file: !188, line: 735, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 727, size: 448, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !414, file: !188, line: 728, baseType: !154, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !414, file: !188, line: 729, baseType: !162, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !414, file: !188, line: 730, baseType: !154, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !414, file: !188, line: 731, baseType: !186, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !414, file: !188, line: 732, baseType: !242, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !414, file: !188, line: 733, baseType: !242, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "from_configure", scope: !414, file: !188, line: 734, baseType: !154, size: 32, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "xmap", scope: !230, file: !188, line: 988, baseType: !424, size: 448)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapEvent", file: !188, line: 745, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 737, size: 448, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !425, file: !188, line: 738, baseType: !154, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !425, file: !188, line: 739, baseType: !162, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !425, file: !188, line: 740, baseType: !154, size: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !425, file: !188, line: 741, baseType: !186, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !425, file: !188, line: 742, baseType: !242, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !425, file: !188, line: 743, baseType: !242, size: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !425, file: !188, line: 744, baseType: !154, size: 32, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "xmaprequest", scope: !230, file: !188, line: 989, baseType: !435, size: 384)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapRequestEvent", file: !188, line: 754, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 747, size: 384, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !188, line: 748, baseType: !154, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !436, file: !188, line: 749, baseType: !162, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !436, file: !188, line: 750, baseType: !154, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !436, file: !188, line: 751, baseType: !186, size: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !436, file: !188, line: 752, baseType: !242, size: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !436, file: !188, line: 753, baseType: !242, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "xreparent", scope: !230, file: !188, line: 990, baseType: !445, size: 576)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "XReparentEvent", file: !188, line: 766, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 756, size: 576, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !446, file: !188, line: 757, baseType: !154, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !446, file: !188, line: 758, baseType: !162, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !446, file: !188, line: 759, baseType: !154, size: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !446, file: !188, line: 760, baseType: !186, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !446, file: !188, line: 761, baseType: !242, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !446, file: !188, line: 762, baseType: !242, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !446, file: !188, line: 763, baseType: !242, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !446, file: !188, line: 764, baseType: !154, size: 32, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !446, file: !188, line: 764, baseType: !154, size: 32, offset: 480)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !446, file: !188, line: 765, baseType: !154, size: 32, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "xconfigure", scope: !230, file: !188, line: 991, baseType: !459, size: 704)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "XConfigureEvent", file: !188, line: 780, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 768, size: 704, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !460, file: !188, line: 769, baseType: !154, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !460, file: !188, line: 770, baseType: !162, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !460, file: !188, line: 771, baseType: !154, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !460, file: !188, line: 772, baseType: !186, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !460, file: !188, line: 773, baseType: !242, size: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !460, file: !188, line: 774, baseType: !242, size: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !460, file: !188, line: 775, baseType: !154, size: 32, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !460, file: !188, line: 775, baseType: !154, size: 32, offset: 416)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !460, file: !188, line: 776, baseType: !154, size: 32, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !460, file: !188, line: 776, baseType: !154, size: 32, offset: 480)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !460, file: !188, line: 777, baseType: !154, size: 32, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !460, file: !188, line: 778, baseType: !242, size: 64, offset: 576)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !460, file: !188, line: 779, baseType: !154, size: 32, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "xgravity", scope: !230, file: !188, line: 992, baseType: !476, size: 448)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGravityEvent", file: !188, line: 790, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 782, size: 448, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !484, !485, !486}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !477, file: !188, line: 783, baseType: !154, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !477, file: !188, line: 784, baseType: !162, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !477, file: !188, line: 785, baseType: !154, size: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !477, file: !188, line: 786, baseType: !186, size: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !477, file: !188, line: 787, baseType: !242, size: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !477, file: !188, line: 788, baseType: !242, size: 64, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !477, file: !188, line: 789, baseType: !154, size: 32, offset: 384)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !477, file: !188, line: 789, baseType: !154, size: 32, offset: 416)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "xresizerequest", scope: !230, file: !188, line: 993, baseType: !488, size: 384)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "XResizeRequestEvent", file: !188, line: 799, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 792, size: 384, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !188, line: 793, baseType: !154, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !489, file: !188, line: 794, baseType: !162, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !489, file: !188, line: 795, baseType: !154, size: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !489, file: !188, line: 796, baseType: !186, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !489, file: !188, line: 797, baseType: !242, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !489, file: !188, line: 798, baseType: !154, size: 32, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !489, file: !188, line: 798, baseType: !154, size: 32, offset: 352)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "xconfigurerequest", scope: !230, file: !188, line: 994, baseType: !499, size: 768)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "XConfigureRequestEvent", file: !188, line: 814, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 801, size: 768, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !500, file: !188, line: 802, baseType: !154, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !500, file: !188, line: 803, baseType: !162, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !500, file: !188, line: 804, baseType: !154, size: 32, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !500, file: !188, line: 805, baseType: !186, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !500, file: !188, line: 806, baseType: !242, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !500, file: !188, line: 807, baseType: !242, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !500, file: !188, line: 808, baseType: !154, size: 32, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !500, file: !188, line: 808, baseType: !154, size: 32, offset: 416)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !500, file: !188, line: 809, baseType: !154, size: 32, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !500, file: !188, line: 809, baseType: !154, size: 32, offset: 480)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !500, file: !188, line: 810, baseType: !154, size: 32, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !500, file: !188, line: 811, baseType: !242, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !500, file: !188, line: 812, baseType: !154, size: 32, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "value_mask", scope: !500, file: !188, line: 813, baseType: !162, size: 64, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "xcirculate", scope: !230, file: !188, line: 995, baseType: !517, size: 448)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCirculateEvent", file: !188, line: 824, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 816, size: 448, elements: !519)
!519 = !{!520, !521, !522, !523, !524, !525, !526}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !518, file: !188, line: 817, baseType: !154, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !518, file: !188, line: 818, baseType: !162, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !518, file: !188, line: 819, baseType: !154, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !518, file: !188, line: 820, baseType: !186, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !518, file: !188, line: 821, baseType: !242, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !518, file: !188, line: 822, baseType: !242, size: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "place", scope: !518, file: !188, line: 823, baseType: !154, size: 32, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "xcirculaterequest", scope: !230, file: !188, line: 996, baseType: !528, size: 448)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCirculateRequestEvent", file: !188, line: 834, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 826, size: 448, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !529, file: !188, line: 827, baseType: !154, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !529, file: !188, line: 828, baseType: !162, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !529, file: !188, line: 829, baseType: !154, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !529, file: !188, line: 830, baseType: !186, size: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !529, file: !188, line: 831, baseType: !242, size: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !529, file: !188, line: 832, baseType: !242, size: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "place", scope: !529, file: !188, line: 833, baseType: !154, size: 32, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "xproperty", scope: !230, file: !188, line: 997, baseType: !539, size: 512)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPropertyEvent", file: !188, line: 845, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 836, size: 512, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !540, file: !188, line: 837, baseType: !154, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !540, file: !188, line: 838, baseType: !162, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !540, file: !188, line: 839, baseType: !154, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !540, file: !188, line: 840, baseType: !186, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !540, file: !188, line: 841, baseType: !242, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !540, file: !188, line: 842, baseType: !164, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !540, file: !188, line: 843, baseType: !256, size: 64, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !540, file: !188, line: 844, baseType: !154, size: 32, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "xselectionclear", scope: !230, file: !188, line: 998, baseType: !551, size: 448)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionClearEvent", file: !188, line: 855, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 847, size: 448, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !552, file: !188, line: 848, baseType: !154, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !552, file: !188, line: 849, baseType: !162, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !552, file: !188, line: 850, baseType: !154, size: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !552, file: !188, line: 851, baseType: !186, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !552, file: !188, line: 852, baseType: !242, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !552, file: !188, line: 853, baseType: !164, size: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !552, file: !188, line: 854, baseType: !256, size: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "xselectionrequest", scope: !230, file: !188, line: 999, baseType: !562, size: 640)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionRequestEvent", file: !188, line: 868, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 857, size: 640, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !563, file: !188, line: 858, baseType: !154, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !563, file: !188, line: 859, baseType: !162, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !563, file: !188, line: 860, baseType: !154, size: 32, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !563, file: !188, line: 861, baseType: !186, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !563, file: !188, line: 862, baseType: !242, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !563, file: !188, line: 863, baseType: !242, size: 64, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !563, file: !188, line: 864, baseType: !164, size: 64, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !563, file: !188, line: 865, baseType: !164, size: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !563, file: !188, line: 866, baseType: !164, size: 64, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !563, file: !188, line: 867, baseType: !256, size: 64, offset: 576)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "xselection", scope: !230, file: !188, line: 1000, baseType: !576, size: 576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionEvent", file: !188, line: 880, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 870, size: 576, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !577, file: !188, line: 871, baseType: !154, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !577, file: !188, line: 872, baseType: !162, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !577, file: !188, line: 873, baseType: !154, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !577, file: !188, line: 874, baseType: !186, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !577, file: !188, line: 875, baseType: !242, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !577, file: !188, line: 876, baseType: !164, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !577, file: !188, line: 877, baseType: !164, size: 64, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !577, file: !188, line: 878, baseType: !164, size: 64, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !577, file: !188, line: 879, baseType: !256, size: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "xcolormap", scope: !230, file: !188, line: 1001, baseType: !589, size: 448)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "XColormapEvent", file: !188, line: 895, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 882, size: 448, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !599, !600}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !590, file: !188, line: 883, baseType: !154, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !590, file: !188, line: 884, baseType: !162, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !590, file: !188, line: 885, baseType: !154, size: 32, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !590, file: !188, line: 886, baseType: !186, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !590, file: !188, line: 887, baseType: !242, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !590, file: !188, line: 888, baseType: !598, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !165, line: 104, baseType: !243)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !590, file: !188, line: 892, baseType: !154, size: 32, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !590, file: !188, line: 894, baseType: !154, size: 32, offset: 416)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "xclient", scope: !230, file: !188, line: 1002, baseType: !602, size: 768)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "XClientMessageEvent", file: !188, line: 910, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 897, size: 768, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !603, file: !188, line: 898, baseType: !154, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !603, file: !188, line: 899, baseType: !162, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !603, file: !188, line: 900, baseType: !154, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !603, file: !188, line: 901, baseType: !186, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !603, file: !188, line: 902, baseType: !242, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !603, file: !188, line: 903, baseType: !164, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !603, file: !188, line: 904, baseType: !154, size: 32, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !603, file: !188, line: 909, baseType: !613, size: 320, offset: 448)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !603, file: !188, line: 905, size: 320, elements: !614)
!614 = !{!615, !619, !624}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !613, file: !188, line: 906, baseType: !616, size: 160)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 160, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 20)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !613, file: !188, line: 907, baseType: !620, size: 160)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 160, elements: !622)
!621 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!622 = !{!623}
!623 = !DISubrange(count: 10)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !613, file: !188, line: 908, baseType: !625, size: 320)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 320, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 5)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "xmapping", scope: !230, file: !188, line: 1003, baseType: !629, size: 448)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMappingEvent", file: !188, line: 922, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 912, size: 448, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !630, file: !188, line: 913, baseType: !154, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !630, file: !188, line: 914, baseType: !162, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !630, file: !188, line: 915, baseType: !154, size: 32, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !630, file: !188, line: 916, baseType: !186, size: 64, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !630, file: !188, line: 917, baseType: !242, size: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !630, file: !188, line: 918, baseType: !154, size: 32, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "first_keycode", scope: !630, file: !188, line: 920, baseType: !154, size: 32, offset: 352)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !630, file: !188, line: 921, baseType: !154, size: 32, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "xerror", scope: !230, file: !188, line: 1004, baseType: !641, size: 320)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "XErrorEvent", file: !188, line: 932, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 924, size: 320, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !642, file: !188, line: 925, baseType: !154, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !642, file: !188, line: 926, baseType: !186, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "resourceid", scope: !642, file: !188, line: 927, baseType: !243, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !642, file: !188, line: 928, baseType: !162, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "error_code", scope: !642, file: !188, line: 929, baseType: !170, size: 8, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "request_code", scope: !642, file: !188, line: 930, baseType: !170, size: 8, offset: 264)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !642, file: !188, line: 931, baseType: !170, size: 8, offset: 272)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "xkeymap", scope: !230, file: !188, line: 1005, baseType: !652, size: 576)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeymapEvent", file: !188, line: 660, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 653, size: 576, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !653, file: !188, line: 654, baseType: !154, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !653, file: !188, line: 655, baseType: !162, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !653, file: !188, line: 656, baseType: !154, size: 32, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !653, file: !188, line: 657, baseType: !186, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !653, file: !188, line: 658, baseType: !242, size: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "key_vector", scope: !653, file: !188, line: 659, baseType: !661, size: 256, offset: 320)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 256, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "xgeneric", scope: !230, file: !188, line: 1006, baseType: !665, size: 320)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGenericEvent", file: !188, line: 956, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 948, size: 320, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !666, file: !188, line: 950, baseType: !154, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !666, file: !188, line: 951, baseType: !162, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !666, file: !188, line: 952, baseType: !154, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !666, file: !188, line: 953, baseType: !186, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !666, file: !188, line: 954, baseType: !154, size: 32, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "evtype", scope: !666, file: !188, line: 955, baseType: !154, size: 32, offset: 288)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "xcookie", scope: !230, file: !188, line: 1007, baseType: !675, size: 448)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGenericEventCookie", file: !188, line: 967, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 958, size: 448, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !676, file: !188, line: 959, baseType: !154, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !676, file: !188, line: 960, baseType: !162, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !676, file: !188, line: 961, baseType: !154, size: 32, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !676, file: !188, line: 962, baseType: !186, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !676, file: !188, line: 963, baseType: !154, size: 32, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "evtype", scope: !676, file: !188, line: 964, baseType: !154, size: 32, offset: 288)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !676, file: !188, line: 965, baseType: !175, size: 32, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !676, file: !188, line: 966, baseType: !155, size: 64, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !230, file: !188, line: 1008, baseType: !687, size: 1536)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 1536, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 24)
!690 = !DILocalVariable(name: "type", scope: !180, file: !3, line: 1703, type: !164)
!691 = !DILocalVariable(name: "i", scope: !180, file: !3, line: 1705, type: !154)
!692 = !DILocalVariable(name: "start_time", scope: !180, file: !3, line: 1706, type: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !694, line: 7, baseType: !695)
!694 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "/home/sahil/vim/src")
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !696, line: 160, baseType: !163)
!696 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!697 = !DILocalVariable(name: "timed_out", scope: !180, file: !3, line: 1707, type: !154)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "vim_atom", scope: !2, file: !3, line: 1368, type: !164, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "vimenc_atom", scope: !2, file: !3, line: 1369, type: !164, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "utf8_atom", scope: !2, file: !3, line: 1370, type: !164, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "compound_text_atom", scope: !2, file: !3, line: 1371, type: !164, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "text_atom", scope: !2, file: !3, line: 1372, type: !164, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "targets_atom", scope: !2, file: !3, line: 1373, type: !164, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "timestamp_atom", scope: !2, file: !3, line: 1374, type: !164, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "clipboard_needs_update", scope: !2, file: !3, line: 233, type: !154, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "clip_did_set_selection", scope: !2, file: !3, line: 234, type: !154, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "save_result", scope: !718, file: !3, line: 1404, type: !168, isLocal: true, isDefinition: true)
!718 = distinct !DISubprogram(name: "clip_x11_convert_selection_cb", scope: !3, file: !3, line: 1395, type: !719, isLocal: true, isDefinition: true, scopeLine: 1403, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !725)
!719 = !DISubroutineType(types: !720)
!720 = !{!721, !183, !722, !722, !722, !723, !724, !172}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !167, line: 150, baseType: !159)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !748, !749, !750}
!726 = !DILocalVariable(name: "w", arg: 1, scope: !718, file: !3, line: 1396, type: !183)
!727 = !DILocalVariable(name: "sel_atom", arg: 2, scope: !718, file: !3, line: 1397, type: !722)
!728 = !DILocalVariable(name: "target", arg: 3, scope: !718, file: !3, line: 1398, type: !722)
!729 = !DILocalVariable(name: "type", arg: 4, scope: !718, file: !3, line: 1399, type: !722)
!730 = !DILocalVariable(name: "value", arg: 5, scope: !718, file: !3, line: 1400, type: !723)
!731 = !DILocalVariable(name: "length", arg: 6, scope: !718, file: !3, line: 1401, type: !724)
!732 = !DILocalVariable(name: "format", arg: 7, scope: !718, file: !3, line: 1402, type: !172)
!733 = !DILocalVariable(name: "string", scope: !718, file: !3, line: 1406, type: !168)
!734 = !DILocalVariable(name: "motion_type", scope: !718, file: !3, line: 1407, type: !154)
!735 = !DILocalVariable(name: "cbd", scope: !718, file: !3, line: 1408, type: !190)
!736 = !DILocalVariable(name: "i", scope: !718, file: !3, line: 1409, type: !154)
!737 = !DILocalVariable(name: "text_prop", scope: !738, file: !3, line: 1483, type: !741)
!738 = distinct !DILexicalBlock(scope: !739, file: !3, line: 1482, column: 5)
!739 = distinct !DILexicalBlock(scope: !740, file: !3, line: 1481, column: 14)
!740 = distinct !DILexicalBlock(scope: !718, file: !3, line: 1476, column: 9)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "XTextProperty", file: !146, line: 168, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 163, size: 256, elements: !743)
!743 = !{!744, !745, !746, !747}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !742, file: !146, line: 164, baseType: !173, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !742, file: !146, line: 165, baseType: !164, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !742, file: !146, line: 166, baseType: !154, size: 32, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "nitems", scope: !742, file: !146, line: 167, baseType: !162, size: 64, offset: 192)
!748 = !DILocalVariable(name: "string_nt", scope: !738, file: !3, line: 1484, type: !158)
!749 = !DILocalVariable(name: "conv_result", scope: !738, file: !3, line: 1485, type: !154)
!750 = !DILocalVariable(name: "l", scope: !751, file: !3, line: 1506, type: !154)
!751 = distinct !DILexicalBlock(scope: !752, file: !3, line: 1505, column: 5)
!752 = distinct !DILexicalBlock(scope: !739, file: !3, line: 1504, column: 14)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "save_length", scope: !718, file: !3, line: 1405, type: !171, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "array", scope: !718, file: !3, line: 1422, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 448, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 7)
!760 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!761 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!762 = !{i32 2, !"Dwarf Version", i32 4}
!763 = !{i32 2, !"Debug Info Version", i32 3}
!764 = !{i32 1, !"wchar_size", i32 4}
!765 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!766 = distinct !DISubprogram(name: "clip_init", scope: !3, file: !3, line: 46, type: !767, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !769)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !154}
!769 = !{!770, !771}
!770 = !DILocalVariable(name: "can_use", arg: 1, scope: !766, file: !3, line: 46, type: !154)
!771 = !DILocalVariable(name: "cb", scope: !766, file: !3, line: 48, type: !190)
!772 = !DILocation(line: 46, column: 15, scope: !766)
!773 = !DILocation(line: 48, column: 18, scope: !766)
!774 = !DILocation(line: 53, column: 17, scope: !775)
!775 = distinct !DILexicalBlock(scope: !776, file: !3, line: 52, column: 5)
!776 = distinct !DILexicalBlock(scope: !777, file: !3, line: 51, column: 5)
!777 = distinct !DILexicalBlock(scope: !766, file: !3, line: 51, column: 5)
!778 = !{!779, !780, i64 0}
!779 = !{!"", !780, i64 0, !780, i64 4, !783, i64 8, !783, i64 24, !780, i64 40, !785, i64 44, !785, i64 46, !785, i64 48, !785, i64 50, !785, i64 52, !785, i64 54, !785, i64 56, !785, i64 58, !785, i64 60, !783, i64 64, !785, i64 80, !785, i64 82, !784, i64 88, !786, i64 96}
!780 = !{!"int", !781, i64 0}
!781 = !{!"omnipotent char", !782, i64 0}
!782 = !{!"Simple C/C++ TBAA"}
!783 = !{!"", !784, i64 0, !780, i64 8, !780, i64 12}
!784 = !{!"long", !781, i64 0}
!785 = !{!"short", !781, i64 0}
!786 = !{!"any pointer", !781, i64 0}
!787 = !DILocation(line: 57, column: 17, scope: !775)
!788 = !{!779, !784, i64 24}
!789 = !DILocation(line: 58, column: 17, scope: !775)
!790 = !{!779, !780, i64 32}
!791 = !DILocation(line: 59, column: 17, scope: !775)
!792 = !{!779, !785, i64 80}
!793 = !DILocation(line: 55, column: 17, scope: !775)
!794 = !DILocation(line: 65, column: 1, scope: !766)
!795 = distinct !DISubprogram(name: "clip_update_selection", scope: !3, file: !3, line: 75, type: !796, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !798)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !190}
!798 = !{!799, !800, !801}
!799 = !DILocalVariable(name: "clip", arg: 1, scope: !795, file: !3, line: 75, type: !190)
!800 = !DILocalVariable(name: "start", scope: !795, file: !3, line: 77, type: !197)
!801 = !DILocalVariable(name: "end", scope: !795, file: !3, line: 77, type: !197)
!802 = !DILocation(line: 75, column: 36, scope: !795)
!803 = !DILocation(line: 80, column: 10, scope: !804)
!804 = distinct !DILexicalBlock(scope: !795, file: !3, line: 80, column: 9)
!805 = !{!780, !780, i64 0}
!806 = !DILocation(line: 80, column: 30, scope: !804)
!807 = !DILocation(line: 80, column: 27, scope: !804)
!808 = !DILocation(line: 80, column: 48, scope: !804)
!809 = !DILocation(line: 80, column: 54, scope: !804)
!810 = !DILocation(line: 80, column: 9, scope: !795)
!811 = !DILocation(line: 82, column: 6, scope: !812)
!812 = distinct !DILexicalBlock(scope: !813, file: !3, line: 82, column: 6)
!813 = distinct !DILexicalBlock(scope: !804, file: !3, line: 81, column: 5)
!814 = !{!783, !784, i64 0}
!815 = !{!786, !786, i64 0}
!816 = !{!817, !784, i64 56}
!817 = !{!"window_S", !780, i64 0, !786, i64 8, !786, i64 16, !786, i64 24, !786, i64 32, !780, i64 40, !786, i64 48, !783, i64 56, !780, i64 72, !780, i64 76, !784, i64 80, !781, i64 88, !784, i64 96, !780, i64 104, !780, i64 108, !784, i64 112, !780, i64 120, !780, i64 124, !818, i64 128, !784, i64 176, !781, i64 184, !784, i64 192, !780, i64 200, !780, i64 204, !780, i64 208, !780, i64 212, !780, i64 216, !780, i64 220, !780, i64 224, !780, i64 228, !780, i64 232, !780, i64 236, !780, i64 240, !780, i64 244, !780, i64 248, !780, i64 252, !819, i64 256, !780, i64 296, !780, i64 300, !786, i64 304, !781, i64 312, !780, i64 316, !780, i64 320, !786, i64 328, !780, i64 336, !780, i64 340, !780, i64 344, !780, i64 348, !780, i64 352, !780, i64 356, !780, i64 360, !780, i64 364, !780, i64 368, !780, i64 372, !780, i64 376, !780, i64 380, !786, i64 384, !786, i64 392, !781, i64 400, !781, i64 416, !781, i64 432, !781, i64 464, !780, i64 496, !780, i64 500, !820, i64 504, !820, i64 512, !780, i64 520, !784, i64 528, !821, i64 536, !821, i64 560, !780, i64 584, !780, i64 588, !786, i64 592, !784, i64 600, !780, i64 608, !780, i64 612, !780, i64 616, !780, i64 620, !780, i64 624, !781, i64 628, !786, i64 632, !786, i64 640, !780, i64 648, !780, i64 652, !786, i64 656, !780, i64 664, !780, i64 668, !783, i64 672, !780, i64 688, !780, i64 692, !780, i64 696, !780, i64 700, !780, i64 704, !780, i64 708, !780, i64 712, !780, i64 716, !786, i64 720, !822, i64 728, !781, i64 752, !781, i64 753, !780, i64 756, !780, i64 760, !780, i64 764, !784, i64 768, !784, i64 776, !780, i64 784, !783, i64 792, !780, i64 808, !784, i64 816, !784, i64 824, !780, i64 832, !781, i64 836, !780, i64 840, !786, i64 848, !780, i64 856, !780, i64 860, !786, i64 864, !786, i64 872, !786, i64 880, !786, i64 888, !780, i64 896, !823, i64 904, !823, i64 2280, !784, i64 3656, !784, i64 3664, !784, i64 3672, !786, i64 3680, !781, i64 3688, !784, i64 3696, !784, i64 3704, !780, i64 3712, !780, i64 3716, !780, i64 3720, !784, i64 3728, !824, i64 3736, !786, i64 3760, !783, i64 3768, !783, i64 3784, !781, i64 3800, !780, i64 7800, !780, i64 7804, !780, i64 7808, !786, i64 7816, !780, i64 7824, !781, i64 7832, !780, i64 8792, !780, i64 8796, !780, i64 8800, !780, i64 8804, !781, i64 8808, !784, i64 8968, !784, i64 8976, !780, i64 8984, !786, i64 8992, !786, i64 9000}
!818 = !{!"", !780, i64 0, !780, i64 4, !780, i64 8, !780, i64 12, !780, i64 16, !780, i64 20, !780, i64 24, !780, i64 28, !780, i64 32, !780, i64 36, !780, i64 40}
!819 = !{!"", !780, i64 0, !780, i64 4, !783, i64 8, !783, i64 24}
!820 = !{!"long long", !781, i64 0}
!821 = !{!"", !786, i64 0, !786, i64 8, !780, i64 16}
!822 = !{!"growarray", !780, i64 0, !780, i64 4, !780, i64 8, !780, i64 12, !786, i64 16}
!823 = !{!"", !780, i64 0, !780, i64 4, !786, i64 8, !786, i64 16, !780, i64 24, !784, i64 32, !780, i64 40, !780, i64 44, !780, i64 48, !786, i64 56, !784, i64 64, !780, i64 72, !786, i64 80, !786, i64 88, !784, i64 96, !784, i64 104, !786, i64 112, !786, i64 120, !786, i64 128, !780, i64 136, !780, i64 140, !786, i64 144, !780, i64 152, !780, i64 156, !784, i64 160, !780, i64 168, !780, i64 172, !780, i64 176, !780, i64 180, !786, i64 184, !784, i64 192, !780, i64 200, !780, i64 204, !780, i64 208, !786, i64 216, !786, i64 224, !786, i64 232, !786, i64 240, !780, i64 248, !780, i64 252, !780, i64 256, !780, i64 260, !780, i64 264, !786, i64 272, !784, i64 280, !780, i64 288, !780, i64 292, !786, i64 296, !786, i64 304, !786, i64 312, !781, i64 320}
!824 = !{!"dictitem_S", !825, i64 0, !781, i64 16, !781, i64 17}
!825 = !{!"", !781, i64 0, !781, i64 4, !781, i64 8}
!826 = !DILocation(line: 82, column: 6, scope: !813)
!827 = !DILocation(line: 84, column: 14, scope: !828)
!828 = distinct !DILexicalBlock(scope: !812, file: !3, line: 83, column: 2)
!829 = !DILocation(line: 85, column: 20, scope: !828)
!830 = !DILocation(line: 91, column: 22, scope: !831)
!831 = distinct !DILexicalBlock(scope: !812, file: !3, line: 90, column: 2)
!832 = !DILocation(line: 92, column: 12, scope: !831)
!833 = !{!783, !780, i64 8}
!834 = !{!817, !780, i64 64}
!835 = !{!783, !780, i64 12}
!836 = !{!817, !780, i64 68}
!837 = !DILocation(line: 77, column: 15, scope: !795)
!838 = !DILocation(line: 77, column: 22, scope: !795)
!839 = !DILocation(line: 86, column: 10, scope: !840)
!840 = distinct !DILexicalBlock(scope: !828, file: !3, line: 86, column: 10)
!841 = !DILocation(line: 86, column: 10, scope: !828)
!842 = !DILocation(line: 87, column: 16, scope: !840)
!843 = !DILocation(line: 87, column: 28, scope: !840)
!844 = !DILocation(line: 87, column: 14, scope: !840)
!845 = !DILocation(line: 87, column: 45, scope: !840)
!846 = !DILocation(line: 87, column: 11, scope: !840)
!847 = !DILocation(line: 87, column: 3, scope: !840)
!848 = !DILocation(line: 94, column: 7, scope: !849)
!849 = distinct !DILexicalBlock(scope: !813, file: !3, line: 94, column: 6)
!850 = !{!779, !784, i64 8}
!851 = !{!779, !780, i64 16}
!852 = !{!779, !780, i64 20}
!853 = !DILocation(line: 95, column: 3, scope: !849)
!854 = !DILocation(line: 95, column: 7, scope: !849)
!855 = !{!779, !780, i64 36}
!856 = !DILocation(line: 96, column: 3, scope: !849)
!857 = !DILocation(line: 96, column: 12, scope: !849)
!858 = !{!779, !780, i64 40}
!859 = !DILocation(line: 96, column: 21, scope: !849)
!860 = !DILocation(line: 96, column: 18, scope: !849)
!861 = !DILocation(line: 94, column: 6, scope: !813)
!862 = !DILocalVariable(name: "cbd", arg: 1, scope: !863, file: !3, line: 929, type: !190)
!863 = distinct !DISubprogram(name: "clip_clear_selection", scope: !3, file: !3, line: 929, type: !796, isLocal: false, isDefinition: true, scopeLine: 930, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !864)
!864 = !{!862}
!865 = !DILocation(line: 929, column: 35, scope: !863, inlinedAt: !866)
!866 = distinct !DILocation(line: 98, column: 6, scope: !867)
!867 = distinct !DILexicalBlock(scope: !849, file: !3, line: 97, column: 2)
!868 = !DILocation(line: 932, column: 14, scope: !869, inlinedAt: !866)
!869 = distinct !DILexicalBlock(scope: !863, file: !3, line: 932, column: 9)
!870 = !DILocation(line: 932, column: 20, scope: !869, inlinedAt: !866)
!871 = !DILocation(line: 932, column: 9, scope: !863, inlinedAt: !866)
!872 = !DILocation(line: 99, column: 20, scope: !867)
!873 = !DILocation(line: 100, column: 18, scope: !867)
!874 = !DILocation(line: 935, column: 27, scope: !863, inlinedAt: !866)
!875 = !DILocation(line: 935, column: 60, scope: !863, inlinedAt: !866)
!876 = !DILocation(line: 936, column: 20, scope: !863, inlinedAt: !866)
!877 = !DILocation(line: 936, column: 6, scope: !863, inlinedAt: !866)
!878 = !DILocation(line: 936, column: 35, scope: !863, inlinedAt: !866)
!879 = !DILocation(line: 935, column: 5, scope: !863, inlinedAt: !866)
!880 = !DILocation(line: 937, column: 16, scope: !863, inlinedAt: !866)
!881 = !DILocation(line: 938, column: 1, scope: !863, inlinedAt: !866)
!882 = !DILocation(line: 101, column: 20, scope: !867)
!883 = !DILocation(line: 101, column: 12, scope: !867)
!884 = !DILocation(line: 101, column: 18, scope: !867)
!885 = !DILocation(line: 102, column: 6, scope: !867)
!886 = !DILocation(line: 103, column: 6, scope: !867)
!887 = !DILocalVariable(name: "cbd", arg: 1, scope: !888, file: !3, line: 1184, type: !190)
!888 = distinct !DISubprogram(name: "clip_gen_set_selection", scope: !3, file: !3, line: 1184, type: !796, isLocal: false, isDefinition: true, scopeLine: 1185, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !889)
!889 = !{!887}
!890 = !DILocation(line: 1184, column: 37, scope: !888, inlinedAt: !891)
!891 = distinct !DILocation(line: 104, column: 6, scope: !867)
!892 = !DILocation(line: 1186, column: 9, scope: !888, inlinedAt: !891)
!893 = !DILocation(line: 1190, column: 11, scope: !894, inlinedAt: !891)
!894 = distinct !DILexicalBlock(scope: !895, file: !3, line: 1190, column: 6)
!895 = distinct !DILexicalBlock(scope: !896, file: !3, line: 1187, column: 5)
!896 = distinct !DILexicalBlock(scope: !888, file: !3, line: 1186, column: 9)
!897 = !DILocation(line: 1190, column: 25, scope: !894, inlinedAt: !891)
!898 = !DILocation(line: 1190, column: 29, scope: !894, inlinedAt: !891)
!899 = !DILocation(line: 1190, column: 48, scope: !894, inlinedAt: !891)
!900 = !DILocation(line: 1191, column: 3, scope: !894, inlinedAt: !891)
!901 = !DILocation(line: 1191, column: 11, scope: !894, inlinedAt: !891)
!902 = !DILocation(line: 1191, column: 25, scope: !894, inlinedAt: !891)
!903 = !DILocation(line: 1191, column: 29, scope: !894, inlinedAt: !891)
!904 = !DILocation(line: 1191, column: 48, scope: !894, inlinedAt: !891)
!905 = !DILocation(line: 1190, column: 6, scope: !895, inlinedAt: !891)
!906 = !DILocation(line: 1194, column: 6, scope: !907, inlinedAt: !891)
!907 = distinct !DILexicalBlock(scope: !894, file: !3, line: 1192, column: 2)
!908 = !DILocation(line: 1199, column: 13, scope: !909, inlinedAt: !891)
!909 = distinct !DILexicalBlock(scope: !888, file: !3, line: 1199, column: 9)
!910 = !{!911, !780, i64 4}
!911 = !{!"Gui", !780, i64 0, !780, i64 4, !780, i64 8, !780, i64 12, !780, i64 16, !780, i64 20, !780, i64 24, !786, i64 32, !780, i64 40, !780, i64 44, !780, i64 48, !780, i64 52, !780, i64 56, !781, i64 60, !780, i64 64, !780, i64 68, !780, i64 72, !780, i64 76, !780, i64 80, !780, i64 84, !780, i64 88, !780, i64 92, !780, i64 96, !780, i64 100, !780, i64 104, !781, i64 108, !912, i64 112, !781, i64 192, !780, i64 204, !780, i64 208, !780, i64 212, !780, i64 216, !780, i64 220, !780, i64 224, !786, i64 232, !780, i64 240, !786, i64 248, !784, i64 256, !784, i64 264, !784, i64 272, !784, i64 280, !780, i64 288, !786, i64 296, !786, i64 304, !786, i64 312, !786, i64 320, !786, i64 328, !786, i64 336, !786, i64 344, !786, i64 352, !786, i64 360, !786, i64 368, !786, i64 376, !786, i64 384, !786, i64 392, !786, i64 400, !786, i64 408, !786, i64 416, !786, i64 424, !786, i64 432, !780, i64 440, !786, i64 448, !786, i64 456}
!912 = !{!"GuiScrollbar", !784, i64 0, !786, i64 8, !780, i64 16, !784, i64 24, !784, i64 32, !784, i64 40, !780, i64 48, !780, i64 52, !780, i64 56, !780, i64 60, !786, i64 64, !784, i64 72}
!913 = !DILocation(line: 1199, column: 9, scope: !909, inlinedAt: !891)
!914 = !DILocation(line: 1199, column: 9, scope: !888, inlinedAt: !891)
!915 = !DILocation(line: 1200, column: 2, scope: !909, inlinedAt: !891)
!916 = !DILocation(line: 1203, column: 2, scope: !909, inlinedAt: !891)
!917 = !DILocation(line: 107, column: 1, scope: !795)
!918 = !DILocation(line: 929, column: 35, scope: !863)
!919 = !DILocation(line: 932, column: 14, scope: !869)
!920 = !DILocation(line: 932, column: 20, scope: !869)
!921 = !DILocation(line: 932, column: 9, scope: !863)
!922 = !DILocation(line: 935, column: 43, scope: !863)
!923 = !DILocation(line: 935, column: 27, scope: !863)
!924 = !DILocation(line: 935, column: 60, scope: !863)
!925 = !DILocation(line: 936, column: 20, scope: !863)
!926 = !DILocation(line: 936, column: 6, scope: !863)
!927 = !DILocation(line: 936, column: 35, scope: !863)
!928 = !DILocation(line: 935, column: 5, scope: !863)
!929 = !DILocation(line: 937, column: 16, scope: !863)
!930 = !DILocation(line: 938, column: 1, scope: !863)
!931 = distinct !DISubprogram(name: "clip_free_selection", scope: !3, file: !3, line: 1991, type: !796, isLocal: false, isDefinition: true, scopeLine: 1992, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !932)
!932 = !{!933, !934}
!933 = !DILocalVariable(name: "cbd", arg: 1, scope: !931, file: !3, line: 1991, type: !190)
!934 = !DILocalVariable(name: "y_ptr", scope: !931, file: !3, line: 1993, type: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "yankreg_T", file: !58, line: 4311, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 4302, size: 256, elements: !938)
!938 = !{!939, !941, !942, !943, !944}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "y_array", scope: !937, file: !58, line: 4304, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "y_size", scope: !937, file: !58, line: 4305, baseType: !201, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "y_type", scope: !937, file: !58, line: 4306, baseType: !169, size: 8, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "y_width", scope: !937, file: !58, line: 4307, baseType: !203, size: 32, offset: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "y_time_set", scope: !937, file: !58, line: 4309, baseType: !693, size: 64, offset: 192)
!945 = !DILocation(line: 1991, column: 34, scope: !931)
!946 = !DILocation(line: 1993, column: 24, scope: !931)
!947 = !DILocation(line: 1993, column: 16, scope: !931)
!948 = !DILocation(line: 1995, column: 13, scope: !949)
!949 = distinct !DILexicalBlock(scope: !931, file: !3, line: 1995, column: 9)
!950 = !DILocation(line: 1995, column: 9, scope: !931)
!951 = !DILocation(line: 1996, column: 16, scope: !949)
!952 = !DILocation(line: 1996, column: 2, scope: !949)
!953 = !DILocation(line: 1998, column: 16, scope: !949)
!954 = !DILocation(line: 1998, column: 2, scope: !949)
!955 = !DILocation(line: 1999, column: 5, scope: !931)
!956 = !DILocation(line: 2000, column: 5, scope: !931)
!957 = !DILocation(line: 2000, column: 22, scope: !931)
!958 = !DILocation(line: 2000, column: 29, scope: !931)
!959 = !{!960, !784, i64 8}
!960 = !{!"", !786, i64 0, !784, i64 8, !781, i64 16, !780, i64 20, !784, i64 24}
!961 = !DILocation(line: 2001, column: 5, scope: !931)
!962 = !DILocation(line: 2002, column: 1, scope: !931)
!963 = distinct !DISubprogram(name: "clip_own_selection", scope: !3, file: !3, line: 125, type: !796, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !964)
!964 = !{!965, !966}
!965 = !DILocalVariable(name: "cbd", arg: 1, scope: !963, file: !3, line: 125, type: !190)
!966 = !DILocalVariable(name: "was_owned", scope: !967, file: !3, line: 136, type: !154)
!967 = distinct !DILexicalBlock(scope: !968, file: !3, line: 135, column: 5)
!968 = distinct !DILexicalBlock(scope: !963, file: !3, line: 134, column: 9)
!969 = !DILocation(line: 125, column: 33, scope: !963)
!970 = !DILocation(line: 134, column: 14, scope: !968)
!971 = !DILocation(line: 134, column: 9, scope: !968)
!972 = !DILocation(line: 134, column: 9, scope: !963)
!973 = !DILocation(line: 136, column: 23, scope: !967)
!974 = !{!779, !780, i64 4}
!975 = !DILocation(line: 136, column: 6, scope: !967)
!976 = !DILocalVariable(name: "cbd", arg: 1, scope: !977, file: !3, line: 110, type: !190)
!977 = distinct !DISubprogram(name: "clip_gen_own_selection", scope: !3, file: !3, line: 110, type: !978, isLocal: true, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !980)
!978 = !DISubroutineType(types: !979)
!979 = !{!154, !190}
!980 = !{!976}
!981 = !DILocation(line: 110, column: 37, scope: !977, inlinedAt: !982)
!982 = distinct !DILocation(line: 138, column: 16, scope: !967)
!983 = !DILocation(line: 114, column: 13, scope: !984, inlinedAt: !982)
!984 = distinct !DILexicalBlock(scope: !977, file: !3, line: 114, column: 9)
!985 = !DILocation(line: 114, column: 9, scope: !984, inlinedAt: !982)
!986 = !DILocation(line: 114, column: 9, scope: !977, inlinedAt: !982)
!987 = !DILocation(line: 115, column: 9, scope: !984, inlinedAt: !982)
!988 = !DILocation(line: 115, column: 2, scope: !984, inlinedAt: !982)
!989 = !DILocation(line: 118, column: 9, scope: !984, inlinedAt: !982)
!990 = !DILocation(line: 118, column: 2, scope: !984, inlinedAt: !982)
!991 = !DILocation(line: 138, column: 44, scope: !967)
!992 = !DILocation(line: 138, column: 13, scope: !967)
!993 = !DILocation(line: 139, column: 7, scope: !994)
!994 = distinct !DILexicalBlock(scope: !967, file: !3, line: 139, column: 6)
!995 = !DILocation(line: 139, column: 17, scope: !994)
!996 = !DILocation(line: 139, column: 25, scope: !994)
!997 = !DILocation(line: 139, column: 46, scope: !994)
!998 = !DILocation(line: 139, column: 39, scope: !994)
!999 = !DILocation(line: 145, column: 11, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 144, column: 10)
!1001 = distinct !DILexicalBlock(scope: !994, file: !3, line: 140, column: 2)
!1002 = !DILocation(line: 145, column: 28, scope: !1000)
!1003 = !DILocation(line: 146, column: 10, scope: !1000)
!1004 = !DILocation(line: 146, column: 13, scope: !1000)
!1005 = !DILocation(line: 146, column: 30, scope: !1000)
!1006 = !DILocation(line: 147, column: 7, scope: !1000)
!1007 = !DILocation(line: 149, column: 7, scope: !1000)
!1008 = !DILocation(line: 318, column: 6, scope: !1009, inlinedAt: !1013)
!1009 = distinct !DISubprogram(name: "clip_isautosel_star", scope: !3, file: !3, line: 314, type: !1010, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1012)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!154}
!1012 = !{}
!1013 = distinct !DILocation(line: 147, column: 31, scope: !1000)
!1014 = !DILocation(line: 318, column: 31, scope: !1009, inlinedAt: !1013)
!1015 = !DILocation(line: 318, column: 20, scope: !1009, inlinedAt: !1013)
!1016 = !DILocation(line: 318, column: 46, scope: !1009, inlinedAt: !1013)
!1017 = !DILocation(line: 320, column: 6, scope: !1009, inlinedAt: !1013)
!1018 = !DILocation(line: 147, column: 31, scope: !1000)
!1019 = !DILocation(line: 147, column: 11, scope: !1000)
!1020 = !DILocation(line: 332, column: 6, scope: !1021, inlinedAt: !1022)
!1021 = distinct !DISubprogram(name: "clip_isautosel_plus", scope: !3, file: !3, line: 328, type: !1010, isLocal: false, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1012)
!1022 = distinct !DILocation(line: 148, column: 15, scope: !1000)
!1023 = !DILocation(line: 332, column: 31, scope: !1021, inlinedAt: !1022)
!1024 = !DILocation(line: 332, column: 20, scope: !1021, inlinedAt: !1022)
!1025 = !DILocation(line: 332, column: 50, scope: !1021, inlinedAt: !1022)
!1026 = !DILocation(line: 334, column: 6, scope: !1021, inlinedAt: !1022)
!1027 = !DILocation(line: 148, column: 15, scope: !1000)
!1028 = !DILocation(line: 149, column: 10, scope: !1000)
!1029 = !DILocation(line: 149, column: 28, scope: !1000)
!1030 = !DILocation(line: 149, column: 25, scope: !1000)
!1031 = !DILocation(line: 144, column: 10, scope: !1001)
!1032 = !DILocation(line: 150, column: 3, scope: !1000)
!1033 = !DILocation(line: 158, column: 1, scope: !963)
!1034 = !DILocation(line: 1184, column: 37, scope: !888)
!1035 = !DILocation(line: 1186, column: 9, scope: !888)
!1036 = !DILocation(line: 1190, column: 11, scope: !894)
!1037 = !DILocation(line: 1190, column: 25, scope: !894)
!1038 = !DILocation(line: 1190, column: 29, scope: !894)
!1039 = !DILocation(line: 1190, column: 48, scope: !894)
!1040 = !DILocation(line: 1191, column: 3, scope: !894)
!1041 = !DILocation(line: 1191, column: 11, scope: !894)
!1042 = !DILocation(line: 1191, column: 25, scope: !894)
!1043 = !DILocation(line: 1191, column: 29, scope: !894)
!1044 = !DILocation(line: 1191, column: 48, scope: !894)
!1045 = !DILocation(line: 1190, column: 6, scope: !895)
!1046 = !DILocation(line: 1194, column: 6, scope: !907)
!1047 = !DILocation(line: 1199, column: 13, scope: !909)
!1048 = !DILocation(line: 1199, column: 9, scope: !909)
!1049 = !DILocation(line: 1199, column: 9, scope: !888)
!1050 = !DILocation(line: 1200, column: 2, scope: !909)
!1051 = !DILocation(line: 1203, column: 2, scope: !909)
!1052 = !DILocation(line: 1207, column: 1, scope: !888)
!1053 = !DILocation(line: 318, column: 10, scope: !1009)
!1054 = !DILocation(line: 318, column: 6, scope: !1009)
!1055 = !DILocation(line: 318, column: 31, scope: !1009)
!1056 = !DILocation(line: 318, column: 20, scope: !1009)
!1057 = !DILocation(line: 318, column: 46, scope: !1009)
!1058 = !DILocation(line: 320, column: 6, scope: !1009)
!1059 = !DILocation(line: 316, column: 5, scope: !1009)
!1060 = !DILocation(line: 332, column: 10, scope: !1021)
!1061 = !DILocation(line: 332, column: 6, scope: !1021)
!1062 = !DILocation(line: 332, column: 31, scope: !1021)
!1063 = !DILocation(line: 332, column: 20, scope: !1021)
!1064 = !DILocation(line: 332, column: 50, scope: !1021)
!1065 = !DILocation(line: 334, column: 6, scope: !1021)
!1066 = !DILocation(line: 330, column: 5, scope: !1021)
!1067 = distinct !DISubprogram(name: "clip_lose_selection", scope: !3, file: !3, line: 176, type: !796, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1068)
!1068 = !{!1069, !1070, !1071}
!1069 = !DILocalVariable(name: "cbd", arg: 1, scope: !1067, file: !3, line: 176, type: !190)
!1070 = !DILocalVariable(name: "was_owned", scope: !1067, file: !3, line: 179, type: !154)
!1071 = !DILocalVariable(name: "visual_selection", scope: !1067, file: !3, line: 181, type: !154)
!1072 = !DILocation(line: 176, column: 34, scope: !1067)
!1073 = !DILocation(line: 179, column: 30, scope: !1067)
!1074 = !DILocation(line: 179, column: 13, scope: !1067)
!1075 = !DILocation(line: 181, column: 13, scope: !1067)
!1076 = !DILocation(line: 183, column: 13, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 183, column: 9)
!1078 = !DILocation(line: 183, column: 34, scope: !1077)
!1079 = !DILocation(line: 183, column: 27, scope: !1077)
!1080 = !DILocation(line: 186, column: 5, scope: !1067)
!1081 = !DILocation(line: 187, column: 16, scope: !1067)
!1082 = !DILocation(line: 188, column: 9, scope: !1067)
!1083 = !DILocation(line: 929, column: 35, scope: !863, inlinedAt: !1084)
!1084 = distinct !DILocation(line: 189, column: 2, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 188, column: 9)
!1086 = !DILocation(line: 932, column: 14, scope: !869, inlinedAt: !1084)
!1087 = !DILocation(line: 932, column: 20, scope: !869, inlinedAt: !1084)
!1088 = !DILocation(line: 932, column: 9, scope: !863, inlinedAt: !1084)
!1089 = !DILocation(line: 935, column: 43, scope: !863, inlinedAt: !1084)
!1090 = !DILocation(line: 935, column: 27, scope: !863, inlinedAt: !1084)
!1091 = !DILocation(line: 935, column: 60, scope: !863, inlinedAt: !1084)
!1092 = !DILocation(line: 936, column: 20, scope: !863, inlinedAt: !1084)
!1093 = !DILocation(line: 936, column: 6, scope: !863, inlinedAt: !1084)
!1094 = !DILocation(line: 936, column: 35, scope: !863, inlinedAt: !1084)
!1095 = !DILocation(line: 935, column: 5, scope: !863, inlinedAt: !1084)
!1096 = !DILocation(line: 937, column: 16, scope: !863, inlinedAt: !1084)
!1097 = !DILocation(line: 938, column: 1, scope: !863, inlinedAt: !1084)
!1098 = !DILocalVariable(name: "cbd", arg: 1, scope: !1099, file: !3, line: 161, type: !190)
!1099 = distinct !DISubprogram(name: "clip_gen_lose_selection", scope: !3, file: !3, line: 161, type: !796, isLocal: true, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1100)
!1100 = !{!1098}
!1101 = !DILocation(line: 161, column: 38, scope: !1099, inlinedAt: !1102)
!1102 = distinct !DILocation(line: 190, column: 5, scope: !1067)
!1103 = !DILocation(line: 165, column: 13, scope: !1104, inlinedAt: !1102)
!1104 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 165, column: 9)
!1105 = !DILocation(line: 165, column: 9, scope: !1104, inlinedAt: !1102)
!1106 = !DILocation(line: 165, column: 9, scope: !1099, inlinedAt: !1102)
!1107 = !DILocation(line: 166, column: 2, scope: !1104, inlinedAt: !1102)
!1108 = !DILocation(line: 169, column: 2, scope: !1104, inlinedAt: !1102)
!1109 = !DILocation(line: 197, column: 6, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 197, column: 6)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 193, column: 5)
!1112 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 192, column: 9)
!1113 = !DILocation(line: 192, column: 9, scope: !1067)
!1114 = !DILocation(line: 198, column: 7, scope: !1110)
!1115 = !DILocation(line: 198, column: 24, scope: !1110)
