; ModuleID = 'dict.c'
source_filename = "dict.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.dictvar_S = type { i8, i8, i32, i32, %struct.hashtable_S, %struct.type_S*, %struct.dictvar_S*, %struct.dictvar_S*, %struct.dictvar_S* }
%struct.hashtable_S = type { i64, i64, i64, i32, i32, i32, %struct.hashitem_S*, [16 x %struct.hashitem_S] }
%struct.hashitem_S = type { i64, i8* }
%struct.type_S = type { i32, i8, i8, i8, %struct.type_S*, %struct.type_S** }
%struct.typval_T = type { i32, i8, %union.anon }
%union.anon = type { i64 }
%struct.dictitem_S = type { %struct.typval_T, i8, [1 x i8] }
%struct.listvar_S = type { %struct.listitem_S*, %struct.listwatch_S*, %union.anon.0, %struct.type_S*, %struct.listvar_S*, %struct.listvar_S*, %struct.listvar_S*, i32, i32, i32, i32, i8 }
%struct.listitem_S = type { %struct.listitem_S*, %struct.listitem_S*, %struct.typval_T }
%struct.listwatch_S = type { %struct.listitem_S*, %struct.listwatch_S* }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { i64, i64, i32 }
%struct.callback_T = type { i8*, %struct.partial_S*, i32 }
%struct.partial_S = type { i32, i8*, %struct.ufunc_T*, i32, %struct.outer_S, %struct.funcstack_S*, i32, %struct.typval_T*, %struct.dictvar_S*, i32 }

!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!26 = !DIEnumerator(name: "aid_none", value: 0)
!27 = !DIEnumerator(name: "aid_qf_dirname_start", value: 1)
!28 = !DIEnumerator(name: "aid_qf_dirname_now", value: 2)
!29 = !DIEnumerator(name: "aid_qf_namebuf", value: 3)
!30 = !DIEnumerator(name: "aid_qf_module", value: 4)
!31 = !DIEnumerator(name: "aid_qf_errmsg", value: 5)
!32 = !DIEnumerator(name: "aid_qf_pattern", value: 6)
!33 = !DIEnumerator(name: "aid_tagstack_items", value: 7)
!34 = !DIEnumerator(name: "aid_tagstack_from", value: 8)
!35 = !DIEnumerator(name: "aid_tagstack_details", value: 9)
!36 = !DIEnumerator(name: "aid_sign_getdefined", value: 10)
!37 = !DIEnumerator(name: "aid_sign_getplaced", value: 11)
!38 = !DIEnumerator(name: "aid_sign_define_by_name", value: 12)
!39 = !DIEnumerator(name: "aid_sign_getlist", value: 13)
!40 = !DIEnumerator(name: "aid_sign_getplaced_dict", value: 14)
!41 = !DIEnumerator(name: "aid_sign_getplaced_list", value: 15)
!42 = !DIEnumerator(name: "aid_insert_sign", value: 16)
!43 = !DIEnumerator(name: "aid_sign_getinfo", value: 17)
!44 = !DIEnumerator(name: "aid_last", value: 18)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1585, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51}
!47 = !DIEnumerator(name: "UF_NOT_COMPILED", value: 0)
!48 = !DIEnumerator(name: "UF_TO_BE_COMPILED", value: 1)
!49 = !DIEnumerator(name: "UF_COMPILING", value: 2)
!50 = !DIEnumerator(name: "UF_COMPILED", value: 3)
!51 = !DIEnumerator(name: "UF_COMPILE_ERROR", value: 4)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2061, size: 32, elements: !53)
!53 = !{!54, !55, !56, !57}
!54 = !DIEnumerator(name: "JOB_FAILED", value: 0)
!55 = !DIEnumerator(name: "JOB_STARTED", value: 1)
!56 = !DIEnumerator(name: "JOB_ENDED", value: 2)
!57 = !DIEnumerator(name: "JOB_FINISHED", value: 3)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2517, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIEnumerator(name: "POPPOS_BOTLEFT", value: 0)
!61 = !DIEnumerator(name: "POPPOS_TOPLEFT", value: 1)
!62 = !DIEnumerator(name: "POPPOS_BOTRIGHT", value: 2)
!63 = !DIEnumerator(name: "POPPOS_TOPRIGHT", value: 3)
!64 = !DIEnumerator(name: "POPPOS_CENTER", value: 4)
!65 = !DIEnumerator(name: "POPPOS_NONE", value: 5)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2526, size: 32, elements: !67)
!67 = !{!68, !69, !70}
!68 = !DIEnumerator(name: "POPCLOSE_NONE", value: 0)
!69 = !DIEnumerator(name: "POPCLOSE_BUTTON", value: 1)
!70 = !DIEnumerator(name: "POPCLOSE_CLICK", value: 2)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 55, size: 32, elements: !73)
!72 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkvisual.h", directory: "/home/sahil/vim/src")
!73 = !{!74, !75, !76, !77, !78, !79}
!74 = !DIEnumerator(name: "GDK_VISUAL_STATIC_GRAY", value: 0)
!75 = !DIEnumerator(name: "GDK_VISUAL_GRAYSCALE", value: 1)
!76 = !DIEnumerator(name: "GDK_VISUAL_STATIC_COLOR", value: 2)
!77 = !DIEnumerator(name: "GDK_VISUAL_PSEUDO_COLOR", value: 3)
!78 = !DIEnumerator(name: "GDK_VISUAL_TRUE_COLOR", value: 4)
!79 = !DIEnumerator(name: "GDK_VISUAL_DIRECT_COLOR", value: 5)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 118, size: 32, elements: !82)
!81 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdktypes.h", directory: "/home/sahil/vim/src")
!82 = !{!83, !84}
!83 = !DIEnumerator(name: "GDK_LSB_FIRST", value: 0)
!84 = !DIEnumerator(name: "GDK_MSB_FIRST", value: 1)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 43, size: 32, elements: !87)
!86 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkfont.h", directory: "/home/sahil/vim/src")
!87 = !{!88, !89}
!88 = !DIEnumerator(name: "GDK_FONT_FONT", value: 0)
!89 = !DIEnumerator(name: "GDK_FONT_FONTSET", value: 1)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !91, line: 52, size: 32, elements: !92)
!91 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkrc.h", directory: "/home/sahil/vim/src")
!92 = !{!93, !94, !95, !96}
!93 = !DIEnumerator(name: "GTK_RC_FG", value: 1)
!94 = !DIEnumerator(name: "GTK_RC_BG", value: 2)
!95 = !DIEnumerator(name: "GTK_RC_TEXT", value: 4)
!96 = !DIEnumerator(name: "GTK_RC_BASE", value: 8)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2140, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102}
!99 = !DIEnumerator(name: "MODE_NL", value: 0)
!100 = !DIEnumerator(name: "MODE_RAW", value: 1)
!101 = !DIEnumerator(name: "MODE_JSON", value: 2)
!102 = !DIEnumerator(name: "MODE_JS", value: 3)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2148, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108, !109}
!105 = !DIEnumerator(name: "JIO_PIPE", value: 0)
!106 = !DIEnumerator(name: "JIO_NULL", value: 1)
!107 = !DIEnumerator(name: "JIO_FILE", value: 2)
!108 = !DIEnumerator(name: "JIO_BUFFER", value: 3)
!109 = !DIEnumerator(name: "JIO_OUT", value: 4)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1572, size: 32, elements: !111)
!111 = !{!112, !113, !114, !115}
!112 = !DIEnumerator(name: "GETLINE_NONE", value: 0)
!113 = !DIEnumerator(name: "GETLINE_CONCAT_CONT", value: 1)
!114 = !DIEnumerator(name: "GETLINE_CONCAT_CONTBAR", value: 2)
!115 = !DIEnumerator(name: "GETLINE_CONCAT_ALL", value: 3)
!116 = !{!117, !172, !125, !173, !1763, !147, !289, !448}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !6, line: 1347, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !6, line: 1545, size: 2816, elements: !120)
!120 = !{!121, !123, !124, !126, !127, !154, !169, !170, !171}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !119, file: !6, line: 1547, baseType: !122, size: 8)
!122 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !119, file: !6, line: 1548, baseType: !122, size: 8, offset: 8)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !119, file: !6, line: 1549, baseType: !125, size: 32, offset: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !119, file: !6, line: 1550, baseType: !125, size: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !119, file: !6, line: 1551, baseType: !128, size: 2432, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !6, line: 1290, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !6, line: 1277, size: 2432, elements: !130)
!130 = !{!131, !135, !136, !137, !138, !139, !140, !150}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !129, file: !6, line: 1279, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !133, line: 345, baseType: !134)
!133 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!134 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !129, file: !6, line: 1281, baseType: !132, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !129, file: !6, line: 1282, baseType: !132, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !129, file: !6, line: 1283, baseType: !125, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !129, file: !6, line: 1284, baseType: !125, size: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !129, file: !6, line: 1285, baseType: !125, size: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !129, file: !6, line: 1287, baseType: !141, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !6, line: 1265, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !6, line: 1261, size: 128, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !143, file: !6, line: 1263, baseType: !132, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !143, file: !6, line: 1264, baseType: !147, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !133, line: 324, baseType: !149)
!149 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !129, file: !6, line: 1289, baseType: !151, size: 2048, offset: 384)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 2048, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 16)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !119, file: !6, line: 1552, baseType: !155, size: 64, offset: 2560)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !6, line: 1394, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !6, line: 1395, size: 192, elements: !158)
!158 = !{!159, !161, !164, !165, !166, !167}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !157, file: !6, line: 1396, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !6, line: 1391, baseType: !5)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !157, file: !6, line: 1397, baseType: !162, size: 8, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !6, line: 1342, baseType: !163)
!163 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !157, file: !6, line: 1398, baseType: !122, size: 8, offset: 40)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !157, file: !6, line: 1399, baseType: !122, size: 8, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !157, file: !6, line: 1400, baseType: !155, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !157, file: !6, line: 1401, baseType: !168, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !119, file: !6, line: 1553, baseType: !117, size: 64, offset: 2624)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !119, file: !6, line: 1554, baseType: !117, size: 64, offset: 2688)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !119, file: !6, line: 1555, baseType: !117, size: 64, offset: 2752)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !6, line: 1519, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !6, line: 1513, size: 192, elements: !176)
!176 = !{!177, !1794, !1795}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !175, file: !6, line: 1515, baseType: !178, size: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !6, line: 1432, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1412, size: 128, elements: !180)
!180 = !{!181, !182, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !179, file: !6, line: 1414, baseType: !160, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !179, file: !6, line: 1415, baseType: !122, size: 8, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !179, file: !6, line: 1431, baseType: !184, size: 64, offset: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !179, file: !6, line: 1416, size: 64, elements: !185)
!185 = !{!186, !189, !192, !193, !237, !238, !381, !1785, !1786}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !184, file: !6, line: 1418, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !6, line: 1327, baseType: !188)
!188 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !184, file: !6, line: 1420, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !6, line: 1344, baseType: !191)
!191 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !184, file: !6, line: 1422, baseType: !147, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !184, file: !6, line: 1423, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !6, line: 1346, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !6, line: 1471, size: 768, elements: !197)
!197 = !{!198, !206, !213, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !196, file: !6, line: 1473, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !6, line: 1446, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !6, line: 1448, size: 256, elements: !202)
!202 = !{!203, !204, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !201, file: !6, line: 1450, baseType: !199, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !201, file: !6, line: 1451, baseType: !199, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !201, file: !6, line: 1452, baseType: !178, size: 128, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !196, file: !6, line: 1474, baseType: !207, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !6, line: 1456, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !6, line: 1458, size: 128, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !209, file: !6, line: 1460, baseType: !199, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !209, file: !6, line: 1461, baseType: !207, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !196, file: !6, line: 1487, baseType: !214, size: 192, offset: 128)
!214 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !196, file: !6, line: 1475, size: 192, elements: !215)
!215 = !{!216, !222}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !214, file: !6, line: 1481, baseType: !217, size: 192)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !6, line: 1476, size: 192, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !217, file: !6, line: 1478, baseType: !187, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !217, file: !6, line: 1479, baseType: !187, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !217, file: !6, line: 1480, baseType: !125, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !214, file: !6, line: 1486, baseType: !223, size: 192)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !6, line: 1482, size: 192, elements: !224)
!224 = !{!225, !226, !227}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !223, file: !6, line: 1483, baseType: !199, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !223, file: !6, line: 1484, baseType: !199, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !223, file: !6, line: 1485, baseType: !125, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !196, file: !6, line: 1488, baseType: !155, size: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !196, file: !6, line: 1489, baseType: !194, size: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !196, file: !6, line: 1490, baseType: !194, size: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !196, file: !6, line: 1491, baseType: !194, size: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !196, file: !6, line: 1492, baseType: !125, size: 32, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !196, file: !6, line: 1493, baseType: !125, size: 32, offset: 608)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !196, file: !6, line: 1494, baseType: !125, size: 32, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !196, file: !6, line: 1496, baseType: !125, size: 32, offset: 672)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !196, file: !6, line: 1497, baseType: !122, size: 8, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !184, file: !6, line: 1424, baseType: !117, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !184, file: !6, line: 1425, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !6, line: 1348, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !6, line: 1994, size: 832, elements: !242)
!242 = !{!243, !244, !245, !356, !357, !367, !377, !378, !379, !380}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !241, file: !6, line: 1996, baseType: !125, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !241, file: !6, line: 1997, baseType: !147, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !241, file: !6, line: 1999, baseType: !246, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !6, line: 1658, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1597, size: 3072, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !256, !257, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !277, !278, !279, !280, !281, !292, !293, !294, !295, !297, !298, !299, !300, !301, !302, !303, !313, !314, !315, !351, !352}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !248, file: !6, line: 1599, baseType: !125, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !248, file: !6, line: 1600, baseType: !125, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !248, file: !6, line: 1601, baseType: !125, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !248, file: !6, line: 1602, baseType: !125, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !248, file: !6, line: 1603, baseType: !255, size: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !6, line: 1591, baseType: !45)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !248, file: !6, line: 1604, baseType: !125, size: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !248, file: !6, line: 1605, baseType: !258, size: 192, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !6, line: 55, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !6, line: 48, size: 192, elements: !260)
!260 = !{!261, !262, !263, !264, !265}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !259, file: !6, line: 50, baseType: !125, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !259, file: !6, line: 51, baseType: !125, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !259, file: !6, line: 52, baseType: !125, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !259, file: !6, line: 53, baseType: !125, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !259, file: !6, line: 54, baseType: !172, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !248, file: !6, line: 1606, baseType: !258, size: 192, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !248, file: !6, line: 1609, baseType: !168, size: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !248, file: !6, line: 1610, baseType: !155, size: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !248, file: !6, line: 1611, baseType: !258, size: 192, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !248, file: !6, line: 1612, baseType: !239, size: 64, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !248, file: !6, line: 1615, baseType: !147, size: 64, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !248, file: !6, line: 1616, baseType: !155, size: 64, offset: 1024)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !248, file: !6, line: 1617, baseType: !155, size: 64, offset: 1088)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !248, file: !6, line: 1618, baseType: !125, size: 32, offset: 1152)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !248, file: !6, line: 1619, baseType: !276, size: 64, offset: 1216)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !248, file: !6, line: 1626, baseType: !258, size: 192, offset: 1280)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !248, file: !6, line: 1628, baseType: !125, size: 32, offset: 1472)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !248, file: !6, line: 1629, baseType: !125, size: 32, offset: 1504)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !248, file: !6, line: 1631, baseType: !125, size: 32, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !248, file: !6, line: 1632, baseType: !282, size: 128, offset: 1600)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !133, line: 1786, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !284, line: 8, size: 128, elements: !285)
!284 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!285 = !{!286, !290}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !283, file: !284, line: 10, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !288, line: 160, baseType: !289)
!288 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!289 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !283, file: !284, line: 11, baseType: !291, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !288, line: 162, baseType: !289)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !248, file: !6, line: 1633, baseType: !282, size: 128, offset: 1728)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !248, file: !6, line: 1634, baseType: !282, size: 128, offset: 1856)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !248, file: !6, line: 1636, baseType: !276, size: 64, offset: 1984)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !248, file: !6, line: 1637, baseType: !296, size: 64, offset: 2048)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !248, file: !6, line: 1638, baseType: !296, size: 64, offset: 2112)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !248, file: !6, line: 1639, baseType: !282, size: 128, offset: 2176)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !248, file: !6, line: 1640, baseType: !282, size: 128, offset: 2304)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !248, file: !6, line: 1641, baseType: !282, size: 128, offset: 2432)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !248, file: !6, line: 1642, baseType: !125, size: 32, offset: 2560)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !248, file: !6, line: 1643, baseType: !125, size: 32, offset: 2592)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !248, file: !6, line: 1645, baseType: !304, size: 192, offset: 2624)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !6, line: 92, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 85, size: 192, elements: !306)
!306 = !{!307, !309, !310, !312}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !305, file: !6, line: 87, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !6, line: 62, baseType: !125)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !305, file: !6, line: 88, baseType: !125, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !305, file: !6, line: 89, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !133, line: 1687, baseType: !289)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !305, file: !6, line: 91, baseType: !125, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !248, file: !6, line: 1648, baseType: !125, size: 32, offset: 2816)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !248, file: !6, line: 1649, baseType: !125, size: 32, offset: 2848)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !248, file: !6, line: 1651, baseType: !316, size: 64, offset: 2880)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !6, line: 1582, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !6, line: 1682, size: 17280, elements: !319)
!319 = !{!320, !321, !322, !323, !334, !335, !336, !337, !338, !339, !341, !343, !344, !345, !346, !347, !348, !349, !350}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !318, file: !6, line: 1684, baseType: !246, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !318, file: !6, line: 1685, baseType: !125, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !318, file: !6, line: 1686, baseType: !125, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !318, file: !6, line: 1691, baseType: !324, size: 4608, offset: 128)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 4608, elements: !332)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !6, line: 1687, size: 384, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !325, file: !6, line: 1689, baseType: !174, size: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "room", scope: !325, file: !6, line: 1690, baseType: !329, size: 160, offset: 192)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 160, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 20)
!332 = !{!333}
!333 = !DISubrange(count: 12)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars", scope: !318, file: !6, line: 1692, baseType: !118, size: 2816, offset: 4736)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars_var", scope: !318, file: !6, line: 1693, baseType: !174, size: 192, offset: 7552)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars", scope: !318, file: !6, line: 1694, baseType: !118, size: 2816, offset: 7744)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars_var", scope: !318, file: !6, line: 1695, baseType: !174, size: 192, offset: 10560)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "l_varlist", scope: !318, file: !6, line: 1696, baseType: !195, size: 768, offset: 10752)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "l_listitems", scope: !318, file: !6, line: 1697, baseType: !340, size: 5120, offset: 11520)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 5120, elements: !330)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "rettv", scope: !318, file: !6, line: 1698, baseType: !342, size: 64, offset: 16640)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !318, file: !6, line: 1699, baseType: !311, size: 64, offset: 16704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dbg_tick", scope: !318, file: !6, line: 1700, baseType: !125, size: 32, offset: 16768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !318, file: !6, line: 1701, baseType: !125, size: 32, offset: 16800)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prof_child", scope: !318, file: !6, line: 1703, baseType: !282, size: 128, offset: 16832)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !318, file: !6, line: 1705, baseType: !316, size: 64, offset: 16960)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fc_refcount", scope: !318, file: !6, line: 1709, baseType: !125, size: 32, offset: 17024)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fc_copyID", scope: !318, file: !6, line: 1711, baseType: !125, size: 32, offset: 17056)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fc_funcs", scope: !318, file: !6, line: 1712, baseType: !258, size: 192, offset: 17088)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name_exp", scope: !248, file: !6, line: 1653, baseType: !147, size: 64, offset: 2944)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name", scope: !248, file: !6, line: 1655, baseType: !353, size: 32, offset: 3008)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 32, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 4)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pt_auto", scope: !241, file: !6, line: 2001, baseType: !125, size: 32, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pt_outer", scope: !241, file: !6, line: 2005, baseType: !358, size: 256, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "outer_T", file: !6, line: 1986, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_S", file: !6, line: 1987, size: 256, elements: !360)
!360 = !{!361, !363, !364, !366}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "out_stack", scope: !359, file: !6, line: 1988, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame_idx", scope: !359, file: !6, line: 1989, baseType: !125, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "out_up", scope: !359, file: !6, line: 1990, baseType: !365, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "out_up_is_copy", scope: !359, file: !6, line: 1991, baseType: !125, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pt_funcstack", scope: !241, file: !6, line: 2007, baseType: !368, size: 64, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "funcstack_T", file: !6, line: 1984, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcstack_S", file: !6, line: 1972, size: 320, elements: !371)
!371 = !{!372, !373, !374, !375, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ga", scope: !370, file: !6, line: 1974, baseType: !258, size: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fs_var_offset", scope: !370, file: !6, line: 1978, baseType: !125, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fs_refcount", scope: !370, file: !6, line: 1981, baseType: !125, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fs_min_refcount", scope: !370, file: !6, line: 1982, baseType: !125, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fs_copyID", scope: !370, file: !6, line: 1983, baseType: !125, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argc", scope: !241, file: !6, line: 2010, baseType: !125, size: 32, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argv", scope: !241, file: !6, line: 2011, baseType: !342, size: 64, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pt_dict", scope: !241, file: !6, line: 2013, baseType: !117, size: 64, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pt_copyID", scope: !241, file: !6, line: 2014, baseType: !125, size: 32, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !184, file: !6, line: 1427, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !6, line: 1365, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !6, line: 2072, size: 1024, elements: !385)
!385 = !{!386, !387, !388, !392, !393, !394, !396, !397, !398, !399, !406, !1682, !1683, !1684, !1783}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !384, file: !6, line: 2074, baseType: !382, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !384, file: !6, line: 2075, baseType: !382, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !384, file: !6, line: 2077, baseType: !389, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !390, line: 97, baseType: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !288, line: 154, baseType: !125)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !384, file: !6, line: 2083, baseType: !147, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !384, file: !6, line: 2084, baseType: !147, size: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !384, file: !6, line: 2085, baseType: !395, size: 32, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !6, line: 2067, baseType: !52)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !384, file: !6, line: 2086, baseType: !147, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !384, file: !6, line: 2088, baseType: !147, size: 64, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !384, file: !6, line: 2093, baseType: !125, size: 32, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !384, file: !6, line: 2094, baseType: !400, size: 192, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !6, line: 1360, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1356, size: 192, elements: !402)
!402 = !{!403, !404, !405}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !401, file: !6, line: 1357, baseType: !147, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !401, file: !6, line: 1358, baseType: !239, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !401, file: !6, line: 1359, baseType: !125, size: 32, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !384, file: !6, line: 2096, baseType: !407, size: 64, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !6, line: 63, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !6, line: 2629, size: 73152, elements: !410)
!410 = !{!411, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !520, !523, !524, !528, !529, !539, !540, !541, !542, !543, !544, !545, !546, !1352, !1353, !1354, !1359, !1360, !1361, !1365, !1373, !1374, !1375, !1376, !1377, !1379, !1380, !1381, !1382, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1626, !1627, !1628, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1665, !1666, !1667, !1668, !1669, !1676, !1677, !1681}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !409, file: !6, line: 2631, baseType: !412, size: 832)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !6, line: 766, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !6, line: 737, size: 832, elements: !414)
!414 = !{!415, !416, !478, !487, !488, !489, !490, !492, !493, !494, !495, !496, !497, !498, !505, !506}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !413, file: !6, line: 739, baseType: !311, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !413, file: !6, line: 741, baseType: !417, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !6, line: 459, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !6, line: 671, size: 9856, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !445, !446, !447, !449, !450, !463, !464, !465, !466, !467, !468, !469, !470, !471, !475, !476, !477}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !419, file: !6, line: 673, baseType: !147, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !419, file: !6, line: 674, baseType: !147, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !419, file: !6, line: 675, baseType: !125, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !419, file: !6, line: 676, baseType: !125, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !419, file: !6, line: 677, baseType: !125, size: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !419, file: !6, line: 678, baseType: !427, size: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !6, line: 458, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !6, line: 506, size: 448, elements: !430)
!430 = !{!431, !440, !441, !442, !443, !444}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !429, file: !6, line: 508, baseType: !432, size: 192)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !6, line: 469, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !6, line: 471, size: 192, elements: !434)
!434 = !{!435, !437, !438}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !433, file: !6, line: 473, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !433, file: !6, line: 474, baseType: !436, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !433, file: !6, line: 475, baseType: !439, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !6, line: 460, baseType: !289)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !429, file: !6, line: 511, baseType: !427, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !429, file: !6, line: 512, baseType: !427, size: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !429, file: !6, line: 513, baseType: !147, size: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !429, file: !6, line: 514, baseType: !125, size: 32, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !429, file: !6, line: 518, baseType: !122, size: 8, offset: 416)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !419, file: !6, line: 679, baseType: !427, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !419, file: !6, line: 680, baseType: !427, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !419, file: !6, line: 681, baseType: !448, size: 32, offset: 448)
!448 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !419, file: !6, line: 682, baseType: !448, size: 32, offset: 480)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !419, file: !6, line: 683, baseType: !451, size: 4352, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !6, line: 489, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !6, line: 480, size: 4352, elements: !453)
!453 = !{!454, !455, !456, !458, !462}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !452, file: !6, line: 482, baseType: !132, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !452, file: !6, line: 484, baseType: !132, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !452, file: !6, line: 485, baseType: !457, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !452, file: !6, line: 487, baseType: !459, size: 4096, offset: 192)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 4096, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !452, file: !6, line: 488, baseType: !122, size: 8, offset: 4288)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !419, file: !6, line: 684, baseType: !451, size: 4352, offset: 4864)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !419, file: !6, line: 685, baseType: !439, size: 64, offset: 9216)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !419, file: !6, line: 686, baseType: !439, size: 64, offset: 9280)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !419, file: !6, line: 687, baseType: !439, size: 64, offset: 9344)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !419, file: !6, line: 688, baseType: !439, size: 64, offset: 9408)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !419, file: !6, line: 689, baseType: !448, size: 32, offset: 9472)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !419, file: !6, line: 690, baseType: !125, size: 32, offset: 9504)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !419, file: !6, line: 692, baseType: !407, size: 64, offset: 9536)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !419, file: !6, line: 693, baseType: !472, size: 64, offset: 9600)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 64, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 8)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !419, file: !6, line: 697, baseType: !147, size: 64, offset: 9664)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !419, file: !6, line: 698, baseType: !125, size: 32, offset: 9728)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !419, file: !6, line: 699, baseType: !472, size: 64, offset: 9760)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !413, file: !6, line: 743, baseType: !479, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !6, line: 717, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !6, line: 711, size: 256, elements: !482)
!482 = !{!483, !484, !485, !486}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !481, file: !6, line: 713, baseType: !439, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !481, file: !6, line: 714, baseType: !311, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !481, file: !6, line: 715, baseType: !311, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !481, file: !6, line: 716, baseType: !125, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !413, file: !6, line: 744, baseType: !125, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !413, file: !6, line: 745, baseType: !125, size: 32, offset: 224)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !413, file: !6, line: 751, baseType: !125, size: 32, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !413, file: !6, line: 753, baseType: !491, size: 32, offset: 288)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !133, line: 1688, baseType: !125)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !413, file: !6, line: 754, baseType: !311, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !413, file: !6, line: 755, baseType: !147, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !413, file: !6, line: 757, baseType: !427, size: 64, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !413, file: !6, line: 758, baseType: !311, size: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !413, file: !6, line: 759, baseType: !311, size: 64, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !413, file: !6, line: 760, baseType: !125, size: 32, offset: 640)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !413, file: !6, line: 762, baseType: !499, size: 64, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !6, line: 724, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !6, line: 720, size: 128, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !501, file: !6, line: 722, baseType: !125, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !501, file: !6, line: 723, baseType: !289, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !413, file: !6, line: 763, baseType: !125, size: 32, offset: 768)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !413, file: !6, line: 764, baseType: !125, size: 32, offset: 800)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !409, file: !6, line: 2634, baseType: !407, size: 64, offset: 832)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !409, file: !6, line: 2635, baseType: !407, size: 64, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !409, file: !6, line: 2637, baseType: !125, size: 32, offset: 960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !409, file: !6, line: 2639, baseType: !125, size: 32, offset: 992)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !409, file: !6, line: 2640, baseType: !125, size: 32, offset: 1024)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !409, file: !6, line: 2642, baseType: !125, size: 32, offset: 1056)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !409, file: !6, line: 2651, baseType: !147, size: 64, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !409, file: !6, line: 2652, baseType: !147, size: 64, offset: 1152)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !409, file: !6, line: 2654, baseType: !147, size: 64, offset: 1216)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !409, file: !6, line: 2658, baseType: !125, size: 32, offset: 1280)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !409, file: !6, line: 2659, baseType: !518, size: 64, offset: 1344)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !390, line: 59, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !288, line: 145, baseType: !134)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !409, file: !6, line: 2660, baseType: !521, size: 64, offset: 1408)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !390, line: 47, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !288, line: 148, baseType: !134)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !409, file: !6, line: 2667, baseType: !125, size: 32, offset: 1472)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !409, file: !6, line: 2668, baseType: !525, size: 72, offset: 1504)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 72, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 9)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !409, file: !6, line: 2672, baseType: !125, size: 32, offset: 1600)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !409, file: !6, line: 2674, baseType: !530, size: 320, offset: 1664)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !6, line: 1532, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !6, line: 1526, size: 320, elements: !532)
!532 = !{!533, !534, !535}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !531, file: !6, line: 1528, baseType: !178, size: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !531, file: !6, line: 1529, baseType: !148, size: 8, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !531, file: !6, line: 1530, baseType: !536, size: 136, offset: 136)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 136, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 17)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !409, file: !6, line: 2679, baseType: !187, size: 64, offset: 1984)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !409, file: !6, line: 2681, baseType: !187, size: 64, offset: 2048)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !409, file: !6, line: 2684, baseType: !125, size: 32, offset: 2112)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !409, file: !6, line: 2691, baseType: !125, size: 32, offset: 2144)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !409, file: !6, line: 2693, baseType: !311, size: 64, offset: 2176)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !409, file: !6, line: 2694, baseType: !311, size: 64, offset: 2240)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !409, file: !6, line: 2696, baseType: !289, size: 64, offset: 2304)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !409, file: !6, line: 2699, baseType: !547, size: 64, offset: 2368)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !6, line: 60, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !6, line: 325, size: 11648, elements: !550)
!550 = !{!551, !552, !553, !1347, !1348, !1349, !1350, !1351}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !549, file: !6, line: 327, baseType: !547, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !549, file: !6, line: 328, baseType: !547, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !549, file: !6, line: 329, baseType: !554, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !6, line: 59, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !6, line: 3365, size: 72064, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !717, !718, !733, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !790, !791, !792, !793, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !814, !815, !817, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !838, !839, !840, !841, !842, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !902, !903, !904, !905, !906, !1159, !1167, !1168, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1260, !1261, !1262, !1263, !1304, !1305, !1315, !1316, !1317, !1318, !1319, !1339, !1340, !1341, !1342, !1346}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !556, file: !6, line: 3367, baseType: !125, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !556, file: !6, line: 3369, baseType: !407, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !556, file: !6, line: 3371, baseType: !554, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !556, file: !6, line: 3372, baseType: !554, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !556, file: !6, line: 3375, baseType: !563, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !6, line: 2618, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2542, size: 9920, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !582, !583, !584, !585, !586, !644, !652, !653, !654, !655, !656, !693, !694, !695, !696, !697, !698, !700, !701, !705, !706, !707, !708, !709, !710, !711, !712, !716}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !565, file: !6, line: 2544, baseType: !128, size: 2432)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !565, file: !6, line: 2545, baseType: !128, size: 2432, offset: 2432)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !565, file: !6, line: 2546, baseType: !125, size: 32, offset: 4864)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !565, file: !6, line: 2548, baseType: !125, size: 32, offset: 4896)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !565, file: !6, line: 2550, baseType: !125, size: 32, offset: 4928)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !565, file: !6, line: 2551, baseType: !125, size: 32, offset: 4960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !565, file: !6, line: 2552, baseType: !125, size: 32, offset: 4992)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !565, file: !6, line: 2553, baseType: !258, size: 192, offset: 5056)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !565, file: !6, line: 2554, baseType: !258, size: 192, offset: 5248)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !565, file: !6, line: 2555, baseType: !125, size: 32, offset: 5440)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !565, file: !6, line: 2556, baseType: !125, size: 32, offset: 5472)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !565, file: !6, line: 2557, baseType: !125, size: 32, offset: 5504)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !565, file: !6, line: 2559, baseType: !125, size: 32, offset: 5536)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !565, file: !6, line: 2560, baseType: !581, size: 16, offset: 5568)
!581 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !565, file: !6, line: 2561, baseType: !289, size: 64, offset: 5632)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !565, file: !6, line: 2562, baseType: !289, size: 64, offset: 5696)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !565, file: !6, line: 2563, baseType: !289, size: 64, offset: 5760)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !565, file: !6, line: 2564, baseType: !147, size: 64, offset: 5824)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !565, file: !6, line: 2565, baseType: !587, size: 64, offset: 5888)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !589, line: 56, baseType: !590)
!589 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !589, line: 49, size: 192, elements: !591)
!591 = !{!592, !640, !641, !642, !643}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !590, file: !589, line: 51, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !589, line: 42, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !589, line: 167, size: 320, elements: !596)
!596 = !{!597, !601, !605, !620, !639}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !595, file: !589, line: 169, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!587, !147, !125}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !595, file: !589, line: 170, baseType: !602, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !587}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !595, file: !589, line: 171, baseType: !606, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!125, !609, !147, !491, !125}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !589, line: 137, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !589, line: 131, size: 1408, elements: !612)
!612 = !{!613, !614, !618, !619}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !611, file: !589, line: 133, baseType: !587, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !611, file: !589, line: 134, baseType: !615, size: 640, offset: 64)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 640, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 10)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !611, file: !589, line: 135, baseType: !615, size: 640, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !611, file: !589, line: 136, baseType: !125, size: 32, offset: 1344)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !595, file: !589, line: 172, baseType: !621, size: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!289, !624, !554, !407, !311, !491, !296, !276}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !589, line: 154, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !589, line: 147, size: 2688, elements: !627)
!627 = !{!628, !629, !636, !637, !638}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !626, file: !589, line: 149, baseType: !587, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !626, file: !589, line: 150, baseType: !630, size: 1280, offset: 64)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 1280, elements: !616)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !6, line: 41, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 37, size: 128, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !632, file: !6, line: 39, baseType: !311, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !632, file: !6, line: 40, baseType: !491, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !626, file: !589, line: 151, baseType: !630, size: 1280, offset: 1344)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !626, file: !589, line: 152, baseType: !125, size: 32, offset: 2624)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !626, file: !589, line: 153, baseType: !491, size: 32, offset: 2656)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !595, file: !589, line: 173, baseType: !147, size: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !590, file: !589, line: 52, baseType: !448, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !590, file: !589, line: 53, baseType: !448, size: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !590, file: !589, line: 54, baseType: !448, size: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !590, file: !589, line: 55, baseType: !125, size: 32, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !565, file: !6, line: 2567, baseType: !645, size: 384, offset: 5952)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !6, line: 2475, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2470, size: 384, elements: !647)
!647 = !{!648, !649, !650, !651}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !646, file: !6, line: 2471, baseType: !282, size: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !646, file: !6, line: 2472, baseType: !282, size: 128, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !646, file: !6, line: 2473, baseType: !289, size: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !646, file: !6, line: 2474, baseType: !289, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !565, file: !6, line: 2569, baseType: !125, size: 32, offset: 6336)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !565, file: !6, line: 2570, baseType: !125, size: 32, offset: 6368)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !565, file: !6, line: 2572, baseType: !125, size: 32, offset: 6400)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !565, file: !6, line: 2575, baseType: !125, size: 32, offset: 6432)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !565, file: !6, line: 2592, baseType: !657, size: 64, offset: 6464)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !6, line: 1061, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !6, line: 1063, size: 1728, elements: !660)
!660 = !{!661, !662, !663, !685, !686, !687, !689, !692}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !659, file: !6, line: 1065, baseType: !657, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !659, file: !6, line: 1066, baseType: !311, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !659, file: !6, line: 1071, baseType: !664, size: 1344, offset: 128)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !659, file: !6, line: 1067, size: 1344, elements: !665)
!665 = !{!666, !684}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !664, file: !6, line: 1069, baseType: !667, size: 1344)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 1344, elements: !682)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !6, line: 1055, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !6, line: 1046, size: 192, elements: !670)
!670 = !{!671, !672, !673, !674, !675}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !669, file: !6, line: 1048, baseType: !125, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !669, file: !6, line: 1049, baseType: !125, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !669, file: !6, line: 1051, baseType: !125, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !669, file: !6, line: 1052, baseType: !125, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !669, file: !6, line: 1054, baseType: !676, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !589, line: 165, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !589, line: 161, size: 704, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !678, file: !589, line: 163, baseType: !581, size: 16)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !678, file: !589, line: 164, baseType: !615, size: 640, offset: 64)
!682 = !{!683}
!683 = !DISubrange(count: 7)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !664, file: !6, line: 1070, baseType: !258, size: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !659, file: !6, line: 1072, baseType: !125, size: 32, offset: 1472)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !659, file: !6, line: 1073, baseType: !125, size: 32, offset: 1504)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !659, file: !6, line: 1074, baseType: !688, size: 64, offset: 1536)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !659, file: !6, line: 1076, baseType: !690, size: 16, offset: 1600)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !133, line: 1689, baseType: !691)
!691 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !659, file: !6, line: 1077, baseType: !311, size: 64, offset: 1664)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !565, file: !6, line: 2593, baseType: !125, size: 32, offset: 6528)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !565, file: !6, line: 2594, baseType: !657, size: 64, offset: 6592)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !565, file: !6, line: 2595, baseType: !657, size: 64, offset: 6656)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !565, file: !6, line: 2596, baseType: !125, size: 32, offset: 6720)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !565, file: !6, line: 2597, baseType: !311, size: 64, offset: 6784)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !565, file: !6, line: 2598, baseType: !699, size: 16, offset: 6848)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !133, line: 325, baseType: !691)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !565, file: !6, line: 2603, baseType: !258, size: 192, offset: 6912)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !565, file: !6, line: 2604, baseType: !702, size: 2048, offset: 7104)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 2048, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !565, file: !6, line: 2605, baseType: !147, size: 64, offset: 9152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !565, file: !6, line: 2606, baseType: !147, size: 64, offset: 9216)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !565, file: !6, line: 2607, baseType: !587, size: 64, offset: 9280)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !565, file: !6, line: 2608, baseType: !147, size: 64, offset: 9344)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !565, file: !6, line: 2609, baseType: !147, size: 64, offset: 9408)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !565, file: !6, line: 2610, baseType: !147, size: 64, offset: 9472)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !565, file: !6, line: 2611, baseType: !125, size: 32, offset: 9536)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !565, file: !6, line: 2616, baseType: !713, size: 256, offset: 9568)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 256, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !565, file: !6, line: 2617, baseType: !147, size: 64, offset: 9856)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !556, file: !6, line: 3378, baseType: !125, size: 32, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !556, file: !6, line: 3381, baseType: !719, size: 64, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !6, line: 61, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !6, line: 3231, size: 512, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !721, file: !6, line: 3233, baseType: !122, size: 8)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !721, file: !6, line: 3234, baseType: !125, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !721, file: !6, line: 3235, baseType: !125, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !721, file: !6, line: 3236, baseType: !125, size: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !721, file: !6, line: 3237, baseType: !125, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !721, file: !6, line: 3238, baseType: !719, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !721, file: !6, line: 3239, baseType: !719, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !721, file: !6, line: 3241, baseType: !719, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !721, file: !6, line: 3244, baseType: !719, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !721, file: !6, line: 3245, baseType: !554, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !556, file: !6, line: 3383, baseType: !734, size: 128, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !6, line: 31, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 26, size: 128, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !735, file: !6, line: 28, baseType: !311, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !735, file: !6, line: 29, baseType: !491, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !735, file: !6, line: 30, baseType: !491, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !556, file: !6, line: 3385, baseType: !491, size: 32, offset: 576)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !556, file: !6, line: 3389, baseType: !125, size: 32, offset: 608)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !556, file: !6, line: 3394, baseType: !311, size: 64, offset: 640)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !556, file: !6, line: 3400, baseType: !122, size: 8, offset: 704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !556, file: !6, line: 3401, baseType: !311, size: 64, offset: 768)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !556, file: !6, line: 3402, baseType: !491, size: 32, offset: 832)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !556, file: !6, line: 3403, baseType: !491, size: 32, offset: 864)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !556, file: !6, line: 3404, baseType: !311, size: 64, offset: 896)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !556, file: !6, line: 3405, baseType: !491, size: 32, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !556, file: !6, line: 3406, baseType: !491, size: 32, offset: 992)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !556, file: !6, line: 3408, baseType: !751, size: 352, offset: 1024)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !6, line: 3358, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3343, size: 352, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !752, file: !6, line: 3345, baseType: !125, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !752, file: !6, line: 3346, baseType: !125, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !752, file: !6, line: 3347, baseType: !125, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !752, file: !6, line: 3348, baseType: !125, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !752, file: !6, line: 3349, baseType: !125, size: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !752, file: !6, line: 3350, baseType: !125, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !752, file: !6, line: 3351, baseType: !125, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !752, file: !6, line: 3352, baseType: !125, size: 32, offset: 224)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !752, file: !6, line: 3353, baseType: !125, size: 32, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !752, file: !6, line: 3354, baseType: !125, size: 32, offset: 288)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !752, file: !6, line: 3356, baseType: !125, size: 32, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !556, file: !6, line: 3414, baseType: !311, size: 64, offset: 1408)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !556, file: !6, line: 3416, baseType: !122, size: 8, offset: 1472)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !556, file: !6, line: 3419, baseType: !311, size: 64, offset: 1536)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !556, file: !6, line: 3423, baseType: !125, size: 32, offset: 1600)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !556, file: !6, line: 3424, baseType: !125, size: 32, offset: 1632)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !556, file: !6, line: 3425, baseType: !125, size: 32, offset: 1664)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !556, file: !6, line: 3427, baseType: !125, size: 32, offset: 1696)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !556, file: !6, line: 3429, baseType: !491, size: 32, offset: 1728)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !556, file: !6, line: 3432, baseType: !491, size: 32, offset: 1760)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !556, file: !6, line: 3435, baseType: !125, size: 32, offset: 1792)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !556, file: !6, line: 3437, baseType: !125, size: 32, offset: 1824)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !556, file: !6, line: 3445, baseType: !125, size: 32, offset: 1856)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !556, file: !6, line: 3446, baseType: !125, size: 32, offset: 1888)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !556, file: !6, line: 3449, baseType: !125, size: 32, offset: 1920)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !556, file: !6, line: 3450, baseType: !125, size: 32, offset: 1952)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !556, file: !6, line: 3451, baseType: !125, size: 32, offset: 1984)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !556, file: !6, line: 3452, baseType: !125, size: 32, offset: 2016)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !556, file: !6, line: 3454, baseType: !783, size: 320, offset: 2048)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !6, line: 3330, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3324, size: 320, elements: !785)
!785 = !{!786, !787, !788, !789}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !784, file: !6, line: 3326, baseType: !125, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !784, file: !6, line: 3327, baseType: !125, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !784, file: !6, line: 3328, baseType: !734, size: 128, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !784, file: !6, line: 3329, baseType: !734, size: 128, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !556, file: !6, line: 3457, baseType: !125, size: 32, offset: 2368)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !556, file: !6, line: 3458, baseType: !125, size: 32, offset: 2400)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !556, file: !6, line: 3459, baseType: !147, size: 64, offset: 2432)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !556, file: !6, line: 3460, baseType: !794, size: 32, offset: 2496)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !6, line: 2524, baseType: !58)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !556, file: !6, line: 3461, baseType: !125, size: 32, offset: 2528)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !556, file: !6, line: 3462, baseType: !125, size: 32, offset: 2560)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !556, file: !6, line: 3463, baseType: !554, size: 64, offset: 2624)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !556, file: !6, line: 3464, baseType: !125, size: 32, offset: 2688)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !556, file: !6, line: 3465, baseType: !125, size: 32, offset: 2720)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !556, file: !6, line: 3466, baseType: !125, size: 32, offset: 2752)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !556, file: !6, line: 3467, baseType: !125, size: 32, offset: 2784)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !556, file: !6, line: 3468, baseType: !125, size: 32, offset: 2816)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !556, file: !6, line: 3469, baseType: !125, size: 32, offset: 2848)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !556, file: !6, line: 3470, baseType: !125, size: 32, offset: 2880)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !556, file: !6, line: 3471, baseType: !125, size: 32, offset: 2912)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !556, file: !6, line: 3472, baseType: !125, size: 32, offset: 2944)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !556, file: !6, line: 3473, baseType: !125, size: 32, offset: 2976)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !556, file: !6, line: 3474, baseType: !125, size: 32, offset: 3008)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !556, file: !6, line: 3475, baseType: !125, size: 32, offset: 3040)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !556, file: !6, line: 3476, baseType: !147, size: 64, offset: 3072)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !556, file: !6, line: 3477, baseType: !147, size: 64, offset: 3136)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !556, file: !6, line: 3478, baseType: !813, size: 128, offset: 3200)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 128, elements: !354)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !556, file: !6, line: 3479, baseType: !813, size: 128, offset: 3328)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !556, file: !6, line: 3480, baseType: !816, size: 256, offset: 3456)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 256, elements: !354)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !556, file: !6, line: 3481, baseType: !818, size: 256, offset: 3712)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 256, elements: !473)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !556, file: !6, line: 3483, baseType: !125, size: 32, offset: 3968)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !556, file: !6, line: 3484, baseType: !125, size: 32, offset: 4000)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !556, file: !6, line: 3485, baseType: !187, size: 64, offset: 4032)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !556, file: !6, line: 3487, baseType: !187, size: 64, offset: 4096)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !556, file: !6, line: 3490, baseType: !125, size: 32, offset: 4160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !556, file: !6, line: 3493, baseType: !311, size: 64, offset: 4224)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !556, file: !6, line: 3495, baseType: !400, size: 192, offset: 4288)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !556, file: !6, line: 3496, baseType: !400, size: 192, offset: 4480)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !556, file: !6, line: 3497, baseType: !125, size: 32, offset: 4672)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !556, file: !6, line: 3498, baseType: !125, size: 32, offset: 4704)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !556, file: !6, line: 3500, baseType: !554, size: 64, offset: 4736)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !556, file: !6, line: 3501, baseType: !311, size: 64, offset: 4800)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !556, file: !6, line: 3502, baseType: !491, size: 32, offset: 4864)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !556, file: !6, line: 3503, baseType: !491, size: 32, offset: 4896)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !556, file: !6, line: 3504, baseType: !125, size: 32, offset: 4928)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !556, file: !6, line: 3505, baseType: !125, size: 32, offset: 4960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !556, file: !6, line: 3506, baseType: !125, size: 32, offset: 4992)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !556, file: !6, line: 3507, baseType: !837, size: 32, offset: 5024)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !6, line: 2530, baseType: !66)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !556, file: !6, line: 3509, baseType: !194, size: 64, offset: 5056)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !556, file: !6, line: 3510, baseType: !147, size: 64, offset: 5120)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !556, file: !6, line: 3511, baseType: !125, size: 32, offset: 5184)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !556, file: !6, line: 3512, baseType: !125, size: 32, offset: 5216)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !556, file: !6, line: 3514, baseType: !843, size: 64, offset: 5248)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !6, line: 2478, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !6, line: 2479, size: 704, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !855, !856}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !845, file: !6, line: 2481, baseType: !289, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !845, file: !6, line: 2483, baseType: !843, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !845, file: !6, line: 2484, baseType: !843, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !845, file: !6, line: 2485, baseType: !282, size: 128, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !845, file: !6, line: 2486, baseType: !122, size: 8, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !845, file: !6, line: 2487, baseType: !122, size: 8, offset: 328)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !845, file: !6, line: 2488, baseType: !125, size: 32, offset: 352)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !845, file: !6, line: 2489, baseType: !289, size: 64, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !845, file: !6, line: 2490, baseType: !400, size: 192, offset: 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !845, file: !6, line: 2491, baseType: !125, size: 32, offset: 640)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !556, file: !6, line: 3517, baseType: !125, size: 32, offset: 5312)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !556, file: !6, line: 3534, baseType: !125, size: 32, offset: 5344)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !556, file: !6, line: 3535, baseType: !734, size: 128, offset: 5376)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !556, file: !6, line: 3537, baseType: !491, size: 32, offset: 5504)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !556, file: !6, line: 3543, baseType: !125, size: 32, offset: 5536)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !556, file: !6, line: 3545, baseType: !125, size: 32, offset: 5568)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !556, file: !6, line: 3548, baseType: !125, size: 32, offset: 5600)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !556, file: !6, line: 3550, baseType: !491, size: 32, offset: 5632)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !556, file: !6, line: 3562, baseType: !125, size: 32, offset: 5664)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !556, file: !6, line: 3562, baseType: !125, size: 32, offset: 5696)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !556, file: !6, line: 3574, baseType: !125, size: 32, offset: 5728)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !556, file: !6, line: 3575, baseType: !869, size: 64, offset: 5760)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !6, line: 3225, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !6, line: 3216, size: 192, elements: !872)
!872 = !{!873, !874, !875, !876, !877}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !871, file: !6, line: 3218, baseType: !311, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !871, file: !6, line: 3219, baseType: !699, size: 16, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !871, file: !6, line: 3220, baseType: !122, size: 8, offset: 80)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !871, file: !6, line: 3222, baseType: !122, size: 8, offset: 88)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !871, file: !6, line: 3223, baseType: !311, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !556, file: !6, line: 3578, baseType: !258, size: 192, offset: 5824)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !556, file: !6, line: 3579, baseType: !122, size: 8, offset: 6016)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !556, file: !6, line: 3581, baseType: !122, size: 8, offset: 6024)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !556, file: !6, line: 3585, baseType: !125, size: 32, offset: 6048)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !556, file: !6, line: 3593, baseType: !125, size: 32, offset: 6080)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !556, file: !6, line: 3594, baseType: !125, size: 32, offset: 6112)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_top", scope: !556, file: !6, line: 3596, baseType: !311, size: 64, offset: 6144)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_bot", scope: !556, file: !6, line: 3597, baseType: !311, size: 64, offset: 6208)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_status", scope: !556, file: !6, line: 3598, baseType: !125, size: 32, offset: 6272)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_cursor", scope: !556, file: !6, line: 3602, baseType: !734, size: 128, offset: 6336)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_virtcol", scope: !556, file: !6, line: 3603, baseType: !491, size: 32, offset: 6464)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topline", scope: !556, file: !6, line: 3604, baseType: !311, size: 64, offset: 6528)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_line_count", scope: !556, file: !6, line: 3605, baseType: !311, size: 64, offset: 6592)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topfill", scope: !556, file: !6, line: 3607, baseType: !125, size: 32, offset: 6656)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_empty", scope: !556, file: !6, line: 3609, baseType: !122, size: 8, offset: 6688)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "w_alt_fnum", scope: !556, file: !6, line: 3612, baseType: !125, size: 32, offset: 6720)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "w_alist", scope: !556, file: !6, line: 3614, baseType: !895, size: 64, offset: 6784)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "alist_T", file: !6, line: 863, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arglist", file: !6, line: 858, size: 256, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "al_ga", scope: !897, file: !6, line: 860, baseType: !258, size: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "al_refcount", scope: !897, file: !6, line: 861, baseType: !125, size: 32, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !897, file: !6, line: 862, baseType: !125, size: 32, offset: 224)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx", scope: !556, file: !6, line: 3615, baseType: !125, size: 32, offset: 6848)
