; ModuleID = 'diff.c'
source_filename = "diff.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.tabpage_S = type { %struct.tabpage_S*, %struct.frame_S*, %struct.window_S*, %struct.window_S*, %struct.window_S*, %struct.window_S*, %struct.window_S*, i64, i64, i64, [3 x i32], i8*, i8*, %struct.diffblock_S*, [8 x %struct.file_buffer*], i32, i32, [2 x %struct.frame_S*], %struct.dictitem_S, %struct.dictvar_S* }
%struct.frame_S = type { i8, i32, i32, i32, i32, %struct.frame_S*, %struct.frame_S*, %struct.frame_S*, %struct.frame_S*, %struct.window_S* }

!765 = !DIEnumerator(name: "EVENT_SAFESTATEAGAIN", value: 72)
!766 = !DIEnumerator(name: "EVENT_SESSIONLOADPOST", value: 73)
!767 = !DIEnumerator(name: "EVENT_SHELLCMDPOST", value: 74)
!768 = !DIEnumerator(name: "EVENT_SHELLFILTERPOST", value: 75)
!769 = !DIEnumerator(name: "EVENT_SIGUSR1", value: 76)
!770 = !DIEnumerator(name: "EVENT_SOURCECMD", value: 77)
!771 = !DIEnumerator(name: "EVENT_SOURCEPRE", value: 78)
!772 = !DIEnumerator(name: "EVENT_SOURCEPOST", value: 79)
!773 = !DIEnumerator(name: "EVENT_SPELLFILEMISSING", value: 80)
!774 = !DIEnumerator(name: "EVENT_STDINREADPOST", value: 81)
!775 = !DIEnumerator(name: "EVENT_STDINREADPRE", value: 82)
!776 = !DIEnumerator(name: "EVENT_SWAPEXISTS", value: 83)
!777 = !DIEnumerator(name: "EVENT_SYNTAX", value: 84)
!778 = !DIEnumerator(name: "EVENT_TABCLOSED", value: 85)
!779 = !DIEnumerator(name: "EVENT_TABENTER", value: 86)
!780 = !DIEnumerator(name: "EVENT_TABLEAVE", value: 87)
!781 = !DIEnumerator(name: "EVENT_TABNEW", value: 88)
!782 = !DIEnumerator(name: "EVENT_TERMCHANGED", value: 89)
!783 = !DIEnumerator(name: "EVENT_TERMINALOPEN", value: 90)
!784 = !DIEnumerator(name: "EVENT_TERMINALWINOPEN", value: 91)
!785 = !DIEnumerator(name: "EVENT_TERMRESPONSE", value: 92)
!786 = !DIEnumerator(name: "EVENT_TEXTCHANGED", value: 93)
!787 = !DIEnumerator(name: "EVENT_TEXTCHANGEDI", value: 94)
!788 = !DIEnumerator(name: "EVENT_TEXTCHANGEDP", value: 95)
!789 = !DIEnumerator(name: "EVENT_TEXTYANKPOST", value: 96)
!790 = !DIEnumerator(name: "EVENT_USER", value: 97)
!791 = !DIEnumerator(name: "EVENT_VIMENTER", value: 98)
!792 = !DIEnumerator(name: "EVENT_VIMLEAVE", value: 99)
!793 = !DIEnumerator(name: "EVENT_VIMLEAVEPRE", value: 100)
!794 = !DIEnumerator(name: "EVENT_VIMRESIZED", value: 101)
!795 = !DIEnumerator(name: "EVENT_WINENTER", value: 102)
!796 = !DIEnumerator(name: "EVENT_WINLEAVE", value: 103)
!797 = !DIEnumerator(name: "EVENT_WINNEW", value: 104)
!798 = !DIEnumerator(name: "EVENT_VIMSUSPEND", value: 105)
!799 = !DIEnumerator(name: "EVENT_VIMRESUME", value: 106)
!800 = !DIEnumerator(name: "NUM_EVENTS", value: 107)
!801 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !691, line: 1363, size: 32, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!803 = !DIEnumerator(name: "HLF_8", value: 0)
!804 = !DIEnumerator(name: "HLF_EOB", value: 1)
!805 = !DIEnumerator(name: "HLF_AT", value: 2)
!806 = !DIEnumerator(name: "HLF_D", value: 3)
!807 = !DIEnumerator(name: "HLF_E", value: 4)
!808 = !DIEnumerator(name: "HLF_H", value: 5)
!809 = !DIEnumerator(name: "HLF_I", value: 6)
!810 = !DIEnumerator(name: "HLF_L", value: 7)
!811 = !DIEnumerator(name: "HLF_M", value: 8)
!812 = !DIEnumerator(name: "HLF_CM", value: 9)
!813 = !DIEnumerator(name: "HLF_N", value: 10)
!814 = !DIEnumerator(name: "HLF_LNA", value: 11)
!815 = !DIEnumerator(name: "HLF_LNB", value: 12)
!816 = !DIEnumerator(name: "HLF_CLN", value: 13)
!817 = !DIEnumerator(name: "HLF_R", value: 14)
!818 = !DIEnumerator(name: "HLF_S", value: 15)
!819 = !DIEnumerator(name: "HLF_SNC", value: 16)
!820 = !DIEnumerator(name: "HLF_C", value: 17)
!821 = !DIEnumerator(name: "HLF_T", value: 18)
!822 = !DIEnumerator(name: "HLF_V", value: 19)
!823 = !DIEnumerator(name: "HLF_VNC", value: 20)
!824 = !DIEnumerator(name: "HLF_W", value: 21)
!825 = !DIEnumerator(name: "HLF_WM", value: 22)
!826 = !DIEnumerator(name: "HLF_FL", value: 23)
!827 = !DIEnumerator(name: "HLF_FC", value: 24)
!828 = !DIEnumerator(name: "HLF_ADD", value: 25)
!829 = !DIEnumerator(name: "HLF_CHD", value: 26)
!830 = !DIEnumerator(name: "HLF_DED", value: 27)
!831 = !DIEnumerator(name: "HLF_TXD", value: 28)
!832 = !DIEnumerator(name: "HLF_CONCEAL", value: 29)
!833 = !DIEnumerator(name: "HLF_SC", value: 30)
!834 = !DIEnumerator(name: "HLF_SPB", value: 31)
!835 = !DIEnumerator(name: "HLF_SPC", value: 32)
!836 = !DIEnumerator(name: "HLF_SPR", value: 33)
!837 = !DIEnumerator(name: "HLF_SPL", value: 34)
!838 = !DIEnumerator(name: "HLF_PNI", value: 35)
!839 = !DIEnumerator(name: "HLF_PSI", value: 36)
!840 = !DIEnumerator(name: "HLF_PSB", value: 37)
!841 = !DIEnumerator(name: "HLF_PST", value: 38)
!842 = !DIEnumerator(name: "HLF_TP", value: 39)
!843 = !DIEnumerator(name: "HLF_TPS", value: 40)
!844 = !DIEnumerator(name: "HLF_TPF", value: 41)
!845 = !DIEnumerator(name: "HLF_CUC", value: 42)
!846 = !DIEnumerator(name: "HLF_CUL", value: 43)
!847 = !DIEnumerator(name: "HLF_MC", value: 44)
!848 = !DIEnumerator(name: "HLF_QFL", value: 45)
!849 = !DIEnumerator(name: "HLF_ST", value: 46)
!850 = !DIEnumerator(name: "HLF_STNC", value: 47)
!851 = !DIEnumerator(name: "HLF_COUNT", value: 48)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !853, file: !3, line: 1599, size: 32, elements: !970)
!853 = distinct !DISubprogram(name: "diff_read", scope: !3, file: !3, line: 1582, type: !854, isLocal: true, isDefinition: true, scopeLine: 1586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !875)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !856, !856, !857}
!856 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "diffout_T", file: !3, line: 65, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 62, size: 256, elements: !860)
!860 = !{!861, !865}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "dout_fname", scope: !859, file: !3, line: 63, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !691, line: 324, baseType: !864)
!864 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "dout_ga", scope: !859, file: !3, line: 64, baseType: !866, size: 192, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !6, line: 55, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !6, line: 48, size: 192, elements: !868)
!868 = !{!869, !870, !871, !872, !873}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !867, file: !6, line: 50, baseType: !856, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !867, file: !6, line: 51, baseType: !856, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !867, file: !6, line: 52, baseType: !856, size: 32, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !867, file: !6, line: 53, baseType: !856, size: 32, offset: 96)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !867, file: !6, line: 54, baseType: !874, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!875 = !{!876, !877, !878, !879, !941, !942, !954, !955, !956, !957, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!876 = !DILocalVariable(name: "idx_orig", arg: 1, scope: !853, file: !3, line: 1583, type: !856)
!877 = !DILocalVariable(name: "idx_new", arg: 2, scope: !853, file: !3, line: 1584, type: !856)
!878 = !DILocalVariable(name: "dout", arg: 3, scope: !853, file: !3, line: 1585, type: !857)
!879 = !DILocalVariable(name: "fd", scope: !853, file: !3, line: 1587, type: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !882, line: 7, baseType: !883)
!882 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "/home/sahil/vim/src")
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !884, line: 49, size: 1728, elements: !885)
!884 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "/home/sahil/vim/src")
!885 = !{!886, !887, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !903, !905, !906, !907, !911, !913, !915, !919, !922, !924, !927, !930, !931, !932, !936, !937}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !883, file: !884, line: 51, baseType: !856, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !883, file: !884, line: 54, baseType: !888, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !883, file: !884, line: 55, baseType: !888, size: 64, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !883, file: !884, line: 56, baseType: !888, size: 64, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !883, file: !884, line: 57, baseType: !888, size: 64, offset: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !883, file: !884, line: 58, baseType: !888, size: 64, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !883, file: !884, line: 59, baseType: !888, size: 64, offset: 384)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !883, file: !884, line: 60, baseType: !888, size: 64, offset: 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !883, file: !884, line: 61, baseType: !888, size: 64, offset: 512)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !883, file: !884, line: 64, baseType: !888, size: 64, offset: 576)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !883, file: !884, line: 65, baseType: !888, size: 64, offset: 640)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !883, file: !884, line: 66, baseType: !888, size: 64, offset: 704)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !883, file: !884, line: 68, baseType: !901, size: 64, offset: 768)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !884, line: 36, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !883, file: !884, line: 70, baseType: !904, size: 64, offset: 832)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !883, file: !884, line: 72, baseType: !856, size: 32, offset: 896)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !883, file: !884, line: 73, baseType: !856, size: 32, offset: 928)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !883, file: !884, line: 74, baseType: !908, size: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !909, line: 152, baseType: !910)
!909 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!910 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !883, file: !884, line: 77, baseType: !912, size: 16, offset: 1024)
!912 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !883, file: !884, line: 78, baseType: !914, size: 8, offset: 1040)
!914 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !883, file: !884, line: 79, baseType: !916, size: 8, offset: 1048)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 8, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 1)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !883, file: !884, line: 81, baseType: !920, size: 64, offset: 1088)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !884, line: 43, baseType: null)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !883, file: !884, line: 89, baseType: !923, size: 64, offset: 1152)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !909, line: 153, baseType: !910)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !883, file: !884, line: 91, baseType: !925, size: 64, offset: 1216)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !884, line: 37, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !883, file: !884, line: 92, baseType: !928, size: 64, offset: 1280)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !884, line: 38, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !883, file: !884, line: 93, baseType: !904, size: 64, offset: 1344)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !883, file: !884, line: 94, baseType: !874, size: 64, offset: 1408)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !883, file: !884, line: 95, baseType: !933, size: 64, offset: 1472)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !934, line: 62, baseType: !935)
!934 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!935 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !883, file: !884, line: 96, baseType: !856, size: 32, offset: 1536)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !883, file: !884, line: 98, baseType: !938, size: 160, offset: 1568)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 160, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 20)
!941 = !DILocalVariable(name: "line_idx", scope: !853, file: !3, line: 1588, type: !856)
!942 = !DILocalVariable(name: "dprev", scope: !853, file: !3, line: 1589, type: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "diff_T", file: !6, line: 3139, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "diffblock_S", file: !6, line: 3140, size: 1088, elements: !946)
!946 = !{!947, !948, !953}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "df_next", scope: !945, file: !6, line: 3142, baseType: !943, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "df_lnum", scope: !945, file: !6, line: 3143, baseType: !949, size: 512, offset: 64)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 512, elements: !951)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !691, line: 1687, baseType: !910)
!951 = !{!952}
!952 = !DISubrange(count: 8)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "df_count", scope: !945, file: !6, line: 3144, baseType: !949, size: 512, offset: 576)
!954 = !DILocalVariable(name: "dp", scope: !853, file: !3, line: 1590, type: !943)
!955 = !DILocalVariable(name: "dn", scope: !853, file: !3, line: 1591, type: !943)
!956 = !DILocalVariable(name: "dpl", scope: !853, file: !3, line: 1591, type: !943)
!957 = !DILocalVariable(name: "linebuf", scope: !853, file: !3, line: 1592, type: !958)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 400, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 50)
!961 = !DILocalVariable(name: "line", scope: !853, file: !3, line: 1593, type: !862)
!962 = !DILocalVariable(name: "off", scope: !853, file: !3, line: 1594, type: !910)
!963 = !DILocalVariable(name: "i", scope: !853, file: !3, line: 1595, type: !856)
!964 = !DILocalVariable(name: "lnum_orig", scope: !853, file: !3, line: 1596, type: !950)
!965 = !DILocalVariable(name: "lnum_new", scope: !853, file: !3, line: 1596, type: !950)
!966 = !DILocalVariable(name: "count_orig", scope: !853, file: !3, line: 1597, type: !910)
!967 = !DILocalVariable(name: "count_new", scope: !853, file: !3, line: 1597, type: !910)
!968 = !DILocalVariable(name: "notset", scope: !853, file: !3, line: 1598, type: !856)
!969 = !DILocalVariable(name: "diffstyle", scope: !853, file: !3, line: 1603, type: !852)
!970 = !{!971, !972, !973}
!971 = !DIEnumerator(name: "DIFF_ED", value: 0)
!972 = !DIEnumerator(name: "DIFF_UNIFIED", value: 1)
!973 = !DIEnumerator(name: "DIFF_NONE", value: 2)
!974 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !975, line: 46, size: 32, elements: !976)
!975 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/sahil/vim/src")
!976 = !{!977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988}
!977 = !DIEnumerator(name: "_ISupper", value: 256)
!978 = !DIEnumerator(name: "_ISlower", value: 512)
!979 = !DIEnumerator(name: "_ISalpha", value: 1024)
!980 = !DIEnumerator(name: "_ISdigit", value: 2048)
!981 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!982 = !DIEnumerator(name: "_ISspace", value: 8192)
!983 = !DIEnumerator(name: "_ISprint", value: 16384)
!984 = !DIEnumerator(name: "_ISgraph", value: 32768)
!985 = !DIEnumerator(name: "_ISblank", value: 1)
!986 = !DIEnumerator(name: "_IScntrl", value: 2)
!987 = !DIEnumerator(name: "_ISpunct", value: 4)
!988 = !DIEnumerator(name: "_ISalnum", value: 8)
!989 = !{!874, !888, !862, !950, !933, !990, !856, !910, !991, !943, !857, !992, !912, !993}
!990 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "hlf_T", file: !691, line: 1416, baseType: !801)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!994 = !{!995, !2651, !2653, !2655, !2657, !2659, !0, !2661, !2663, !2665, !2667}
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "prev_lnum", scope: !997, file: !3, line: 3285, type: !950, isLocal: true, isDefinition: true)
!997 = distinct !DISubprogram(name: "f_diff_hlID", scope: !3, file: !3, line: 3281, type: !998, isLocal: false, isDefinition: true, scopeLine: 3282, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !2645)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !1000, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !6, line: 1432, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1412, size: 128, elements: !1003)
!1003 = !{!1004, !1006, !1007}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !1002, file: !6, line: 1414, baseType: !1005, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !6, line: 1391, baseType: !5)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !1002, file: !6, line: 1415, baseType: !889, size: 8, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !1002, file: !6, line: 1431, baseType: !1008, size: 64, offset: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1002, file: !6, line: 1416, size: 64, elements: !1009)
!1009 = !{!1010, !1013, !1016, !1017, !1073, !1108, !1244, !2636, !2637}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !1008, file: !6, line: 1418, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !6, line: 1327, baseType: !1012)
!1012 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !1008, file: !6, line: 1420, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !6, line: 1344, baseType: !1015)
!1015 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !1008, file: !6, line: 1422, baseType: !862, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !1008, file: !6, line: 1423, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !6, line: 1346, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !6, line: 1471, size: 768, elements: !1021)
!1021 = !{!1022, !1030, !1037, !1052, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !1020, file: !6, line: 1473, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !6, line: 1446, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !6, line: 1448, size: 256, elements: !1026)
!1026 = !{!1027, !1028, !1029}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !1025, file: !6, line: 1450, baseType: !1023, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !1025, file: !6, line: 1451, baseType: !1023, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !1025, file: !6, line: 1452, baseType: !1001, size: 128, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !1020, file: !6, line: 1474, baseType: !1031, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !6, line: 1456, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !6, line: 1458, size: 128, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !1033, file: !6, line: 1460, baseType: !1023, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !1033, file: !6, line: 1461, baseType: !1031, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !1020, file: !6, line: 1487, baseType: !1038, size: 192, offset: 128)
!1038 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1020, file: !6, line: 1475, size: 192, elements: !1039)
!1039 = !{!1040, !1046}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !1038, file: !6, line: 1481, baseType: !1041, size: 192)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1038, file: !6, line: 1476, size: 192, elements: !1042)
!1042 = !{!1043, !1044, !1045}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !1041, file: !6, line: 1478, baseType: !1011, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !1041, file: !6, line: 1479, baseType: !1011, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !1041, file: !6, line: 1480, baseType: !856, size: 32, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1038, file: !6, line: 1486, baseType: !1047, size: 192)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1038, file: !6, line: 1482, size: 192, elements: !1048)
!1048 = !{!1049, !1050, !1051}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !1047, file: !6, line: 1483, baseType: !1023, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !1047, file: !6, line: 1484, baseType: !1023, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !1047, file: !6, line: 1485, baseType: !856, size: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !1020, file: !6, line: 1488, baseType: !1053, size: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !6, line: 1394, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !6, line: 1395, size: 192, elements: !1056)
!1056 = !{!1057, !1058, !1060, !1061, !1062, !1063}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !1055, file: !6, line: 1396, baseType: !1005, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !1055, file: !6, line: 1397, baseType: !1059, size: 8, offset: 32)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !6, line: 1342, baseType: !914)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !1055, file: !6, line: 1398, baseType: !889, size: 8, offset: 40)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !1055, file: !6, line: 1399, baseType: !889, size: 8, offset: 48)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !1055, file: !6, line: 1400, baseType: !1053, size: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !1055, file: !6, line: 1401, baseType: !1064, size: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !1020, file: !6, line: 1489, baseType: !1018, size: 64, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !1020, file: !6, line: 1490, baseType: !1018, size: 64, offset: 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !1020, file: !6, line: 1491, baseType: !1018, size: 64, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !1020, file: !6, line: 1492, baseType: !856, size: 32, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !1020, file: !6, line: 1493, baseType: !856, size: 32, offset: 608)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !1020, file: !6, line: 1494, baseType: !856, size: 32, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !1020, file: !6, line: 1496, baseType: !856, size: 32, offset: 672)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !1020, file: !6, line: 1497, baseType: !889, size: 8, offset: 704)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !1008, file: !6, line: 1424, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !6, line: 1347, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !6, line: 1545, size: 2816, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082, !1104, !1105, !1106, !1107}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !1076, file: !6, line: 1547, baseType: !889, size: 8)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !1076, file: !6, line: 1548, baseType: !889, size: 8, offset: 8)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !1076, file: !6, line: 1549, baseType: !856, size: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !1076, file: !6, line: 1550, baseType: !856, size: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !1076, file: !6, line: 1551, baseType: !1083, size: 2432, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !6, line: 1290, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !6, line: 1277, size: 2432, elements: !1085)
!1085 = !{!1086, !1088, !1089, !1090, !1091, !1092, !1093, !1100}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !1084, file: !6, line: 1279, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !691, line: 345, baseType: !935)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !1084, file: !6, line: 1281, baseType: !1087, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !1084, file: !6, line: 1282, baseType: !1087, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !1084, file: !6, line: 1283, baseType: !856, size: 32, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !1084, file: !6, line: 1284, baseType: !856, size: 32, offset: 224)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !1084, file: !6, line: 1285, baseType: !856, size: 32, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !1084, file: !6, line: 1287, baseType: !1094, size: 64, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !6, line: 1265, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !6, line: 1261, size: 128, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !1096, file: !6, line: 1263, baseType: !1087, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !1096, file: !6, line: 1264, baseType: !862, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !1084, file: !6, line: 1289, baseType: !1101, size: 2048, offset: 384)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 2048, elements: !1102)
!1102 = !{!1103}
!1103 = !DISubrange(count: 16)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !1076, file: !6, line: 1552, baseType: !1053, size: 64, offset: 2560)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !1076, file: !6, line: 1553, baseType: !1074, size: 64, offset: 2624)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !1076, file: !6, line: 1554, baseType: !1074, size: 64, offset: 2688)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !1076, file: !6, line: 1555, baseType: !1074, size: 64, offset: 2752)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !1008, file: !6, line: 1425, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !6, line: 1348, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !6, line: 1994, size: 832, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1219, !1220, !1230, !1240, !1241, !1242, !1243}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !1111, file: !6, line: 1996, baseType: !856, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !1111, file: !6, line: 1997, baseType: !862, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !1111, file: !6, line: 1999, baseType: !1116, size: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !6, line: 1658, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1597, size: 3072, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1124, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1139, !1140, !1141, !1142, !1143, !1152, !1153, !1154, !1155, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1172, !1173, !1174, !1214, !1215}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !1118, file: !6, line: 1599, baseType: !856, size: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !1118, file: !6, line: 1600, baseType: !856, size: 32, offset: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !1118, file: !6, line: 1601, baseType: !856, size: 32, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !1118, file: !6, line: 1602, baseType: !856, size: 32, offset: 96)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !1118, file: !6, line: 1603, baseType: !1125, size: 32, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !6, line: 1591, baseType: !23)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !1118, file: !6, line: 1604, baseType: !856, size: 32, offset: 160)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !1118, file: !6, line: 1605, baseType: !866, size: 192, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !1118, file: !6, line: 1606, baseType: !866, size: 192, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !1118, file: !6, line: 1609, baseType: !1064, size: 64, offset: 576)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !1118, file: !6, line: 1610, baseType: !1053, size: 64, offset: 640)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !1118, file: !6, line: 1611, baseType: !866, size: 192, offset: 704)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !1118, file: !6, line: 1612, baseType: !1109, size: 64, offset: 896)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !1118, file: !6, line: 1615, baseType: !862, size: 64, offset: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !1118, file: !6, line: 1616, baseType: !1053, size: 64, offset: 1024)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !1118, file: !6, line: 1617, baseType: !1053, size: 64, offset: 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !1118, file: !6, line: 1618, baseType: !856, size: 32, offset: 1152)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !1118, file: !6, line: 1619, baseType: !1138, size: 64, offset: 1216)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !1118, file: !6, line: 1626, baseType: !866, size: 192, offset: 1280)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !1118, file: !6, line: 1628, baseType: !856, size: 32, offset: 1472)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !1118, file: !6, line: 1629, baseType: !856, size: 32, offset: 1504)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !1118, file: !6, line: 1631, baseType: !856, size: 32, offset: 1536)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !1118, file: !6, line: 1632, baseType: !1144, size: 128, offset: 1600)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !691, line: 1786, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1146, line: 8, size: 128, elements: !1147)
!1146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!1147 = !{!1148, !1150}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1145, file: !1146, line: 10, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !909, line: 160, baseType: !910)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1145, file: !1146, line: 11, baseType: !1151, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !909, line: 162, baseType: !910)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !1118, file: !6, line: 1633, baseType: !1144, size: 128, offset: 1728)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !1118, file: !6, line: 1634, baseType: !1144, size: 128, offset: 1856)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !1118, file: !6, line: 1636, baseType: !1138, size: 64, offset: 1984)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !1118, file: !6, line: 1637, baseType: !1156, size: 64, offset: 2048)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !1118, file: !6, line: 1638, baseType: !1156, size: 64, offset: 2112)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !1118, file: !6, line: 1639, baseType: !1144, size: 128, offset: 2176)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !1118, file: !6, line: 1640, baseType: !1144, size: 128, offset: 2304)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !1118, file: !6, line: 1641, baseType: !1144, size: 128, offset: 2432)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !1118, file: !6, line: 1642, baseType: !856, size: 32, offset: 2560)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !1118, file: !6, line: 1643, baseType: !856, size: 32, offset: 2592)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !1118, file: !6, line: 1645, baseType: !1164, size: 192, offset: 2624)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !6, line: 92, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 85, size: 192, elements: !1166)
!1166 = !{!1167, !1169, !1170, !1171}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !1165, file: !6, line: 87, baseType: !1168, size: 32)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !6, line: 62, baseType: !856)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !1165, file: !6, line: 88, baseType: !856, size: 32, offset: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !1165, file: !6, line: 89, baseType: !950, size: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !1165, file: !6, line: 91, baseType: !856, size: 32, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !1118, file: !6, line: 1648, baseType: !856, size: 32, offset: 2816)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !1118, file: !6, line: 1649, baseType: !856, size: 32, offset: 2848)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !1118, file: !6, line: 1651, baseType: !1175, size: 64, offset: 2880)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !6, line: 1582, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !6, line: 1682, size: 17280, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1198, !1199, !1200, !1201, !1202, !1203, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1177, file: !6, line: 1684, baseType: !1116, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !1177, file: !6, line: 1685, baseType: !856, size: 32, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !1177, file: !6, line: 1686, baseType: !856, size: 32, offset: 96)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !1177, file: !6, line: 1691, baseType: !1183, size: 4608, offset: 128)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1184, size: 4608, elements: !1196)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1177, file: !6, line: 1687, size: 384, elements: !1185)
!1185 = !{!1186, !1194}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1184, file: !6, line: 1689, baseType: !1187, size: 192)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !6, line: 1519, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !6, line: 1513, size: 192, elements: !1189)
!1189 = !{!1190, !1191, !1192}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !1188, file: !6, line: 1515, baseType: !1001, size: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !1188, file: !6, line: 1516, baseType: !863, size: 8, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !1188, file: !6, line: 1517, baseType: !1193, size: 8, offset: 136)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 8, elements: !917)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "room", scope: !1184, file: !6, line: 1690, baseType: !1195, size: 160, offset: 192)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 160, elements: !939)
!1196 = !{!1197}
!1197 = !DISubrange(count: 12)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars", scope: !1177, file: !6, line: 1692, baseType: !1075, size: 2816, offset: 4736)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars_var", scope: !1177, file: !6, line: 1693, baseType: !1187, size: 192, offset: 7552)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars", scope: !1177, file: !6, line: 1694, baseType: !1075, size: 2816, offset: 7744)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars_var", scope: !1177, file: !6, line: 1695, baseType: !1187, size: 192, offset: 10560)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "l_varlist", scope: !1177, file: !6, line: 1696, baseType: !1019, size: 768, offset: 10752)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "l_listitems", scope: !1177, file: !6, line: 1697, baseType: !1204, size: 5120, offset: 11520)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 5120, elements: !939)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "rettv", scope: !1177, file: !6, line: 1698, baseType: !1000, size: 64, offset: 16640)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !1177, file: !6, line: 1699, baseType: !950, size: 64, offset: 16704)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "dbg_tick", scope: !1177, file: !6, line: 1700, baseType: !856, size: 32, offset: 16768)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1177, file: !6, line: 1701, baseType: !856, size: 32, offset: 16800)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "prof_child", scope: !1177, file: !6, line: 1703, baseType: !1144, size: 128, offset: 16832)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !1177, file: !6, line: 1705, baseType: !1175, size: 64, offset: 16960)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "fc_refcount", scope: !1177, file: !6, line: 1709, baseType: !856, size: 32, offset: 17024)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "fc_copyID", scope: !1177, file: !6, line: 1711, baseType: !856, size: 32, offset: 17056)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "fc_funcs", scope: !1177, file: !6, line: 1712, baseType: !866, size: 192, offset: 17088)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name_exp", scope: !1118, file: !6, line: 1653, baseType: !862, size: 64, offset: 2944)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name", scope: !1118, file: !6, line: 1655, baseType: !1216, size: 32, offset: 3008)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 32, elements: !1217)
!1217 = !{!1218}
!1218 = !DISubrange(count: 4)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "pt_auto", scope: !1111, file: !6, line: 2001, baseType: !856, size: 32, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pt_outer", scope: !1111, file: !6, line: 2005, baseType: !1221, size: 256, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "outer_T", file: !6, line: 1986, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_S", file: !6, line: 1987, size: 256, elements: !1223)
!1223 = !{!1224, !1226, !1227, !1229}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "out_stack", scope: !1222, file: !6, line: 1988, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame_idx", scope: !1222, file: !6, line: 1989, baseType: !856, size: 32, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "out_up", scope: !1222, file: !6, line: 1990, baseType: !1228, size: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "out_up_is_copy", scope: !1222, file: !6, line: 1991, baseType: !856, size: 32, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pt_funcstack", scope: !1111, file: !6, line: 2007, baseType: !1231, size: 64, offset: 512)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "funcstack_T", file: !6, line: 1984, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcstack_S", file: !6, line: 1972, size: 320, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238, !1239}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ga", scope: !1233, file: !6, line: 1974, baseType: !866, size: 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "fs_var_offset", scope: !1233, file: !6, line: 1978, baseType: !856, size: 32, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "fs_refcount", scope: !1233, file: !6, line: 1981, baseType: !856, size: 32, offset: 224)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "fs_min_refcount", scope: !1233, file: !6, line: 1982, baseType: !856, size: 32, offset: 256)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "fs_copyID", scope: !1233, file: !6, line: 1983, baseType: !856, size: 32, offset: 288)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argc", scope: !1111, file: !6, line: 2010, baseType: !856, size: 32, offset: 576)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argv", scope: !1111, file: !6, line: 2011, baseType: !1000, size: 64, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pt_dict", scope: !1111, file: !6, line: 2013, baseType: !1074, size: 64, offset: 704)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pt_copyID", scope: !1111, file: !6, line: 2014, baseType: !856, size: 32, offset: 768)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !1008, file: !6, line: 1427, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !6, line: 1365, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !6, line: 2072, size: 1024, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1255, !1256, !1257, !1259, !1260, !1261, !1262, !1269, !2537, !2538, !2539, !2635}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !1247, file: !6, line: 2074, baseType: !1245, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !1247, file: !6, line: 2075, baseType: !1245, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !1247, file: !6, line: 2077, baseType: !1252, size: 32, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !1253, line: 97, baseType: !1254)
!1253 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !909, line: 154, baseType: !856)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !1247, file: !6, line: 2083, baseType: !862, size: 64, offset: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !1247, file: !6, line: 2084, baseType: !862, size: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !1247, file: !6, line: 2085, baseType: !1258, size: 32, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !6, line: 2067, baseType: !30)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !1247, file: !6, line: 2086, baseType: !862, size: 64, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !1247, file: !6, line: 2088, baseType: !862, size: 64, offset: 448)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !1247, file: !6, line: 2093, baseType: !856, size: 32, offset: 512)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !1247, file: !6, line: 2094, baseType: !1263, size: 192, offset: 576)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !6, line: 1360, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1356, size: 192, elements: !1265)
!1265 = !{!1266, !1267, !1268}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !1264, file: !6, line: 1357, baseType: !862, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !1264, file: !6, line: 1358, baseType: !1109, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !1264, file: !6, line: 1359, baseType: !856, size: 32, offset: 128)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !1247, file: !6, line: 2096, baseType: !1270, size: 64, offset: 768)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !6, line: 63, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !6, line: 2629, size: 73152, elements: !1273)
!1273 = !{!1274, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1380, !1383, !1384, !1388, !1389, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !2211, !2212, !2213, !2217, !2218, !2219, !2223, !2231, !2232, !2233, !2234, !2235, !2237, !2238, !2239, !2240, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2484, !2485, !2486, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2520, !2521, !2522, !2523, !2524, !2531, !2532, !2536}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !1272, file: !6, line: 2631, baseType: !1275, size: 832)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !6, line: 766, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !6, line: 737, size: 832, elements: !1277)
!1277 = !{!1278, !1279, !1338, !1347, !1348, !1349, !1350, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1365, !1366}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !1276, file: !6, line: 739, baseType: !950, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !1276, file: !6, line: 741, baseType: !1280, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !6, line: 459, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !6, line: 671, size: 9856, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1287, !1288, !1289, !1308, !1309, !1310, !1311, !1312, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1335, !1336, !1337}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !1282, file: !6, line: 673, baseType: !862, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !1282, file: !6, line: 674, baseType: !862, size: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !1282, file: !6, line: 675, baseType: !856, size: 32, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !1282, file: !6, line: 676, baseType: !856, size: 32, offset: 160)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !1282, file: !6, line: 677, baseType: !856, size: 32, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !1282, file: !6, line: 678, baseType: !1290, size: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !6, line: 458, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !6, line: 506, size: 448, elements: !1293)
!1293 = !{!1294, !1303, !1304, !1305, !1306, !1307}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !1292, file: !6, line: 508, baseType: !1295, size: 192)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !6, line: 469, baseType: !1296)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !6, line: 471, size: 192, elements: !1297)
!1297 = !{!1298, !1300, !1301}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !1296, file: !6, line: 473, baseType: !1299, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !1296, file: !6, line: 474, baseType: !1299, size: 64, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !1296, file: !6, line: 475, baseType: !1302, size: 64, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !6, line: 460, baseType: !910)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !1292, file: !6, line: 511, baseType: !1290, size: 64, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !1292, file: !6, line: 512, baseType: !1290, size: 64, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !1292, file: !6, line: 513, baseType: !862, size: 64, offset: 320)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !1292, file: !6, line: 514, baseType: !856, size: 32, offset: 384)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !1292, file: !6, line: 518, baseType: !889, size: 8, offset: 416)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !1282, file: !6, line: 679, baseType: !1290, size: 64, offset: 320)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !1282, file: !6, line: 680, baseType: !1290, size: 64, offset: 384)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !1282, file: !6, line: 681, baseType: !990, size: 32, offset: 448)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !1282, file: !6, line: 682, baseType: !990, size: 32, offset: 480)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !1282, file: !6, line: 683, baseType: !1313, size: 4352, offset: 512)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !6, line: 489, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !6, line: 480, size: 4352, elements: !1315)
!1315 = !{!1316, !1317, !1318, !1320, !1324}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !1314, file: !6, line: 482, baseType: !1087, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !1314, file: !6, line: 484, baseType: !1087, size: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !1314, file: !6, line: 485, baseType: !1319, size: 64, offset: 128)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !1314, file: !6, line: 487, baseType: !1321, size: 4096, offset: 192)
!1321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1299, size: 4096, elements: !1322)
!1322 = !{!1323}
!1323 = !DISubrange(count: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !1314, file: !6, line: 488, baseType: !889, size: 8, offset: 4288)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !1282, file: !6, line: 684, baseType: !1313, size: 4352, offset: 4864)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !1282, file: !6, line: 685, baseType: !1302, size: 64, offset: 9216)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !1282, file: !6, line: 686, baseType: !1302, size: 64, offset: 9280)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !1282, file: !6, line: 687, baseType: !1302, size: 64, offset: 9344)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !1282, file: !6, line: 688, baseType: !1302, size: 64, offset: 9408)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !1282, file: !6, line: 689, baseType: !990, size: 32, offset: 9472)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !1282, file: !6, line: 690, baseType: !856, size: 32, offset: 9504)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !1282, file: !6, line: 692, baseType: !1270, size: 64, offset: 9536)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !1282, file: !6, line: 693, baseType: !1334, size: 64, offset: 9600)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 64, elements: !951)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !1282, file: !6, line: 697, baseType: !862, size: 64, offset: 9664)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !1282, file: !6, line: 698, baseType: !856, size: 32, offset: 9728)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !1282, file: !6, line: 699, baseType: !1334, size: 64, offset: 9760)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !1276, file: !6, line: 743, baseType: !1339, size: 64, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !6, line: 717, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !6, line: 711, size: 256, elements: !1342)
!1342 = !{!1343, !1344, !1345, !1346}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !1341, file: !6, line: 713, baseType: !1302, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !1341, file: !6, line: 714, baseType: !950, size: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !1341, file: !6, line: 715, baseType: !950, size: 64, offset: 128)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !1341, file: !6, line: 716, baseType: !856, size: 32, offset: 192)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !1276, file: !6, line: 744, baseType: !856, size: 32, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !1276, file: !6, line: 745, baseType: !856, size: 32, offset: 224)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !1276, file: !6, line: 751, baseType: !856, size: 32, offset: 256)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !1276, file: !6, line: 753, baseType: !1351, size: 32, offset: 288)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !691, line: 1688, baseType: !856)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !1276, file: !6, line: 754, baseType: !950, size: 64, offset: 320)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !1276, file: !6, line: 755, baseType: !862, size: 64, offset: 384)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !1276, file: !6, line: 757, baseType: !1290, size: 64, offset: 448)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !1276, file: !6, line: 758, baseType: !950, size: 64, offset: 512)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !1276, file: !6, line: 759, baseType: !950, size: 64, offset: 576)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !1276, file: !6, line: 760, baseType: !856, size: 32, offset: 640)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !1276, file: !6, line: 762, baseType: !1359, size: 64, offset: 704)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !6, line: 724, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !6, line: 720, size: 128, elements: !1362)
!1362 = !{!1363, !1364}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !1361, file: !6, line: 722, baseType: !856, size: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !1361, file: !6, line: 723, baseType: !910, size: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !1276, file: !6, line: 763, baseType: !856, size: 32, offset: 768)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !1276, file: !6, line: 764, baseType: !856, size: 32, offset: 800)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !1272, file: !6, line: 2634, baseType: !1270, size: 64, offset: 832)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !1272, file: !6, line: 2635, baseType: !1270, size: 64, offset: 896)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !1272, file: !6, line: 2637, baseType: !856, size: 32, offset: 960)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !1272, file: !6, line: 2639, baseType: !856, size: 32, offset: 992)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !1272, file: !6, line: 2640, baseType: !856, size: 32, offset: 1024)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !1272, file: !6, line: 2642, baseType: !856, size: 32, offset: 1056)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !1272, file: !6, line: 2651, baseType: !862, size: 64, offset: 1088)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !1272, file: !6, line: 2652, baseType: !862, size: 64, offset: 1152)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !1272, file: !6, line: 2654, baseType: !862, size: 64, offset: 1216)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !1272, file: !6, line: 2658, baseType: !856, size: 32, offset: 1280)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !1272, file: !6, line: 2659, baseType: !1378, size: 64, offset: 1344)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !1253, line: 59, baseType: !1379)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !909, line: 145, baseType: !935)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !1272, file: !6, line: 2660, baseType: !1381, size: 64, offset: 1408)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !1253, line: 47, baseType: !1382)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !909, line: 148, baseType: !935)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !1272, file: !6, line: 2667, baseType: !856, size: 32, offset: 1472)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !1272, file: !6, line: 2668, baseType: !1385, size: 72, offset: 1504)
!1385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 72, elements: !1386)
!1386 = !{!1387}
!1387 = !DISubrange(count: 9)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !1272, file: !6, line: 2672, baseType: !856, size: 32, offset: 1600)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !1272, file: !6, line: 2674, baseType: !1390, size: 320, offset: 1664)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !6, line: 1532, baseType: !1391)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !6, line: 1526, size: 320, elements: !1392)
!1392 = !{!1393, !1394, !1395}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !1391, file: !6, line: 1528, baseType: !1001, size: 128)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !1391, file: !6, line: 1529, baseType: !863, size: 8, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !1391, file: !6, line: 1530, baseType: !1396, size: 136, offset: 136)
!1396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 136, elements: !1397)
!1397 = !{!1398}
!1398 = !DISubrange(count: 17)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !1272, file: !6, line: 2679, baseType: !1011, size: 64, offset: 1984)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !1272, file: !6, line: 2681, baseType: !1011, size: 64, offset: 2048)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !1272, file: !6, line: 2684, baseType: !856, size: 32, offset: 2112)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !1272, file: !6, line: 2691, baseType: !856, size: 32, offset: 2144)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !1272, file: !6, line: 2693, baseType: !950, size: 64, offset: 2176)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !1272, file: !6, line: 2694, baseType: !950, size: 64, offset: 2240)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !1272, file: !6, line: 2696, baseType: !910, size: 64, offset: 2304)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !1272, file: !6, line: 2699, baseType: !1407, size: 64, offset: 2368)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !6, line: 60, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !6, line: 325, size: 11648, elements: !1410)
!1410 = !{!1411, !1412, !1413, !2206, !2207, !2208, !2209, !2210}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !1409, file: !6, line: 327, baseType: !1407, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !1409, file: !6, line: 328, baseType: !1407, size: 64, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !1409, file: !6, line: 329, baseType: !1414, size: 64, offset: 128)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !6, line: 59, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !6, line: 3365, size: 72064, elements: !1417)
!1417 = !{!1418, !1419, !1420, !1421, !1422, !1576, !1577, !1592, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1649, !1650, !1651, !1652, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1673, !1674, !1676, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1697, !1698, !1699, !1700, !1701, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1761, !1762, !1763, !1764, !1765, !2018, !2026, !2027, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2119, !2120, !2121, !2122, !2163, !2164, !2174, !2175, !2176, !2177, !2178, !2198, !2199, !2200, !2201, !2205}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !1416, file: !6, line: 3367, baseType: !856, size: 32)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !1416, file: !6, line: 3369, baseType: !1270, size: 64, offset: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !1416, file: !6, line: 3371, baseType: !1414, size: 64, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !1416, file: !6, line: 3372, baseType: !1414, size: 64, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !1416, file: !6, line: 3375, baseType: !1423, size: 64, offset: 256)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !6, line: 2618, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2542, size: 9920, elements: !1426)
!1426 = !{!1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1442, !1443, !1444, !1445, !1446, !1504, !1512, !1513, !1514, !1515, !1516, !1552, !1553, !1554, !1555, !1556, !1557, !1559, !1560, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1575}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !1425, file: !6, line: 2544, baseType: !1083, size: 2432)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !1425, file: !6, line: 2545, baseType: !1083, size: 2432, offset: 2432)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !1425, file: !6, line: 2546, baseType: !856, size: 32, offset: 4864)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !1425, file: !6, line: 2548, baseType: !856, size: 32, offset: 4896)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !1425, file: !6, line: 2550, baseType: !856, size: 32, offset: 4928)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !1425, file: !6, line: 2551, baseType: !856, size: 32, offset: 4960)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !1425, file: !6, line: 2552, baseType: !856, size: 32, offset: 4992)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !1425, file: !6, line: 2553, baseType: !866, size: 192, offset: 5056)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !1425, file: !6, line: 2554, baseType: !866, size: 192, offset: 5248)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !1425, file: !6, line: 2555, baseType: !856, size: 32, offset: 5440)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !1425, file: !6, line: 2556, baseType: !856, size: 32, offset: 5472)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !1425, file: !6, line: 2557, baseType: !856, size: 32, offset: 5504)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !1425, file: !6, line: 2559, baseType: !856, size: 32, offset: 5536)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !1425, file: !6, line: 2560, baseType: !1441, size: 16, offset: 5568)
!1441 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !1425, file: !6, line: 2561, baseType: !910, size: 64, offset: 5632)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !1425, file: !6, line: 2562, baseType: !910, size: 64, offset: 5696)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !1425, file: !6, line: 2563, baseType: !910, size: 64, offset: 5760)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !1425, file: !6, line: 2564, baseType: !862, size: 64, offset: 5824)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !1425, file: !6, line: 2565, baseType: !1447, size: 64, offset: 5888)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !1449, line: 56, baseType: !1450)
!1449 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !1449, line: 49, size: 192, elements: !1451)
!1451 = !{!1452, !1500, !1501, !1502, !1503}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !1450, file: !1449, line: 51, baseType: !1453, size: 64)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !1449, line: 42, baseType: !1455)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !1449, line: 167, size: 320, elements: !1456)
!1456 = !{!1457, !1461, !1465, !1480, !1499}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !1455, file: !1449, line: 169, baseType: !1458, size: 64)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!1447, !862, !856}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !1455, file: !1449, line: 170, baseType: !1462, size: 64, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{null, !1447}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !1455, file: !1449, line: 171, baseType: !1466, size: 64, offset: 128)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!856, !1469, !862, !1351, !856}
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !1449, line: 137, baseType: !1471)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1449, line: 131, size: 1408, elements: !1472)
!1472 = !{!1473, !1474, !1478, !1479}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !1471, file: !1449, line: 133, baseType: !1447, size: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !1471, file: !1449, line: 134, baseType: !1475, size: 640, offset: 64)
!1475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 640, elements: !1476)
!1476 = !{!1477}
!1477 = !DISubrange(count: 10)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !1471, file: !1449, line: 135, baseType: !1475, size: 640, offset: 704)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !1471, file: !1449, line: 136, baseType: !856, size: 32, offset: 1344)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !1455, file: !1449, line: 172, baseType: !1481, size: 64, offset: 192)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!910, !1484, !1414, !1270, !950, !1351, !1156, !1138}
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64)
!1485 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !1449, line: 154, baseType: !1486)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1449, line: 147, size: 2688, elements: !1487)
!1487 = !{!1488, !1489, !1496, !1497, !1498}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !1486, file: !1449, line: 149, baseType: !1447, size: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !1486, file: !1449, line: 150, baseType: !1490, size: 1280, offset: 64)
!1490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1491, size: 1280, elements: !1476)
!1491 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !6, line: 41, baseType: !1492)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 37, size: 128, elements: !1493)
!1493 = !{!1494, !1495}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !1492, file: !6, line: 39, baseType: !950, size: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1492, file: !6, line: 40, baseType: !1351, size: 32, offset: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !1486, file: !1449, line: 151, baseType: !1490, size: 1280, offset: 1344)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !1486, file: !1449, line: 152, baseType: !856, size: 32, offset: 2624)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !1486, file: !1449, line: 153, baseType: !1351, size: 32, offset: 2656)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1455, file: !1449, line: 173, baseType: !862, size: 64, offset: 256)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !1450, file: !1449, line: 52, baseType: !990, size: 32, offset: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !1450, file: !1449, line: 53, baseType: !990, size: 32, offset: 96)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !1450, file: !1449, line: 54, baseType: !990, size: 32, offset: 128)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !1450, file: !1449, line: 55, baseType: !856, size: 32, offset: 160)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !1425, file: !6, line: 2567, baseType: !1505, size: 384, offset: 5952)
!1505 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !6, line: 2475, baseType: !1506)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2470, size: 384, elements: !1507)
!1507 = !{!1508, !1509, !1510, !1511}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1506, file: !6, line: 2471, baseType: !1144, size: 128)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !1506, file: !6, line: 2472, baseType: !1144, size: 128, offset: 128)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1506, file: !6, line: 2473, baseType: !910, size: 64, offset: 256)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !1506, file: !6, line: 2474, baseType: !910, size: 64, offset: 320)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !1425, file: !6, line: 2569, baseType: !856, size: 32, offset: 6336)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !1425, file: !6, line: 2570, baseType: !856, size: 32, offset: 6368)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !1425, file: !6, line: 2572, baseType: !856, size: 32, offset: 6400)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !1425, file: !6, line: 2575, baseType: !856, size: 32, offset: 6432)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !1425, file: !6, line: 2592, baseType: !1517, size: 64, offset: 6464)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64)
!1518 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !6, line: 1061, baseType: !1519)
!1519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !6, line: 1063, size: 1728, elements: !1520)
!1520 = !{!1521, !1522, !1523, !1545, !1546, !1547, !1549, !1551}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !1519, file: !6, line: 1065, baseType: !1517, size: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !1519, file: !6, line: 1066, baseType: !950, size: 64, offset: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !1519, file: !6, line: 1071, baseType: !1524, size: 1344, offset: 128)
!1524 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1519, file: !6, line: 1067, size: 1344, elements: !1525)
!1525 = !{!1526, !1544}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !1524, file: !6, line: 1069, baseType: !1527, size: 1344)
!1527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1528, size: 1344, elements: !1542)
!1528 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !6, line: 1055, baseType: !1529)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !6, line: 1046, size: 192, elements: !1530)
!1530 = !{!1531, !1532, !1533, !1534, !1535}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !1529, file: !6, line: 1048, baseType: !856, size: 32)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !1529, file: !6, line: 1049, baseType: !856, size: 32, offset: 32)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !1529, file: !6, line: 1051, baseType: !856, size: 32, offset: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !1529, file: !6, line: 1052, baseType: !856, size: 32, offset: 96)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !1529, file: !6, line: 1054, baseType: !1536, size: 64, offset: 128)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64)
!1537 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !1449, line: 165, baseType: !1538)
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1449, line: 161, size: 704, elements: !1539)
!1539 = !{!1540, !1541}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1538, file: !1449, line: 163, baseType: !1441, size: 16)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !1538, file: !1449, line: 164, baseType: !1475, size: 640, offset: 64)
!1542 = !{!1543}
!1543 = !DISubrange(count: 7)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !1524, file: !6, line: 1070, baseType: !866, size: 192)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !1519, file: !6, line: 1072, baseType: !856, size: 32, offset: 1472)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !1519, file: !6, line: 1073, baseType: !856, size: 32, offset: 1504)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !1519, file: !6, line: 1074, baseType: !1548, size: 64, offset: 1536)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !1519, file: !6, line: 1076, baseType: !1550, size: 16, offset: 1600)
!1550 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !691, line: 1689, baseType: !912)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !1519, file: !6, line: 1077, baseType: !950, size: 64, offset: 1664)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !1425, file: !6, line: 2593, baseType: !856, size: 32, offset: 6528)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !1425, file: !6, line: 2594, baseType: !1517, size: 64, offset: 6592)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !1425, file: !6, line: 2595, baseType: !1517, size: 64, offset: 6656)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !1425, file: !6, line: 2596, baseType: !856, size: 32, offset: 6720)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !1425, file: !6, line: 2597, baseType: !950, size: 64, offset: 6784)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !1425, file: !6, line: 2598, baseType: !1558, size: 16, offset: 6848)
!1558 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !691, line: 325, baseType: !912)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !1425, file: !6, line: 2603, baseType: !866, size: 192, offset: 6912)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !1425, file: !6, line: 2604, baseType: !1561, size: 2048, offset: 7104)
!1561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 2048, elements: !1562)
!1562 = !{!1563}
!1563 = !DISubrange(count: 256)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !1425, file: !6, line: 2605, baseType: !862, size: 64, offset: 9152)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !1425, file: !6, line: 2606, baseType: !862, size: 64, offset: 9216)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !1425, file: !6, line: 2607, baseType: !1447, size: 64, offset: 9280)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !1425, file: !6, line: 2608, baseType: !862, size: 64, offset: 9344)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !1425, file: !6, line: 2609, baseType: !862, size: 64, offset: 9408)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !1425, file: !6, line: 2610, baseType: !862, size: 64, offset: 9472)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !1425, file: !6, line: 2611, baseType: !856, size: 32, offset: 9536)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !1425, file: !6, line: 2616, baseType: !1572, size: 256, offset: 9568)
!1572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 256, elements: !1573)
!1573 = !{!1574}
!1574 = !DISubrange(count: 32)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !1425, file: !6, line: 2617, baseType: !862, size: 64, offset: 9856)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !1416, file: !6, line: 3378, baseType: !856, size: 32, offset: 320)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !1416, file: !6, line: 3381, baseType: !1578, size: 64, offset: 384)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !6, line: 61, baseType: !1580)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !6, line: 3231, size: 512, elements: !1581)
!1581 = !{!1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !1580, file: !6, line: 3233, baseType: !889, size: 8)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !1580, file: !6, line: 3234, baseType: !856, size: 32, offset: 32)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !1580, file: !6, line: 3235, baseType: !856, size: 32, offset: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !1580, file: !6, line: 3236, baseType: !856, size: 32, offset: 96)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !1580, file: !6, line: 3237, baseType: !856, size: 32, offset: 128)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !1580, file: !6, line: 3238, baseType: !1578, size: 64, offset: 192)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !1580, file: !6, line: 3239, baseType: !1578, size: 64, offset: 256)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !1580, file: !6, line: 3241, baseType: !1578, size: 64, offset: 320)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !1580, file: !6, line: 3244, baseType: !1578, size: 64, offset: 384)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !1580, file: !6, line: 3245, baseType: !1414, size: 64, offset: 448)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !1416, file: !6, line: 3383, baseType: !1593, size: 128, offset: 448)
!1593 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !6, line: 31, baseType: !1594)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 26, size: 128, elements: !1595)
!1595 = !{!1596, !1597, !1598}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !1594, file: !6, line: 28, baseType: !950, size: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1594, file: !6, line: 29, baseType: !1351, size: 32, offset: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !1594, file: !6, line: 30, baseType: !1351, size: 32, offset: 96)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !1416, file: !6, line: 3385, baseType: !1351, size: 32, offset: 576)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !1416, file: !6, line: 3389, baseType: !856, size: 32, offset: 608)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !1416, file: !6, line: 3394, baseType: !950, size: 64, offset: 640)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !1416, file: !6, line: 3400, baseType: !889, size: 8, offset: 704)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !1416, file: !6, line: 3401, baseType: !950, size: 64, offset: 768)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !1416, file: !6, line: 3402, baseType: !1351, size: 32, offset: 832)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !1416, file: !6, line: 3403, baseType: !1351, size: 32, offset: 864)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !1416, file: !6, line: 3404, baseType: !950, size: 64, offset: 896)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !1416, file: !6, line: 3405, baseType: !1351, size: 32, offset: 960)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !1416, file: !6, line: 3406, baseType: !1351, size: 32, offset: 992)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !1416, file: !6, line: 3408, baseType: !1610, size: 352, offset: 1024)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !6, line: 3358, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3343, size: 352, elements: !1612)
!1612 = !{!1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !1611, file: !6, line: 3345, baseType: !856, size: 32)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1611, file: !6, line: 3346, baseType: !856, size: 32, offset: 32)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !1611, file: !6, line: 3347, baseType: !856, size: 32, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !1611, file: !6, line: 3348, baseType: !856, size: 32, offset: 96)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1611, file: !6, line: 3349, baseType: !856, size: 32, offset: 128)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !1611, file: !6, line: 3350, baseType: !856, size: 32, offset: 160)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !1611, file: !6, line: 3351, baseType: !856, size: 32, offset: 192)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !1611, file: !6, line: 3352, baseType: !856, size: 32, offset: 224)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !1611, file: !6, line: 3353, baseType: !856, size: 32, offset: 256)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !1611, file: !6, line: 3354, baseType: !856, size: 32, offset: 288)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !1611, file: !6, line: 3356, baseType: !856, size: 32, offset: 320)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !1416, file: !6, line: 3414, baseType: !950, size: 64, offset: 1408)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !1416, file: !6, line: 3416, baseType: !889, size: 8, offset: 1472)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !1416, file: !6, line: 3419, baseType: !950, size: 64, offset: 1536)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !1416, file: !6, line: 3423, baseType: !856, size: 32, offset: 1600)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !1416, file: !6, line: 3424, baseType: !856, size: 32, offset: 1632)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !1416, file: !6, line: 3425, baseType: !856, size: 32, offset: 1664)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !1416, file: !6, line: 3427, baseType: !856, size: 32, offset: 1696)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !1416, file: !6, line: 3429, baseType: !1351, size: 32, offset: 1728)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !1416, file: !6, line: 3432, baseType: !1351, size: 32, offset: 1760)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !1416, file: !6, line: 3435, baseType: !856, size: 32, offset: 1792)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !1416, file: !6, line: 3437, baseType: !856, size: 32, offset: 1824)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !1416, file: !6, line: 3445, baseType: !856, size: 32, offset: 1856)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !1416, file: !6, line: 3446, baseType: !856, size: 32, offset: 1888)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !1416, file: !6, line: 3449, baseType: !856, size: 32, offset: 1920)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !1416, file: !6, line: 3450, baseType: !856, size: 32, offset: 1952)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !1416, file: !6, line: 3451, baseType: !856, size: 32, offset: 1984)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !1416, file: !6, line: 3452, baseType: !856, size: 32, offset: 2016)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !1416, file: !6, line: 3454, baseType: !1642, size: 320, offset: 2048)
!1642 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !6, line: 3330, baseType: !1643)
!1643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3324, size: 320, elements: !1644)
!1644 = !{!1645, !1646, !1647, !1648}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !1643, file: !6, line: 3326, baseType: !856, size: 32)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !1643, file: !6, line: 3327, baseType: !856, size: 32, offset: 32)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !1643, file: !6, line: 3328, baseType: !1593, size: 128, offset: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !1643, file: !6, line: 3329, baseType: !1593, size: 128, offset: 192)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !1416, file: !6, line: 3457, baseType: !856, size: 32, offset: 2368)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !1416, file: !6, line: 3458, baseType: !856, size: 32, offset: 2400)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !1416, file: !6, line: 3459, baseType: !862, size: 64, offset: 2432)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !1416, file: !6, line: 3460, baseType: !1653, size: 32, offset: 2496)
!1653 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !6, line: 2524, baseType: !49)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !1416, file: !6, line: 3461, baseType: !856, size: 32, offset: 2528)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !1416, file: !6, line: 3462, baseType: !856, size: 32, offset: 2560)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !1416, file: !6, line: 3463, baseType: !1414, size: 64, offset: 2624)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !1416, file: !6, line: 3464, baseType: !856, size: 32, offset: 2688)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !1416, file: !6, line: 3465, baseType: !856, size: 32, offset: 2720)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !1416, file: !6, line: 3466, baseType: !856, size: 32, offset: 2752)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !1416, file: !6, line: 3467, baseType: !856, size: 32, offset: 2784)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !1416, file: !6, line: 3468, baseType: !856, size: 32, offset: 2816)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !1416, file: !6, line: 3469, baseType: !856, size: 32, offset: 2848)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !1416, file: !6, line: 3470, baseType: !856, size: 32, offset: 2880)
