; ModuleID = 'ex_docmd.c'
source_filename = "ex_docmd.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.typebuf_T = type { i8*, i8*, i32, i32, i32, i32, i32, i32, i32 }

!1009 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SpecialKey", file: !708, line: 26, size: 32, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097}
!1011 = !DIEnumerator(name: "KS_NAME", value: 0)
!1012 = !DIEnumerator(name: "KS_CE", value: 1)
!1013 = !DIEnumerator(name: "KS_AL", value: 2)
!1014 = !DIEnumerator(name: "KS_CAL", value: 3)
!1015 = !DIEnumerator(name: "KS_DL", value: 4)
!1016 = !DIEnumerator(name: "KS_CDL", value: 5)
!1017 = !DIEnumerator(name: "KS_CS", value: 6)
!1018 = !DIEnumerator(name: "KS_CL", value: 7)
!1019 = !DIEnumerator(name: "KS_CD", value: 8)
!1020 = !DIEnumerator(name: "KS_UT", value: 9)
!1021 = !DIEnumerator(name: "KS_DA", value: 10)
!1022 = !DIEnumerator(name: "KS_DB", value: 11)
!1023 = !DIEnumerator(name: "KS_VI", value: 12)
!1024 = !DIEnumerator(name: "KS_VE", value: 13)
!1025 = !DIEnumerator(name: "KS_VS", value: 14)
!1026 = !DIEnumerator(name: "KS_CVS", value: 15)
!1027 = !DIEnumerator(name: "KS_CSH", value: 16)
!1028 = !DIEnumerator(name: "KS_CRC", value: 17)
!1029 = !DIEnumerator(name: "KS_CRS", value: 18)
!1030 = !DIEnumerator(name: "KS_ME", value: 19)
!1031 = !DIEnumerator(name: "KS_MR", value: 20)
!1032 = !DIEnumerator(name: "KS_MD", value: 21)
!1033 = !DIEnumerator(name: "KS_SE", value: 22)
!1034 = !DIEnumerator(name: "KS_SO", value: 23)
!1035 = !DIEnumerator(name: "KS_CZH", value: 24)
!1036 = !DIEnumerator(name: "KS_CZR", value: 25)
!1037 = !DIEnumerator(name: "KS_UE", value: 26)
!1038 = !DIEnumerator(name: "KS_US", value: 27)
!1039 = !DIEnumerator(name: "KS_UCE", value: 28)
!1040 = !DIEnumerator(name: "KS_UCS", value: 29)
!1041 = !DIEnumerator(name: "KS_STE", value: 30)
!1042 = !DIEnumerator(name: "KS_STS", value: 31)
!1043 = !DIEnumerator(name: "KS_MS", value: 32)
!1044 = !DIEnumerator(name: "KS_CM", value: 33)
!1045 = !DIEnumerator(name: "KS_SR", value: 34)
!1046 = !DIEnumerator(name: "KS_CRI", value: 35)
!1047 = !DIEnumerator(name: "KS_VB", value: 36)
!1048 = !DIEnumerator(name: "KS_KS", value: 37)
!1049 = !DIEnumerator(name: "KS_KE", value: 38)
!1050 = !DIEnumerator(name: "KS_TI", value: 39)
!1051 = !DIEnumerator(name: "KS_CTI", value: 40)
!1052 = !DIEnumerator(name: "KS_TE", value: 41)
!1053 = !DIEnumerator(name: "KS_CTE", value: 42)
!1054 = !DIEnumerator(name: "KS_BC", value: 43)
!1055 = !DIEnumerator(name: "KS_CCS", value: 44)
!1056 = !DIEnumerator(name: "KS_CCO", value: 45)
!1057 = !DIEnumerator(name: "KS_CSF", value: 46)
!1058 = !DIEnumerator(name: "KS_CSB", value: 47)
!1059 = !DIEnumerator(name: "KS_XS", value: 48)
!1060 = !DIEnumerator(name: "KS_XN", value: 49)
!1061 = !DIEnumerator(name: "KS_MB", value: 50)
!1062 = !DIEnumerator(name: "KS_CAF", value: 51)
!1063 = !DIEnumerator(name: "KS_CAB", value: 52)
!1064 = !DIEnumerator(name: "KS_CAU", value: 53)
!1065 = !DIEnumerator(name: "KS_LE", value: 54)
!1066 = !DIEnumerator(name: "KS_ND", value: 55)
!1067 = !DIEnumerator(name: "KS_CIS", value: 56)
!1068 = !DIEnumerator(name: "KS_CIE", value: 57)
!1069 = !DIEnumerator(name: "KS_CSC", value: 58)
!1070 = !DIEnumerator(name: "KS_CEC", value: 59)
!1071 = !DIEnumerator(name: "KS_TS", value: 60)
!1072 = !DIEnumerator(name: "KS_FS", value: 61)
!1073 = !DIEnumerator(name: "KS_CWP", value: 62)
!1074 = !DIEnumerator(name: "KS_CGP", value: 63)
!1075 = !DIEnumerator(name: "KS_CWS", value: 64)
!1076 = !DIEnumerator(name: "KS_CRV", value: 65)
!1077 = !DIEnumerator(name: "KS_RFG", value: 66)
!1078 = !DIEnumerator(name: "KS_RBG", value: 67)
!1079 = !DIEnumerator(name: "KS_CSI", value: 68)
!1080 = !DIEnumerator(name: "KS_CEI", value: 69)
!1081 = !DIEnumerator(name: "KS_CSR", value: 70)
!1082 = !DIEnumerator(name: "KS_CSV", value: 71)
!1083 = !DIEnumerator(name: "KS_OP", value: 72)
!1084 = !DIEnumerator(name: "KS_U7", value: 73)
!1085 = !DIEnumerator(name: "KS_8F", value: 74)
!1086 = !DIEnumerator(name: "KS_8B", value: 75)
!1087 = !DIEnumerator(name: "KS_8U", value: 76)
!1088 = !DIEnumerator(name: "KS_CBE", value: 77)
!1089 = !DIEnumerator(name: "KS_CBD", value: 78)
!1090 = !DIEnumerator(name: "KS_CPS", value: 79)
!1091 = !DIEnumerator(name: "KS_CPE", value: 80)
!1092 = !DIEnumerator(name: "KS_CST", value: 81)
!1093 = !DIEnumerator(name: "KS_CRT", value: 82)
!1094 = !DIEnumerator(name: "KS_SSI", value: 83)
!1095 = !DIEnumerator(name: "KS_SRI", value: 84)
!1096 = !DIEnumerator(name: "KS_FD", value: 85)
!1097 = !DIEnumerator(name: "KS_FE", value: 86)
!1098 = !{!1099, !1101, !1102, !1136, !1122, !1139, !2850, !2856, !1397, !2694, !2868, !1144, !1160, !1306, !2869, !1649, !2751, !1440, !2907}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "cstack_T", file: !6, line: 921, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 904, size: 12672, elements: !1105)
!1105 = !{!1106, !1111, !1113, !1119, !1120, !1123, !1124, !1125, !1126, !1127, !1128, !1135}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "cs_flags", scope: !1104, file: !6, line: 905, baseType: !1107, size: 800)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1108, size: 800, elements: !1109)
!1108 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1109 = !{!1110}
!1110 = !DISubrange(count: 50)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "cs_pending", scope: !1104, file: !6, line: 906, baseType: !1112, size: 400, offset: 800)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1100, size: 400, elements: !1109)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "cs_pend", scope: !1104, file: !6, line: 910, baseType: !1114, size: 3200, offset: 1216)
!1114 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1104, file: !6, line: 907, size: 3200, elements: !1115)
!1115 = !{!1116, !1118}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "csp_rv", scope: !1114, file: !6, line: 908, baseType: !1117, size: 3200)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 3200, elements: !1109)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "csp_ex", scope: !1114, file: !6, line: 909, baseType: !1117, size: 3200)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "cs_forinfo", scope: !1104, file: !6, line: 911, baseType: !1117, size: 3200, offset: 4416)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "cs_line", scope: !1104, file: !6, line: 912, baseType: !1121, size: 1600, offset: 7616)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 1600, elements: !1109)
!1122 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "cs_block_id", scope: !1104, file: !6, line: 913, baseType: !1121, size: 1600, offset: 9216)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "cs_script_var_len", scope: !1104, file: !6, line: 914, baseType: !1121, size: 1600, offset: 10816)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "cs_idx", scope: !1104, file: !6, line: 916, baseType: !1122, size: 32, offset: 12416)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "cs_looplevel", scope: !1104, file: !6, line: 917, baseType: !1122, size: 32, offset: 12448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "cs_trylevel", scope: !1104, file: !6, line: 918, baseType: !1122, size: 32, offset: 12480)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "cs_emsg_silent_list", scope: !1104, file: !6, line: 919, baseType: !1129, size: 64, offset: 12544)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "eslist_T", file: !6, line: 891, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eslist_elem", file: !6, line: 892, size: 128, elements: !1132)
!1132 = !{!1133, !1134}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "saved_emsg_silent", scope: !1131, file: !6, line: 894, baseType: !1122, size: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1131, file: !6, line: 895, baseType: !1129, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "cs_lflags", scope: !1104, file: !6, line: 920, baseType: !1100, size: 8, offset: 12608)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !715, line: 324, baseType: !1138)
!1138 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "estack_T", file: !6, line: 2050, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2035, size: 448, elements: !1142)
!1142 = !{!1143, !1145, !1146, !1148, !2849}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "es_lnum", scope: !1141, file: !6, line: 2036, baseType: !1144, size: 64)
!1144 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "es_name", scope: !1141, file: !6, line: 2037, baseType: !1136, size: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "es_type", scope: !1141, file: !6, line: 2038, baseType: !1147, size: 32, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "etype_T", file: !6, line: 2033, baseType: !17)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "es_info", scope: !1141, file: !6, line: 2046, baseType: !1149, size: 64, offset: 192)
!1149 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1141, file: !6, line: 2039, size: 64, elements: !1150)
!1150 = !{!1151, !1162, !2822, !2826}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "sctx", scope: !1149, file: !6, line: 2040, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !6, line: 92, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 85, size: 192, elements: !1155)
!1155 = !{!1156, !1158, !1159, !1161}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !1154, file: !6, line: 87, baseType: !1157, size: 32)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !6, line: 62, baseType: !1122)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !1154, file: !6, line: 88, baseType: !1122, size: 32, offset: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !1154, file: !6, line: 89, baseType: !1160, size: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !715, line: 1687, baseType: !1144)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !1154, file: !6, line: 91, baseType: !1122, size: 32, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ufunc", scope: !1149, file: !6, line: 2042, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !6, line: 1658, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1597, size: 3072, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1170, !1171, !1173, !1174, !1183, !1184, !1199, !1200, !1201, !2763, !2764, !2765, !2766, !2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781, !2782, !2783, !2784, !2785, !2786, !2819, !2820}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !1165, file: !6, line: 1599, baseType: !1122, size: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !1165, file: !6, line: 1600, baseType: !1122, size: 32, offset: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !1165, file: !6, line: 1601, baseType: !1122, size: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !1165, file: !6, line: 1602, baseType: !1122, size: 32, offset: 96)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !1165, file: !6, line: 1603, baseType: !1172, size: 32, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !6, line: 1591, baseType: !29)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !1165, file: !6, line: 1604, baseType: !1122, size: 32, offset: 160)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !1165, file: !6, line: 1605, baseType: !1175, size: 192, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !6, line: 55, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !6, line: 48, size: 192, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1182}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !1176, file: !6, line: 50, baseType: !1122, size: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !1176, file: !6, line: 51, baseType: !1122, size: 32, offset: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !1176, file: !6, line: 52, baseType: !1122, size: 32, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !1176, file: !6, line: 53, baseType: !1122, size: 32, offset: 96)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !1176, file: !6, line: 54, baseType: !1101, size: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !1165, file: !6, line: 1606, baseType: !1175, size: 192, offset: 384)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !1165, file: !6, line: 1609, baseType: !1185, size: 64, offset: 576)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !6, line: 1394, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !6, line: 1395, size: 192, elements: !1189)
!1189 = !{!1190, !1192, !1195, !1196, !1197, !1198}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !1188, file: !6, line: 1396, baseType: !1191, size: 32)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !6, line: 1391, baseType: !36)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !1188, file: !6, line: 1397, baseType: !1193, size: 8, offset: 32)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !6, line: 1342, baseType: !1194)
!1194 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !1188, file: !6, line: 1398, baseType: !1100, size: 8, offset: 40)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !1188, file: !6, line: 1399, baseType: !1100, size: 8, offset: 48)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !1188, file: !6, line: 1400, baseType: !1186, size: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !1188, file: !6, line: 1401, baseType: !1185, size: 64, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !1165, file: !6, line: 1610, baseType: !1186, size: 64, offset: 640)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !1165, file: !6, line: 1611, baseType: !1175, size: 192, offset: 704)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !1165, file: !6, line: 1612, baseType: !1202, size: 64, offset: 896)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !6, line: 1348, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !6, line: 1994, size: 832, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1209, !1210, !1220, !1230, !1231, !2761, !2762}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !1204, file: !6, line: 1996, baseType: !1122, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !1204, file: !6, line: 1997, baseType: !1136, size: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !1204, file: !6, line: 1999, baseType: !1163, size: 64, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pt_auto", scope: !1204, file: !6, line: 2001, baseType: !1122, size: 32, offset: 192)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pt_outer", scope: !1204, file: !6, line: 2005, baseType: !1211, size: 256, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "outer_T", file: !6, line: 1986, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_S", file: !6, line: 1987, size: 256, elements: !1213)
!1213 = !{!1214, !1216, !1217, !1219}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "out_stack", scope: !1212, file: !6, line: 1988, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame_idx", scope: !1212, file: !6, line: 1989, baseType: !1122, size: 32, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "out_up", scope: !1212, file: !6, line: 1990, baseType: !1218, size: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "out_up_is_copy", scope: !1212, file: !6, line: 1991, baseType: !1122, size: 32, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pt_funcstack", scope: !1204, file: !6, line: 2007, baseType: !1221, size: 64, offset: 512)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "funcstack_T", file: !6, line: 1984, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcstack_S", file: !6, line: 1972, size: 320, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1229}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ga", scope: !1223, file: !6, line: 1974, baseType: !1175, size: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "fs_var_offset", scope: !1223, file: !6, line: 1978, baseType: !1122, size: 32, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "fs_refcount", scope: !1223, file: !6, line: 1981, baseType: !1122, size: 32, offset: 224)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "fs_min_refcount", scope: !1223, file: !6, line: 1982, baseType: !1122, size: 32, offset: 256)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "fs_copyID", scope: !1223, file: !6, line: 1983, baseType: !1122, size: 32, offset: 288)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argc", scope: !1204, file: !6, line: 2010, baseType: !1122, size: 32, offset: 576)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argv", scope: !1204, file: !6, line: 2011, baseType: !1232, size: 64, offset: 640)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !6, line: 1432, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1412, size: 128, elements: !1235)
!1235 = !{!1236, !1237, !1238}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !1234, file: !6, line: 1414, baseType: !1191, size: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !1234, file: !6, line: 1415, baseType: !1100, size: 8, offset: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !1234, file: !6, line: 1431, baseType: !1239, size: 64, offset: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1234, file: !6, line: 1416, size: 64, elements: !1240)
!1240 = !{!1241, !1244, !1247, !1248, !1292, !1328, !1329, !2752, !2753}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !1239, file: !6, line: 1418, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !6, line: 1327, baseType: !1243)
!1243 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !1239, file: !6, line: 1420, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !6, line: 1344, baseType: !1246)
!1246 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !1239, file: !6, line: 1422, baseType: !1136, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !1239, file: !6, line: 1423, baseType: !1249, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !6, line: 1346, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !6, line: 1471, size: 768, elements: !1252)
!1252 = !{!1253, !1261, !1268, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !1251, file: !6, line: 1473, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !6, line: 1446, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !6, line: 1448, size: 256, elements: !1257)
!1257 = !{!1258, !1259, !1260}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !1256, file: !6, line: 1450, baseType: !1254, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !1256, file: !6, line: 1451, baseType: !1254, size: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !1256, file: !6, line: 1452, baseType: !1233, size: 128, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !1251, file: !6, line: 1474, baseType: !1262, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !6, line: 1456, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !6, line: 1458, size: 128, elements: !1265)
!1265 = !{!1266, !1267}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !1264, file: !6, line: 1460, baseType: !1254, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !1264, file: !6, line: 1461, baseType: !1262, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !1251, file: !6, line: 1487, baseType: !1269, size: 192, offset: 128)
!1269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1251, file: !6, line: 1475, size: 192, elements: !1270)
!1270 = !{!1271, !1277}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !1269, file: !6, line: 1481, baseType: !1272, size: 192)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1269, file: !6, line: 1476, size: 192, elements: !1273)
!1273 = !{!1274, !1275, !1276}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !1272, file: !6, line: 1478, baseType: !1242, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !1272, file: !6, line: 1479, baseType: !1242, size: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !1272, file: !6, line: 1480, baseType: !1122, size: 32, offset: 128)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1269, file: !6, line: 1486, baseType: !1278, size: 192)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1269, file: !6, line: 1482, size: 192, elements: !1279)
!1279 = !{!1280, !1281, !1282}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !1278, file: !6, line: 1483, baseType: !1254, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !1278, file: !6, line: 1484, baseType: !1254, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !1278, file: !6, line: 1485, baseType: !1122, size: 32, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !1251, file: !6, line: 1488, baseType: !1186, size: 64, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !1251, file: !6, line: 1489, baseType: !1249, size: 64, offset: 384)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !1251, file: !6, line: 1490, baseType: !1249, size: 64, offset: 448)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !1251, file: !6, line: 1491, baseType: !1249, size: 64, offset: 512)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !1251, file: !6, line: 1492, baseType: !1122, size: 32, offset: 576)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !1251, file: !6, line: 1493, baseType: !1122, size: 32, offset: 608)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !1251, file: !6, line: 1494, baseType: !1122, size: 32, offset: 640)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !1251, file: !6, line: 1496, baseType: !1122, size: 32, offset: 672)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !1251, file: !6, line: 1497, baseType: !1100, size: 8, offset: 704)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !1239, file: !6, line: 1424, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !6, line: 1347, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !6, line: 1545, size: 2816, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300, !1301, !1324, !1325, !1326, !1327}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !1295, file: !6, line: 1547, baseType: !1100, size: 8)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !1295, file: !6, line: 1548, baseType: !1100, size: 8, offset: 8)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !1295, file: !6, line: 1549, baseType: !1122, size: 32, offset: 32)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !1295, file: !6, line: 1550, baseType: !1122, size: 32, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !1295, file: !6, line: 1551, baseType: !1302, size: 2432, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !6, line: 1290, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !6, line: 1277, size: 2432, elements: !1304)
!1304 = !{!1305, !1308, !1309, !1310, !1311, !1312, !1313, !1320}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !1303, file: !6, line: 1279, baseType: !1306, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !715, line: 345, baseType: !1307)
!1307 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !1303, file: !6, line: 1281, baseType: !1306, size: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !1303, file: !6, line: 1282, baseType: !1306, size: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !1303, file: !6, line: 1283, baseType: !1122, size: 32, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !1303, file: !6, line: 1284, baseType: !1122, size: 32, offset: 224)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !1303, file: !6, line: 1285, baseType: !1122, size: 32, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !1303, file: !6, line: 1287, baseType: !1314, size: 64, offset: 320)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !6, line: 1265, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !6, line: 1261, size: 128, elements: !1317)
!1317 = !{!1318, !1319}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !1316, file: !6, line: 1263, baseType: !1306, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !1316, file: !6, line: 1264, baseType: !1136, size: 64, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !1303, file: !6, line: 1289, baseType: !1321, size: 2048, offset: 384)
!1321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1315, size: 2048, elements: !1322)
!1322 = !{!1323}
!1323 = !DISubrange(count: 16)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !1295, file: !6, line: 1552, baseType: !1186, size: 64, offset: 2560)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !1295, file: !6, line: 1553, baseType: !1293, size: 64, offset: 2624)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !1295, file: !6, line: 1554, baseType: !1293, size: 64, offset: 2688)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !1295, file: !6, line: 1555, baseType: !1293, size: 64, offset: 2752)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !1239, file: !6, line: 1425, baseType: !1202, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !1239, file: !6, line: 1427, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !6, line: 1365, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !6, line: 2072, size: 1024, elements: !1333)
!1333 = !{!1334, !1335, !1336, !1341, !1342, !1343, !1345, !1346, !1347, !1348, !1355, !2650, !2651, !2652, !2750}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !1332, file: !6, line: 2074, baseType: !1330, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !1332, file: !6, line: 2075, baseType: !1330, size: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !1332, file: !6, line: 2077, baseType: !1337, size: 32, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !1338, line: 97, baseType: !1339)
!1338 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !1340, line: 154, baseType: !1122)
!1340 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !1332, file: !6, line: 2083, baseType: !1136, size: 64, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !1332, file: !6, line: 2084, baseType: !1136, size: 64, offset: 256)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !1332, file: !6, line: 2085, baseType: !1344, size: 32, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !6, line: 2067, baseType: !53)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !1332, file: !6, line: 2086, baseType: !1136, size: 64, offset: 384)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !1332, file: !6, line: 2088, baseType: !1136, size: 64, offset: 448)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !1332, file: !6, line: 2093, baseType: !1122, size: 32, offset: 512)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !1332, file: !6, line: 2094, baseType: !1349, size: 192, offset: 576)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !6, line: 1360, baseType: !1350)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1356, size: 192, elements: !1351)
!1351 = !{!1352, !1353, !1354}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !1350, file: !6, line: 1357, baseType: !1136, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !1350, file: !6, line: 1358, baseType: !1202, size: 64, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !1350, file: !6, line: 1359, baseType: !1122, size: 32, offset: 128)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !1332, file: !6, line: 2096, baseType: !1356, size: 64, offset: 768)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !6, line: 63, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !6, line: 2629, size: 73152, elements: !1359)
!1359 = !{!1360, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1469, !1472, !1473, !1477, !1478, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !2323, !2324, !2325, !2330, !2331, !2332, !2336, !2344, !2345, !2346, !2347, !2348, !2350, !2351, !2352, !2353, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553, !2554, !2555, !2556, !2557, !2558, !2559, !2560, !2561, !2562, !2563, !2564, !2565, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2587, !2588, !2589, !2597, !2598, !2599, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2609, !2610, !2611, !2612, !2613, !2614, !2633, !2634, !2635, !2636, !2637, !2644, !2645, !2649}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !1358, file: !6, line: 2631, baseType: !1361, size: 832)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !6, line: 766, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !6, line: 737, size: 832, elements: !1363)
!1363 = !{!1364, !1365, !1427, !1436, !1437, !1438, !1439, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1454, !1455}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !1362, file: !6, line: 739, baseType: !1160, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !1362, file: !6, line: 741, baseType: !1366, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !6, line: 459, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !6, line: 671, size: 9856, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1373, !1374, !1375, !1394, !1395, !1396, !1398, !1399, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1424, !1425, !1426}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !1368, file: !6, line: 673, baseType: !1136, size: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !1368, file: !6, line: 674, baseType: !1136, size: 64, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !1368, file: !6, line: 675, baseType: !1122, size: 32, offset: 128)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !1368, file: !6, line: 676, baseType: !1122, size: 32, offset: 160)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !1368, file: !6, line: 677, baseType: !1122, size: 32, offset: 192)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !1368, file: !6, line: 678, baseType: !1376, size: 64, offset: 256)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !6, line: 458, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !6, line: 506, size: 448, elements: !1379)
!1379 = !{!1380, !1389, !1390, !1391, !1392, !1393}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !1378, file: !6, line: 508, baseType: !1381, size: 192)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !6, line: 469, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !6, line: 471, size: 192, elements: !1383)
!1383 = !{!1384, !1386, !1387}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !1382, file: !6, line: 473, baseType: !1385, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !1382, file: !6, line: 474, baseType: !1385, size: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !1382, file: !6, line: 475, baseType: !1388, size: 64, offset: 128)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !6, line: 460, baseType: !1144)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !1378, file: !6, line: 511, baseType: !1376, size: 64, offset: 192)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !1378, file: !6, line: 512, baseType: !1376, size: 64, offset: 256)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !1378, file: !6, line: 513, baseType: !1136, size: 64, offset: 320)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !1378, file: !6, line: 514, baseType: !1122, size: 32, offset: 384)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !1378, file: !6, line: 518, baseType: !1100, size: 8, offset: 416)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !1368, file: !6, line: 679, baseType: !1376, size: 64, offset: 320)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !1368, file: !6, line: 680, baseType: !1376, size: 64, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !1368, file: !6, line: 681, baseType: !1397, size: 32, offset: 448)
!1397 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !1368, file: !6, line: 682, baseType: !1397, size: 32, offset: 480)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !1368, file: !6, line: 683, baseType: !1400, size: 4352, offset: 512)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !6, line: 489, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !6, line: 480, size: 4352, elements: !1402)
!1402 = !{!1403, !1404, !1405, !1407, !1411}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !1401, file: !6, line: 482, baseType: !1306, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !1401, file: !6, line: 484, baseType: !1306, size: 64, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !1401, file: !6, line: 485, baseType: !1406, size: 64, offset: 128)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !1401, file: !6, line: 487, baseType: !1408, size: 4096, offset: 192)
!1408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1385, size: 4096, elements: !1409)
!1409 = !{!1410}
!1410 = !DISubrange(count: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !1401, file: !6, line: 488, baseType: !1100, size: 8, offset: 4288)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !1368, file: !6, line: 684, baseType: !1400, size: 4352, offset: 4864)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !1368, file: !6, line: 685, baseType: !1388, size: 64, offset: 9216)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !1368, file: !6, line: 686, baseType: !1388, size: 64, offset: 9280)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !1368, file: !6, line: 687, baseType: !1388, size: 64, offset: 9344)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !1368, file: !6, line: 688, baseType: !1388, size: 64, offset: 9408)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !1368, file: !6, line: 689, baseType: !1397, size: 32, offset: 9472)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !1368, file: !6, line: 690, baseType: !1122, size: 32, offset: 9504)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !1368, file: !6, line: 692, baseType: !1356, size: 64, offset: 9536)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !1368, file: !6, line: 693, baseType: !1421, size: 64, offset: 9600)
!1421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 64, elements: !1422)
!1422 = !{!1423}
!1423 = !DISubrange(count: 8)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !1368, file: !6, line: 697, baseType: !1136, size: 64, offset: 9664)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !1368, file: !6, line: 698, baseType: !1122, size: 32, offset: 9728)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !1368, file: !6, line: 699, baseType: !1421, size: 64, offset: 9760)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !1362, file: !6, line: 743, baseType: !1428, size: 64, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !6, line: 717, baseType: !1430)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !6, line: 711, size: 256, elements: !1431)
!1431 = !{!1432, !1433, !1434, !1435}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !1430, file: !6, line: 713, baseType: !1388, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !1430, file: !6, line: 714, baseType: !1160, size: 64, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !1430, file: !6, line: 715, baseType: !1160, size: 64, offset: 128)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !1430, file: !6, line: 716, baseType: !1122, size: 32, offset: 192)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !1362, file: !6, line: 744, baseType: !1122, size: 32, offset: 192)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !1362, file: !6, line: 745, baseType: !1122, size: 32, offset: 224)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !1362, file: !6, line: 751, baseType: !1122, size: 32, offset: 256)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !1362, file: !6, line: 753, baseType: !1440, size: 32, offset: 288)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !715, line: 1688, baseType: !1122)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !1362, file: !6, line: 754, baseType: !1160, size: 64, offset: 320)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !1362, file: !6, line: 755, baseType: !1136, size: 64, offset: 384)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !1362, file: !6, line: 757, baseType: !1376, size: 64, offset: 448)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !1362, file: !6, line: 758, baseType: !1160, size: 64, offset: 512)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !1362, file: !6, line: 759, baseType: !1160, size: 64, offset: 576)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !1362, file: !6, line: 760, baseType: !1122, size: 32, offset: 640)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !1362, file: !6, line: 762, baseType: !1448, size: 64, offset: 704)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !6, line: 724, baseType: !1450)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !6, line: 720, size: 128, elements: !1451)
!1451 = !{!1452, !1453}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !1450, file: !6, line: 722, baseType: !1122, size: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !1450, file: !6, line: 723, baseType: !1144, size: 64, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !1362, file: !6, line: 763, baseType: !1122, size: 32, offset: 768)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !1362, file: !6, line: 764, baseType: !1122, size: 32, offset: 800)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !1358, file: !6, line: 2634, baseType: !1356, size: 64, offset: 832)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !1358, file: !6, line: 2635, baseType: !1356, size: 64, offset: 896)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !1358, file: !6, line: 2637, baseType: !1122, size: 32, offset: 960)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !1358, file: !6, line: 2639, baseType: !1122, size: 32, offset: 992)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !1358, file: !6, line: 2640, baseType: !1122, size: 32, offset: 1024)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !1358, file: !6, line: 2642, baseType: !1122, size: 32, offset: 1056)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !1358, file: !6, line: 2651, baseType: !1136, size: 64, offset: 1088)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !1358, file: !6, line: 2652, baseType: !1136, size: 64, offset: 1152)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !1358, file: !6, line: 2654, baseType: !1136, size: 64, offset: 1216)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !1358, file: !6, line: 2658, baseType: !1122, size: 32, offset: 1280)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !1358, file: !6, line: 2659, baseType: !1467, size: 64, offset: 1344)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !1338, line: 59, baseType: !1468)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !1340, line: 145, baseType: !1307)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !1358, file: !6, line: 2660, baseType: !1470, size: 64, offset: 1408)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !1338, line: 47, baseType: !1471)
!1471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !1340, line: 148, baseType: !1307)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !1358, file: !6, line: 2667, baseType: !1122, size: 32, offset: 1472)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !1358, file: !6, line: 2668, baseType: !1474, size: 72, offset: 1504)
!1474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 72, elements: !1475)
!1475 = !{!1476}
!1476 = !DISubrange(count: 9)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !1358, file: !6, line: 2672, baseType: !1122, size: 32, offset: 1600)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !1358, file: !6, line: 2674, baseType: !1479, size: 320, offset: 1664)
!1479 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !6, line: 1532, baseType: !1480)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !6, line: 1526, size: 320, elements: !1481)
!1481 = !{!1482, !1483, !1484}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !1480, file: !6, line: 1528, baseType: !1233, size: 128)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !1480, file: !6, line: 1529, baseType: !1137, size: 8, offset: 128)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !1480, file: !6, line: 1530, baseType: !1485, size: 136, offset: 136)
!1485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 136, elements: !1486)
!1486 = !{!1487}
!1487 = !DISubrange(count: 17)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !1358, file: !6, line: 2679, baseType: !1242, size: 64, offset: 1984)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !1358, file: !6, line: 2681, baseType: !1242, size: 64, offset: 2048)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !1358, file: !6, line: 2684, baseType: !1122, size: 32, offset: 2112)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !1358, file: !6, line: 2691, baseType: !1122, size: 32, offset: 2144)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !1358, file: !6, line: 2693, baseType: !1160, size: 64, offset: 2176)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !1358, file: !6, line: 2694, baseType: !1160, size: 64, offset: 2240)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !1358, file: !6, line: 2696, baseType: !1144, size: 64, offset: 2304)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !1358, file: !6, line: 2699, baseType: !1496, size: 64, offset: 2368)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !6, line: 60, baseType: !1498)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !6, line: 325, size: 11648, elements: !1499)
!1499 = !{!1500, !1501, !1502, !2318, !2319, !2320, !2321, !2322}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !1498, file: !6, line: 327, baseType: !1496, size: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !1498, file: !6, line: 328, baseType: !1496, size: 64, offset: 64)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !1498, file: !6, line: 329, baseType: !1503, size: 64, offset: 128)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !6, line: 59, baseType: !1505)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !6, line: 3365, size: 72064, elements: !1506)
!1506 = !{!1507, !1508, !1509, !1510, !1511, !1675, !1676, !1691, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1748, !1749, !1750, !1751, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1774, !1775, !1777, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1798, !1799, !1800, !1801, !1802, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1862, !1863, !1864, !1865, !1866, !2119, !2127, !2128, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2208, !2209, !2210, !2211, !2229, !2230, !2231, !2232, !2273, !2274, !2286, !2287, !2288, !2289, !2290, !2310, !2311, !2312, !2313, !2317}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !1505, file: !6, line: 3367, baseType: !1122, size: 32)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !1505, file: !6, line: 3369, baseType: !1356, size: 64, offset: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !1505, file: !6, line: 3371, baseType: !1503, size: 64, offset: 128)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !1505, file: !6, line: 3372, baseType: !1503, size: 64, offset: 192)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !1505, file: !6, line: 3375, baseType: !1512, size: 64, offset: 256)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64)
!1513 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !6, line: 2618, baseType: !1514)
!1514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2542, size: 9920, elements: !1515)
!1515 = !{!1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1602, !1610, !1611, !1612, !1613, !1614, !1651, !1652, !1653, !1654, !1655, !1656, !1658, !1659, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1674}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !1514, file: !6, line: 2544, baseType: !1302, size: 2432)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !1514, file: !6, line: 2545, baseType: !1302, size: 2432, offset: 2432)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !1514, file: !6, line: 2546, baseType: !1122, size: 32, offset: 4864)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !1514, file: !6, line: 2548, baseType: !1122, size: 32, offset: 4896)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !1514, file: !6, line: 2550, baseType: !1122, size: 32, offset: 4928)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !1514, file: !6, line: 2551, baseType: !1122, size: 32, offset: 4960)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !1514, file: !6, line: 2552, baseType: !1122, size: 32, offset: 4992)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !1514, file: !6, line: 2553, baseType: !1175, size: 192, offset: 5056)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !1514, file: !6, line: 2554, baseType: !1175, size: 192, offset: 5248)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !1514, file: !6, line: 2555, baseType: !1122, size: 32, offset: 5440)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !1514, file: !6, line: 2556, baseType: !1122, size: 32, offset: 5472)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !1514, file: !6, line: 2557, baseType: !1122, size: 32, offset: 5504)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !1514, file: !6, line: 2559, baseType: !1122, size: 32, offset: 5536)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !1514, file: !6, line: 2560, baseType: !1108, size: 16, offset: 5568)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !1514, file: !6, line: 2561, baseType: !1144, size: 64, offset: 5632)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !1514, file: !6, line: 2562, baseType: !1144, size: 64, offset: 5696)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !1514, file: !6, line: 2563, baseType: !1144, size: 64, offset: 5760)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !1514, file: !6, line: 2564, baseType: !1136, size: 64, offset: 5824)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !1514, file: !6, line: 2565, baseType: !1535, size: 64, offset: 5888)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64)
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !1537, line: 56, baseType: !1538)
!1537 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !1537, line: 49, size: 192, elements: !1539)
!1539 = !{!1540, !1598, !1599, !1600, !1601}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !1538, file: !1537, line: 51, baseType: !1541, size: 64)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1542 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !1537, line: 42, baseType: !1543)
!1543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !1537, line: 167, size: 320, elements: !1544)
!1544 = !{!1545, !1549, !1553, !1568, !1597}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !1543, file: !1537, line: 169, baseType: !1546, size: 64)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!1535, !1136, !1122}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !1543, file: !1537, line: 170, baseType: !1550, size: 64, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{null, !1535}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !1543, file: !1537, line: 171, baseType: !1554, size: 64, offset: 128)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!1122, !1557, !1136, !1440, !1122}
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64)
!1558 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !1537, line: 137, baseType: !1559)
!1559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1537, line: 131, size: 1408, elements: !1560)
!1560 = !{!1561, !1562, !1566, !1567}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !1559, file: !1537, line: 133, baseType: !1535, size: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !1559, file: !1537, line: 134, baseType: !1563, size: 640, offset: 64)
!1563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 640, elements: !1564)
!1564 = !{!1565}
!1565 = !DISubrange(count: 10)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !1559, file: !1537, line: 135, baseType: !1563, size: 640, offset: 704)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !1559, file: !1537, line: 136, baseType: !1122, size: 32, offset: 1344)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !1543, file: !1537, line: 172, baseType: !1569, size: 64, offset: 192)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{!1144, !1572, !1503, !1356, !1160, !1440, !1587, !1596}
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !1537, line: 154, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1537, line: 147, size: 2688, elements: !1575)
!1575 = !{!1576, !1577, !1584, !1585, !1586}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !1574, file: !1537, line: 149, baseType: !1535, size: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !1574, file: !1537, line: 150, baseType: !1578, size: 1280, offset: 64)
!1578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1579, size: 1280, elements: !1564)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !6, line: 41, baseType: !1580)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 37, size: 128, elements: !1581)
!1581 = !{!1582, !1583}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !1580, file: !6, line: 39, baseType: !1160, size: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1580, file: !6, line: 40, baseType: !1440, size: 32, offset: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !1574, file: !1537, line: 151, baseType: !1578, size: 1280, offset: 1344)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !1574, file: !1537, line: 152, baseType: !1122, size: 32, offset: 2624)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !1574, file: !1537, line: 153, baseType: !1440, size: 32, offset: 2656)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64)
!1588 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !715, line: 1786, baseType: !1589)
!1589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1590, line: 8, size: 128, elements: !1591)
!1590 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!1591 = !{!1592, !1594}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1589, file: !1590, line: 10, baseType: !1593, size: 64)
!1593 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !1340, line: 160, baseType: !1144)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1589, file: !1590, line: 11, baseType: !1595, size: 64, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !1340, line: 162, baseType: !1144)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1543, file: !1537, line: 173, baseType: !1136, size: 64, offset: 256)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !1538, file: !1537, line: 52, baseType: !1397, size: 32, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !1538, file: !1537, line: 53, baseType: !1397, size: 32, offset: 96)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !1538, file: !1537, line: 54, baseType: !1397, size: 32, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !1538, file: !1537, line: 55, baseType: !1122, size: 32, offset: 160)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !1514, file: !6, line: 2567, baseType: !1603, size: 384, offset: 5952)
!1603 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !6, line: 2475, baseType: !1604)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2470, size: 384, elements: !1605)
!1605 = !{!1606, !1607, !1608, !1609}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1604, file: !6, line: 2471, baseType: !1588, size: 128)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !1604, file: !6, line: 2472, baseType: !1588, size: 128, offset: 128)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1604, file: !6, line: 2473, baseType: !1144, size: 64, offset: 256)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !1604, file: !6, line: 2474, baseType: !1144, size: 64, offset: 320)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !1514, file: !6, line: 2569, baseType: !1122, size: 32, offset: 6336)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !1514, file: !6, line: 2570, baseType: !1122, size: 32, offset: 6368)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !1514, file: !6, line: 2572, baseType: !1122, size: 32, offset: 6400)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !1514, file: !6, line: 2575, baseType: !1122, size: 32, offset: 6432)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !1514, file: !6, line: 2592, baseType: !1615, size: 64, offset: 6464)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64)
!1616 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !6, line: 1061, baseType: !1617)
!1617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !6, line: 1063, size: 1728, elements: !1618)
!1618 = !{!1619, !1620, !1621, !1643, !1644, !1645, !1647, !1650}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !1617, file: !6, line: 1065, baseType: !1615, size: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !1617, file: !6, line: 1066, baseType: !1160, size: 64, offset: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !1617, file: !6, line: 1071, baseType: !1622, size: 1344, offset: 128)
!1622 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1617, file: !6, line: 1067, size: 1344, elements: !1623)
!1623 = !{!1624, !1642}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !1622, file: !6, line: 1069, baseType: !1625, size: 1344)
!1625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1626, size: 1344, elements: !1640)
!1626 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !6, line: 1055, baseType: !1627)
!1627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !6, line: 1046, size: 192, elements: !1628)
!1628 = !{!1629, !1630, !1631, !1632, !1633}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !1627, file: !6, line: 1048, baseType: !1122, size: 32)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !1627, file: !6, line: 1049, baseType: !1122, size: 32, offset: 32)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !1627, file: !6, line: 1051, baseType: !1122, size: 32, offset: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !1627, file: !6, line: 1052, baseType: !1122, size: 32, offset: 96)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !1627, file: !6, line: 1054, baseType: !1634, size: 64, offset: 128)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !1537, line: 165, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1537, line: 161, size: 704, elements: !1637)
!1637 = !{!1638, !1639}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1636, file: !1537, line: 163, baseType: !1108, size: 16)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !1636, file: !1537, line: 164, baseType: !1563, size: 640, offset: 64)
!1640 = !{!1641}
!1641 = !DISubrange(count: 7)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !1622, file: !6, line: 1070, baseType: !1175, size: 192)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !1617, file: !6, line: 1072, baseType: !1122, size: 32, offset: 1472)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !1617, file: !6, line: 1073, baseType: !1122, size: 32, offset: 1504)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !1617, file: !6, line: 1074, baseType: !1646, size: 64, offset: 1536)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !1617, file: !6, line: 1076, baseType: !1648, size: 16, offset: 1600)
!1648 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !715, line: 1689, baseType: !1649)
!1649 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !1617, file: !6, line: 1077, baseType: !1160, size: 64, offset: 1664)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !1514, file: !6, line: 2593, baseType: !1122, size: 32, offset: 6528)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !1514, file: !6, line: 2594, baseType: !1615, size: 64, offset: 6592)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !1514, file: !6, line: 2595, baseType: !1615, size: 64, offset: 6656)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !1514, file: !6, line: 2596, baseType: !1122, size: 32, offset: 6720)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !1514, file: !6, line: 2597, baseType: !1160, size: 64, offset: 6784)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !1514, file: !6, line: 2598, baseType: !1657, size: 16, offset: 6848)
!1657 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !715, line: 325, baseType: !1649)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !1514, file: !6, line: 2603, baseType: !1175, size: 192, offset: 6912)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !1514, file: !6, line: 2604, baseType: !1660, size: 2048, offset: 7104)
!1660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 2048, elements: !1661)
!1661 = !{!1662}
!1662 = !DISubrange(count: 256)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !1514, file: !6, line: 2605, baseType: !1136, size: 64, offset: 9152)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !1514, file: !6, line: 2606, baseType: !1136, size: 64, offset: 9216)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !1514, file: !6, line: 2607, baseType: !1535, size: 64, offset: 9280)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !1514, file: !6, line: 2608, baseType: !1136, size: 64, offset: 9344)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !1514, file: !6, line: 2609, baseType: !1136, size: 64, offset: 9408)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !1514, file: !6, line: 2610, baseType: !1136, size: 64, offset: 9472)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !1514, file: !6, line: 2611, baseType: !1122, size: 32, offset: 9536)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !1514, file: !6, line: 2616, baseType: !1671, size: 256, offset: 9568)
!1671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 256, elements: !1672)
!1672 = !{!1673}
!1673 = !DISubrange(count: 32)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !1514, file: !6, line: 2617, baseType: !1136, size: 64, offset: 9856)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !1505, file: !6, line: 3378, baseType: !1122, size: 32, offset: 320)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !1505, file: !6, line: 3381, baseType: !1677, size: 64, offset: 384)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64)
!1678 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !6, line: 61, baseType: !1679)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !6, line: 3231, size: 512, elements: !1680)
!1680 = !{!1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !1679, file: !6, line: 3233, baseType: !1100, size: 8)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !1679, file: !6, line: 3234, baseType: !1122, size: 32, offset: 32)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !1679, file: !6, line: 3235, baseType: !1122, size: 32, offset: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !1679, file: !6, line: 3236, baseType: !1122, size: 32, offset: 96)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !1679, file: !6, line: 3237, baseType: !1122, size: 32, offset: 128)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !1679, file: !6, line: 3238, baseType: !1677, size: 64, offset: 192)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !1679, file: !6, line: 3239, baseType: !1677, size: 64, offset: 256)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !1679, file: !6, line: 3241, baseType: !1677, size: 64, offset: 320)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !1679, file: !6, line: 3244, baseType: !1677, size: 64, offset: 384)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !1679, file: !6, line: 3245, baseType: !1503, size: 64, offset: 448)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !1505, file: !6, line: 3383, baseType: !1692, size: 128, offset: 448)
!1692 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !6, line: 31, baseType: !1693)
!1693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 26, size: 128, elements: !1694)
!1694 = !{!1695, !1696, !1697}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !1693, file: !6, line: 28, baseType: !1160, size: 64)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1693, file: !6, line: 29, baseType: !1440, size: 32, offset: 64)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !1693, file: !6, line: 30, baseType: !1440, size: 32, offset: 96)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !1505, file: !6, line: 3385, baseType: !1440, size: 32, offset: 576)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !1505, file: !6, line: 3389, baseType: !1122, size: 32, offset: 608)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !1505, file: !6, line: 3394, baseType: !1160, size: 64, offset: 640)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !1505, file: !6, line: 3400, baseType: !1100, size: 8, offset: 704)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !1505, file: !6, line: 3401, baseType: !1160, size: 64, offset: 768)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !1505, file: !6, line: 3402, baseType: !1440, size: 32, offset: 832)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !1505, file: !6, line: 3403, baseType: !1440, size: 32, offset: 864)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !1505, file: !6, line: 3404, baseType: !1160, size: 64, offset: 896)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !1505, file: !6, line: 3405, baseType: !1440, size: 32, offset: 960)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !1505, file: !6, line: 3406, baseType: !1440, size: 32, offset: 992)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !1505, file: !6, line: 3408, baseType: !1709, size: 352, offset: 1024)
!1709 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !6, line: 3358, baseType: !1710)
!1710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3343, size: 352, elements: !1711)
!1711 = !{!1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !1710, file: !6, line: 3345, baseType: !1122, size: 32)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1710, file: !6, line: 3346, baseType: !1122, size: 32, offset: 32)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !1710, file: !6, line: 3347, baseType: !1122, size: 32, offset: 64)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !1710, file: !6, line: 3348, baseType: !1122, size: 32, offset: 96)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1710, file: !6, line: 3349, baseType: !1122, size: 32, offset: 128)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !1710, file: !6, line: 3350, baseType: !1122, size: 32, offset: 160)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !1710, file: !6, line: 3351, baseType: !1122, size: 32, offset: 192)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !1710, file: !6, line: 3352, baseType: !1122, size: 32, offset: 224)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !1710, file: !6, line: 3353, baseType: !1122, size: 32, offset: 256)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !1710, file: !6, line: 3354, baseType: !1122, size: 32, offset: 288)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !1710, file: !6, line: 3356, baseType: !1122, size: 32, offset: 320)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !1505, file: !6, line: 3414, baseType: !1160, size: 64, offset: 1408)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !1505, file: !6, line: 3416, baseType: !1100, size: 8, offset: 1472)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !1505, file: !6, line: 3419, baseType: !1160, size: 64, offset: 1536)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !1505, file: !6, line: 3423, baseType: !1122, size: 32, offset: 1600)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !1505, file: !6, line: 3424, baseType: !1122, size: 32, offset: 1632)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !1505, file: !6, line: 3425, baseType: !1122, size: 32, offset: 1664)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !1505, file: !6, line: 3427, baseType: !1122, size: 32, offset: 1696)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !1505, file: !6, line: 3429, baseType: !1440, size: 32, offset: 1728)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !1505, file: !6, line: 3432, baseType: !1440, size: 32, offset: 1760)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !1505, file: !6, line: 3435, baseType: !1122, size: 32, offset: 1792)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !1505, file: !6, line: 3437, baseType: !1122, size: 32, offset: 1824)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !1505, file: !6, line: 3445, baseType: !1122, size: 32, offset: 1856)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !1505, file: !6, line: 3446, baseType: !1122, size: 32, offset: 1888)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !1505, file: !6, line: 3449, baseType: !1122, size: 32, offset: 1920)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !1505, file: !6, line: 3450, baseType: !1122, size: 32, offset: 1952)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !1505, file: !6, line: 3451, baseType: !1122, size: 32, offset: 1984)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !1505, file: !6, line: 3452, baseType: !1122, size: 32, offset: 2016)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !1505, file: !6, line: 3454, baseType: !1741, size: 320, offset: 2048)
!1741 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !6, line: 3330, baseType: !1742)
!1742 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3324, size: 320, elements: !1743)
!1743 = !{!1744, !1745, !1746, !1747}
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !1742, file: !6, line: 3326, baseType: !1122, size: 32)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !1742, file: !6, line: 3327, baseType: !1122, size: 32, offset: 32)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !1742, file: !6, line: 3328, baseType: !1692, size: 128, offset: 64)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !1742, file: !6, line: 3329, baseType: !1692, size: 128, offset: 192)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !1505, file: !6, line: 3457, baseType: !1122, size: 32, offset: 2368)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !1505, file: !6, line: 3458, baseType: !1122, size: 32, offset: 2400)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !1505, file: !6, line: 3459, baseType: !1136, size: 64, offset: 2432)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !1505, file: !6, line: 3460, baseType: !1752, size: 32, offset: 2496)
!1752 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !6, line: 2524, baseType: !59)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !1505, file: !6, line: 3461, baseType: !1122, size: 32, offset: 2528)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !1505, file: !6, line: 3462, baseType: !1122, size: 32, offset: 2560)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !1505, file: !6, line: 3463, baseType: !1503, size: 64, offset: 2624)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !1505, file: !6, line: 3464, baseType: !1122, size: 32, offset: 2688)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !1505, file: !6, line: 3465, baseType: !1122, size: 32, offset: 2720)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !1505, file: !6, line: 3466, baseType: !1122, size: 32, offset: 2752)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !1505, file: !6, line: 3467, baseType: !1122, size: 32, offset: 2784)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !1505, file: !6, line: 3468, baseType: !1122, size: 32, offset: 2816)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !1505, file: !6, line: 3469, baseType: !1122, size: 32, offset: 2848)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !1505, file: !6, line: 3470, baseType: !1122, size: 32, offset: 2880)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !1505, file: !6, line: 3471, baseType: !1122, size: 32, offset: 2912)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !1505, file: !6, line: 3472, baseType: !1122, size: 32, offset: 2944)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !1505, file: !6, line: 3473, baseType: !1122, size: 32, offset: 2976)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !1505, file: !6, line: 3474, baseType: !1122, size: 32, offset: 3008)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !1505, file: !6, line: 3475, baseType: !1122, size: 32, offset: 3040)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !1505, file: !6, line: 3476, baseType: !1136, size: 64, offset: 3072)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !1505, file: !6, line: 3477, baseType: !1136, size: 64, offset: 3136)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !1505, file: !6, line: 3478, baseType: !1771, size: 128, offset: 3200)
!1771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 128, elements: !1772)
!1772 = !{!1773}
!1773 = !DISubrange(count: 4)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !1505, file: !6, line: 3479, baseType: !1771, size: 128, offset: 3328)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !1505, file: !6, line: 3480, baseType: !1776, size: 256, offset: 3456)
!1776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 256, elements: !1772)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !1505, file: !6, line: 3481, baseType: !1778, size: 256, offset: 3712)
!1778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 256, elements: !1422)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !1505, file: !6, line: 3483, baseType: !1122, size: 32, offset: 3968)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !1505, file: !6, line: 3484, baseType: !1122, size: 32, offset: 4000)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !1505, file: !6, line: 3485, baseType: !1242, size: 64, offset: 4032)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !1505, file: !6, line: 3487, baseType: !1242, size: 64, offset: 4096)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !1505, file: !6, line: 3490, baseType: !1122, size: 32, offset: 4160)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !1505, file: !6, line: 3493, baseType: !1160, size: 64, offset: 4224)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !1505, file: !6, line: 3495, baseType: !1349, size: 192, offset: 4288)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !1505, file: !6, line: 3496, baseType: !1349, size: 192, offset: 4480)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !1505, file: !6, line: 3497, baseType: !1122, size: 32, offset: 4672)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !1505, file: !6, line: 3498, baseType: !1122, size: 32, offset: 4704)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !1505, file: !6, line: 3500, baseType: !1503, size: 64, offset: 4736)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !1505, file: !6, line: 3501, baseType: !1160, size: 64, offset: 4800)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !1505, file: !6, line: 3502, baseType: !1440, size: 32, offset: 4864)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !1505, file: !6, line: 3503, baseType: !1440, size: 32, offset: 4896)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !1505, file: !6, line: 3504, baseType: !1122, size: 32, offset: 4928)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !1505, file: !6, line: 3505, baseType: !1122, size: 32, offset: 4960)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !1505, file: !6, line: 3506, baseType: !1122, size: 32, offset: 4992)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !1505, file: !6, line: 3507, baseType: !1797, size: 32, offset: 5024)
!1797 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !6, line: 2530, baseType: !67)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !1505, file: !6, line: 3509, baseType: !1249, size: 64, offset: 5056)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !1505, file: !6, line: 3510, baseType: !1136, size: 64, offset: 5120)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !1505, file: !6, line: 3511, baseType: !1122, size: 32, offset: 5184)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !1505, file: !6, line: 3512, baseType: !1122, size: 32, offset: 5216)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !1505, file: !6, line: 3514, baseType: !1803, size: 64, offset: 5248)
!1803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1804, size: 64)
!1804 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !6, line: 2478, baseType: !1805)
!1805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !6, line: 2479, size: 704, elements: !1806)
!1806 = !{!1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816}
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !1805, file: !6, line: 2481, baseType: !1144, size: 64)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !1805, file: !6, line: 2483, baseType: !1803, size: 64, offset: 64)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !1805, file: !6, line: 2484, baseType: !1803, size: 64, offset: 128)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !1805, file: !6, line: 2485, baseType: !1588, size: 128, offset: 192)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !1805, file: !6, line: 2486, baseType: !1100, size: 8, offset: 320)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !1805, file: !6, line: 2487, baseType: !1100, size: 8, offset: 328)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !1805, file: !6, line: 2488, baseType: !1122, size: 32, offset: 352)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !1805, file: !6, line: 2489, baseType: !1144, size: 64, offset: 384)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !1805, file: !6, line: 2490, baseType: !1349, size: 192, offset: 448)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !1805, file: !6, line: 2491, baseType: !1122, size: 32, offset: 640)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !1505, file: !6, line: 3517, baseType: !1122, size: 32, offset: 5312)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !1505, file: !6, line: 3534, baseType: !1122, size: 32, offset: 5344)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !1505, file: !6, line: 3535, baseType: !1692, size: 128, offset: 5376)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !1505, file: !6, line: 3537, baseType: !1440, size: 32, offset: 5504)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !1505, file: !6, line: 3543, baseType: !1122, size: 32, offset: 5536)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !1505, file: !6, line: 3545, baseType: !1122, size: 32, offset: 5568)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !1505, file: !6, line: 3548, baseType: !1122, size: 32, offset: 5600)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !1505, file: !6, line: 3550, baseType: !1440, size: 32, offset: 5632)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !1505, file: !6, line: 3562, baseType: !1122, size: 32, offset: 5664)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !1505, file: !6, line: 3562, baseType: !1122, size: 32, offset: 5696)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !1505, file: !6, line: 3574, baseType: !1122, size: 32, offset: 5728)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !1505, file: !6, line: 3575, baseType: !1829, size: 64, offset: 5760)
!1829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1830, size: 64)
!1830 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !6, line: 3225, baseType: !1831)
!1831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !6, line: 3216, size: 192, elements: !1832)
!1832 = !{!1833, !1834, !1835, !1836, !1837}
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !1831, file: !6, line: 3218, baseType: !1160, size: 64)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !1831, file: !6, line: 3219, baseType: !1657, size: 16, offset: 64)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !1831, file: !6, line: 3220, baseType: !1100, size: 8, offset: 80)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !1831, file: !6, line: 3222, baseType: !1100, size: 8, offset: 88)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !1831, file: !6, line: 3223, baseType: !1160, size: 64, offset: 128)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !1505, file: !6, line: 3578, baseType: !1175, size: 192, offset: 5824)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !1505, file: !6, line: 3579, baseType: !1100, size: 8, offset: 6016)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !1505, file: !6, line: 3581, baseType: !1100, size: 8, offset: 6024)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !1505, file: !6, line: 3585, baseType: !1122, size: 32, offset: 6048)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !1505, file: !6, line: 3593, baseType: !1122, size: 32, offset: 6080)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !1505, file: !6, line: 3594, baseType: !1122, size: 32, offset: 6112)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_top", scope: !1505, file: !6, line: 3596, baseType: !1160, size: 64, offset: 6144)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_bot", scope: !1505, file: !6, line: 3597, baseType: !1160, size: 64, offset: 6208)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_status", scope: !1505, file: !6, line: 3598, baseType: !1122, size: 32, offset: 6272)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_cursor", scope: !1505, file: !6, line: 3602, baseType: !1692, size: 128, offset: 6336)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_virtcol", scope: !1505, file: !6, line: 3603, baseType: !1440, size: 32, offset: 6464)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topline", scope: !1505, file: !6, line: 3604, baseType: !1160, size: 64, offset: 6528)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_line_count", scope: !1505, file: !6, line: 3605, baseType: !1160, size: 64, offset: 6592)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topfill", scope: !1505, file: !6, line: 3607, baseType: !1122, size: 32, offset: 6656)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_empty", scope: !1505, file: !6, line: 3609, baseType: !1100, size: 8, offset: 6688)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "w_alt_fnum", scope: !1505, file: !6, line: 3612, baseType: !1122, size: 32, offset: 6720)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "w_alist", scope: !1505, file: !6, line: 3614, baseType: !1855, size: 64, offset: 6784)
!1855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1856, size: 64)
!1856 = !DIDerivedType(tag: DW_TAG_typedef, name: "alist_T", file: !6, line: 863, baseType: !1857)
!1857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arglist", file: !6, line: 858, size: 256, elements: !1858)
!1858 = !{!1859, !1860, !1861}
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "al_ga", scope: !1857, file: !6, line: 860, baseType: !1175, size: 192)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "al_refcount", scope: !1857, file: !6, line: 861, baseType: !1122, size: 32, offset: 192)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1857, file: !6, line: 862, baseType: !1122, size: 32, offset: 224)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx", scope: !1505, file: !6, line: 3615, baseType: !1122, size: 32, offset: 6848)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx_invalid", scope: !1505, file: !6, line: 3617, baseType: !1122, size: 32, offset: 6880)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "w_localdir", scope: !1505, file: !6, line: 3619, baseType: !1136, size: 64, offset: 6912)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "w_prevdir", scope: !1505, file: !6, line: 3621, baseType: !1136, size: 64, offset: 6976)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "w_winbar", scope: !1505, file: !6, line: 3623, baseType: !1867, size: 64, offset: 7040)
!1867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1868, size: 64)
!1868 = !DIDerivedType(tag: DW_TAG_typedef, name: "vimmenu_T", file: !6, line: 67, baseType: !1869)
!1869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VimMenu", file: !6, line: 3889, size: 1984, elements: !1870)
!1870 = !{!1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1884, !1885, !1886, !1887, !1889, !1890, !1892, !1893, !1894, !1895, !2116, !2117, !2118}
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !1869, file: !6, line: 3891, baseType: !1122, size: 32)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !1869, file: !6, line: 3892, baseType: !1122, size: 32, offset: 32)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1869, file: !6, line: 3893, baseType: !1136, size: 64, offset: 64)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "dname", scope: !1869, file: !6, line: 3894, baseType: !1136, size: 64, offset: 128)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "en_name", scope: !1869, file: !6, line: 3896, baseType: !1136, size: 64, offset: 192)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "en_dname", scope: !1869, file: !6, line: 3898, baseType: !1136, size: 64, offset: 256)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic", scope: !1869, file: !6, line: 3901, baseType: !1122, size: 32, offset: 320)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "actext", scope: !1869, file: !6, line: 3902, baseType: !1136, size: 64, offset: 384)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !1869, file: !6, line: 3903, baseType: !1122, size: 32, offset: 448)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1869, file: !6, line: 3905, baseType: !1881, size: 64, offset: 512)
