; ModuleID = 'getchar.c'
source_filename = "getchar.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.buffheader = type { %struct.buffblock, %struct.buffblock*, i32, i32 }
%struct.buffblock = type { %struct.buffblock*, [1 x i8] }
%struct.typebuf_T = type { i8*, i8*, i32, i32, i32, i32, i32, i32, i32 }
%struct.pos_T = type { i64, i32, i32 }

!315 = !DIEnumerator(name: "EVENT_VIMSUSPEND", value: 105)
!316 = !DIEnumerator(name: "EVENT_VIMRESUME", value: 106)
!317 = !DIEnumerator(name: "NUM_EVENTS", value: 107)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 1572, size: 32, elements: !319)
!319 = !{!320, !321, !322, !323}
!320 = !DIEnumerator(name: "GETLINE_NONE", value: 0)
!321 = !DIEnumerator(name: "GETLINE_CONCAT_CONT", value: 1)
!322 = !DIEnumerator(name: "GETLINE_CONCAT_CONTBAR", value: 2)
!323 = !DIEnumerator(name: "GETLINE_CONCAT_ALL", value: 3)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 2241, size: 32, elements: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DIEnumerator(name: "map_result_fail", value: 0)
!327 = !DIEnumerator(name: "map_result_get", value: 1)
!328 = !DIEnumerator(name: "map_result_retry", value: 2)
!329 = !DIEnumerator(name: "map_result_nomatch", value: 3)
!330 = !{!331, !333, !334, !335, !336, !339, !340, !343, !601, !332, !602, !603}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!333 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!335 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !6, line: 324, baseType: !338)
!338 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!339 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !341, line: 62, baseType: !342)
!341 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!342 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkMenuShell", file: !345, line: 48, baseType: !346)
!345 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkmenushell.h", directory: "/home/sahil/vim/src")
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkMenuShell", file: !345, line: 51, size: 1216, elements: !347)
!347 = !{!348, !581, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !346, file: !345, line: 53, baseType: !349, size: 896)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkContainer", file: !350, line: 51, baseType: !351)
!350 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkcontainer.h", directory: "/home/sahil/vim/src")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkContainer", file: !350, line: 54, size: 896, elements: !352)
!352 = !{!353, !575, !576, !577, !578, !579, !580}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "widget", scope: !351, file: !350, line: 56, baseType: !354, size: 768)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWidget", file: !355, line: 69, baseType: !356)
!355 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkstyle.h", directory: "/home/sahil/vim/src")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWidget", file: !357, line: 530, size: 768, elements: !358)
!357 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkwidget.h", directory: "/home/sahil/vim/src")
!358 = !{!359, !395, !398, !400, !401, !404, !555, !561, !570, !573}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !356, file: !357, line: 538, baseType: !360, size: 256)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkObject", file: !361, line: 49, baseType: !362)
!361 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtktypeutils.h", directory: "/home/sahil/vim/src")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkObject", file: !363, line: 107, size: 256, elements: !364)
!363 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkobject.h", directory: "/home/sahil/vim/src")
!364 = !{!365, !393}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !362, file: !363, line: 109, baseType: !366, size: 192)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInitiallyUnowned", file: !367, line: 189, baseType: !368)
!367 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gobject.h", directory: "/home/sahil/vim/src")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GObject", file: !367, line: 245, size: 192, elements: !369)
!369 = !{!370, !384, !388}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "g_type_instance", scope: !368, file: !367, line: 247, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeInstance", file: !372, line: 393, baseType: !373)
!372 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gtype.h", directory: "/home/sahil/vim/src")
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeInstance", file: !372, line: 418, size: 64, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "g_class", scope: !373, file: !372, line: 421, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeClass", file: !372, line: 391, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeClass", file: !372, line: 408, size: 64, elements: !379)
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !378, file: !372, line: 411, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "GType", file: !372, line: 384, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !383, line: 78, baseType: !342)
!383 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/sahil/vim/src")
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !368, file: !367, line: 250, baseType: !385, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !387, line: 55, baseType: !339)
!387 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/sahil/vim/src")
!388 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !368, file: !367, line: 251, baseType: !389, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !391, line: 36, baseType: !392)
!391 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/sahil/vim/src")
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !391, line: 36, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !362, file: !363, line: 116, baseType: !394, size: 32, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !383, line: 52, baseType: !339)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "private_flags", scope: !356, file: !357, line: 545, baseType: !396, size: 16, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint16", file: !383, line: 44, baseType: !397)
!397 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !356, file: !357, line: 550, baseType: !399, size: 8, offset: 272)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint8", file: !383, line: 41, baseType: !338)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "saved_state", scope: !356, file: !357, line: 558, baseType: !399, size: 8, offset: 280)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !356, file: !357, line: 566, baseType: !402, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !387, line: 46, baseType: !332)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !356, file: !357, line: 575, baseType: !405, size: 64, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkStyle", file: !355, line: 54, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkStyle", file: !355, line: 73, size: 7872, elements: !408)
!408 = !{!409, !411, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !437, !439, !440, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !502, !503, !504, !505, !514, !515, !552, !553, !554}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !407, file: !355, line: 75, baseType: !410, size: 192)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "GObject", file: !367, line: 187, baseType: !368)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "fg", scope: !407, file: !355, line: 79, baseType: !412, size: 480, offset: 192)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 480, elements: !421)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkColor", file: !21, line: 102, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkColor", file: !415, line: 46, size: 96, elements: !416)
!415 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkcolor.h", directory: "/home/sahil/vim/src")
!416 = !{!417, !418, !419, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !414, file: !415, line: 48, baseType: !394, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !414, file: !415, line: 49, baseType: !396, size: 16, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !414, file: !415, line: 50, baseType: !396, size: 16, offset: 48)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !414, file: !415, line: 51, baseType: !396, size: 16, offset: 64)
!421 = !{!422}
!422 = !DISubrange(count: 5)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !407, file: !355, line: 80, baseType: !412, size: 480, offset: 672)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "light", scope: !407, file: !355, line: 81, baseType: !412, size: 480, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dark", scope: !407, file: !355, line: 82, baseType: !412, size: 480, offset: 1632)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !407, file: !355, line: 83, baseType: !412, size: 480, offset: 2112)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !407, file: !355, line: 84, baseType: !412, size: 480, offset: 2592)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !407, file: !355, line: 85, baseType: !412, size: 480, offset: 3072)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "text_aa", scope: !407, file: !355, line: 86, baseType: !412, size: 480, offset: 3552)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !407, file: !355, line: 88, baseType: !413, size: 96, offset: 4032)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !407, file: !355, line: 89, baseType: !413, size: 96, offset: 4128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "font_desc", scope: !407, file: !355, line: 90, baseType: !433, size: 64, offset: 4224)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoFontDescription", file: !435, line: 41, baseType: !436)
!435 = !DIFile(filename: "/usr/include/pango-1.0/pango/pango-font.h", directory: "/home/sahil/vim/src")
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoFontDescription", file: !435, line: 41, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "xthickness", scope: !407, file: !355, line: 92, baseType: !438, size: 32, offset: 4288)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !387, line: 49, baseType: !333)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ythickness", scope: !407, file: !355, line: 93, baseType: !438, size: 32, offset: 4320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fg_gc", scope: !407, file: !355, line: 95, baseType: !441, size: 320, offset: 4352)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 320, elements: !421)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkGC", file: !21, line: 106, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkGC", file: !445, line: 189, size: 384, elements: !446)
!445 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkgc.h", directory: "/home/sahil/vim/src")
!446 = !{!447, !448, !449, !450, !451, !452}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !444, file: !445, line: 191, baseType: !410, size: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "clip_x_origin", scope: !444, file: !445, line: 193, baseType: !438, size: 32, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "clip_y_origin", scope: !444, file: !445, line: 194, baseType: !438, size: 32, offset: 224)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ts_x_origin", scope: !444, file: !445, line: 195, baseType: !438, size: 32, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ts_y_origin", scope: !444, file: !445, line: 196, baseType: !438, size: 32, offset: 288)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !444, file: !445, line: 198, baseType: !453, size: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkColormap", file: !21, line: 103, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkColormap", file: !415, line: 68, size: 448, elements: !456)
!456 = !{!457, !458, !459, !461, !483}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !455, file: !415, line: 71, baseType: !410, size: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !455, file: !415, line: 74, baseType: !438, size: 32, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !455, file: !415, line: 75, baseType: !460, size: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !455, file: !415, line: 78, baseType: !462, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisual", file: !21, line: 109, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkVisual", file: !12, line: 77, size: 640, elements: !465)
!465 = !{!466, !467, !469, !470, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !464, file: !12, line: 79, baseType: !410, size: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !464, file: !12, line: 81, baseType: !468, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisualType", file: !12, line: 63, baseType: !11)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !464, file: !12, line: 82, baseType: !438, size: 32, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !464, file: !12, line: 83, baseType: !471, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkByteOrder", file: !21, line: 122, baseType: !20)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "colormap_size", scope: !464, file: !12, line: 84, baseType: !438, size: 32, offset: 288)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !464, file: !12, line: 85, baseType: !438, size: 32, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !464, file: !12, line: 87, baseType: !394, size: 32, offset: 352)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "red_shift", scope: !464, file: !12, line: 88, baseType: !438, size: 32, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "red_prec", scope: !464, file: !12, line: 89, baseType: !438, size: 32, offset: 416)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !464, file: !12, line: 91, baseType: !394, size: 32, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "green_shift", scope: !464, file: !12, line: 92, baseType: !438, size: 32, offset: 480)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "green_prec", scope: !464, file: !12, line: 93, baseType: !438, size: 32, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !464, file: !12, line: 95, baseType: !394, size: 32, offset: 544)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "blue_shift", scope: !464, file: !12, line: 96, baseType: !438, size: 32, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "blue_prec", scope: !464, file: !12, line: 97, baseType: !438, size: 32, offset: 608)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "windowing_data", scope: !455, file: !415, line: 80, baseType: !484, size: 64, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !387, line: 103, baseType: !334)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bg_gc", scope: !407, file: !355, line: 96, baseType: !441, size: 320, offset: 4672)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "light_gc", scope: !407, file: !355, line: 97, baseType: !441, size: 320, offset: 4992)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dark_gc", scope: !407, file: !355, line: 98, baseType: !441, size: 320, offset: 5312)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mid_gc", scope: !407, file: !355, line: 99, baseType: !441, size: 320, offset: 5632)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "text_gc", scope: !407, file: !355, line: 100, baseType: !441, size: 320, offset: 5952)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "base_gc", scope: !407, file: !355, line: 101, baseType: !441, size: 320, offset: 6272)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "text_aa_gc", scope: !407, file: !355, line: 102, baseType: !441, size: 320, offset: 6592)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "black_gc", scope: !407, file: !355, line: 103, baseType: !442, size: 64, offset: 6912)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "white_gc", scope: !407, file: !355, line: 104, baseType: !442, size: 64, offset: 6976)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "bg_pixmap", scope: !407, file: !355, line: 106, baseType: !495, size: 320, offset: 7040)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 320, elements: !421)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkPixmap", file: !21, line: 113, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDrawable", file: !499, line: 53, size: 192, elements: !500)
!499 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkdrawable.h", directory: "/home/sahil/vim/src")
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !498, file: !499, line: 55, baseType: !410, size: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "attach_count", scope: !407, file: !355, line: 110, baseType: !438, size: 32, offset: 7360)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !407, file: !355, line: 112, baseType: !438, size: 32, offset: 7392)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !407, file: !355, line: 113, baseType: !453, size: 64, offset: 7424)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "private_font", scope: !407, file: !355, line: 114, baseType: !506, size: 64, offset: 7488)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkFont", file: !21, line: 105, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkFont", file: !26, line: 49, size: 96, elements: !509)
!509 = !{!510, !512, !513}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !508, file: !26, line: 51, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkFontType", file: !26, line: 47, baseType: !25)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !508, file: !26, line: 52, baseType: !438, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !508, file: !26, line: 53, baseType: !438, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "private_font_desc", scope: !407, file: !355, line: 115, baseType: !433, size: 64, offset: 7552)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rc_style", scope: !407, file: !355, line: 118, baseType: !516, size: 64, offset: 7616)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRcStyle", file: !355, line: 57, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkRcStyle", file: !31, line: 60, size: 3072, elements: !519)
!519 = !{!520, !521, !522, !524, !525, !528, !529, !530, !531, !532, !533, !534, !542, !550, !551}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !518, file: !31, line: 62, baseType: !410, size: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !518, file: !31, line: 66, baseType: !402, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bg_pixmap_name", scope: !518, file: !31, line: 67, baseType: !523, size: 320, offset: 256)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 320, elements: !421)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "font_desc", scope: !518, file: !31, line: 68, baseType: !433, size: 64, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "color_flags", scope: !518, file: !31, line: 70, baseType: !526, size: 160, offset: 640)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 160, elements: !421)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRcFlags", file: !31, line: 58, baseType: !30)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fg", scope: !518, file: !31, line: 71, baseType: !412, size: 480, offset: 800)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !518, file: !31, line: 72, baseType: !412, size: 480, offset: 1280)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !518, file: !31, line: 73, baseType: !412, size: 480, offset: 1760)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !518, file: !31, line: 74, baseType: !412, size: 480, offset: 2240)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "xthickness", scope: !518, file: !31, line: 76, baseType: !438, size: 32, offset: 2720)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ythickness", scope: !518, file: !31, line: 77, baseType: !438, size: 32, offset: 2752)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rc_properties", scope: !518, file: !31, line: 80, baseType: !535, size: 64, offset: 2816)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !537, line: 37, baseType: !538)
!537 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/sahil/vim/src")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !537, line: 41, size: 128, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !538, file: !537, line: 43, baseType: !402, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !538, file: !537, line: 44, baseType: !386, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rc_style_lists", scope: !518, file: !31, line: 83, baseType: !543, size: 64, offset: 2880)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !545, line: 37, baseType: !546)
!545 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/sahil/vim/src")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !545, line: 39, size: 128, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !546, file: !545, line: 41, baseType: !484, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !546, file: !545, line: 42, baseType: !543, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "icon_factories", scope: !518, file: !31, line: 85, baseType: !543, size: 64, offset: 2944)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "engine_specified", scope: !518, file: !31, line: 87, baseType: !386, size: 1, offset: 3008, flags: DIFlagBitField, extraData: i64 3008)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "styles", scope: !407, file: !355, line: 120, baseType: !543, size: 64, offset: 7680)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "property_cache", scope: !407, file: !355, line: 121, baseType: !535, size: 64, offset: 7744)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "icon_factories", scope: !407, file: !355, line: 122, baseType: !543, size: 64, offset: 7808)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "requisition", scope: !356, file: !357, line: 579, baseType: !556, size: 64, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRequisition", file: !357, line: 478, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkRequisition", file: !357, line: 519, size: 64, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !557, file: !357, line: 521, baseType: !438, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !557, file: !357, line: 522, baseType: !438, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "allocation", scope: !356, file: !357, line: 583, baseType: !562, size: 128, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkAllocation", file: !357, line: 498, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkRectangle", file: !21, line: 69, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkRectangle", file: !21, line: 200, size: 128, elements: !565)
!565 = !{!566, !567, !568, !569}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !564, file: !21, line: 202, baseType: !438, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !564, file: !21, line: 203, baseType: !438, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !564, file: !21, line: 204, baseType: !438, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !564, file: !21, line: 205, baseType: !438, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !356, file: !357, line: 589, baseType: !571, size: 64, offset: 640)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkWindow", file: !21, line: 114, baseType: !498)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !356, file: !357, line: 593, baseType: !574, size: 64, offset: 704)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "focus_child", scope: !351, file: !350, line: 58, baseType: !574, size: 64, offset: 768)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !351, file: !350, line: 60, baseType: !386, size: 16, offset: 832, flags: DIFlagBitField, extraData: i64 832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "need_resize", scope: !351, file: !350, line: 63, baseType: !386, size: 1, offset: 848, flags: DIFlagBitField, extraData: i64 832)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "resize_mode", scope: !351, file: !350, line: 64, baseType: !386, size: 2, offset: 849, flags: DIFlagBitField, extraData: i64 832)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reallocate_redraws", scope: !351, file: !350, line: 65, baseType: !386, size: 1, offset: 851, flags: DIFlagBitField, extraData: i64 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "has_focus_chain", scope: !351, file: !350, line: 66, baseType: !386, size: 1, offset: 852, flags: DIFlagBitField, extraData: i64 832)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !346, file: !345, line: 55, baseType: !582, size: 64, offset: 896)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !584, line: 37, baseType: !585)
!584 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/sahil/vim/src")
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !584, line: 39, size: 192, elements: !586)
!586 = !{!587, !588, !589}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !585, file: !584, line: 41, baseType: !484, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !585, file: !584, line: 42, baseType: !582, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !585, file: !584, line: 43, baseType: !582, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "active_menu_item", scope: !346, file: !345, line: 56, baseType: !574, size: 64, offset: 960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "parent_menu_shell", scope: !346, file: !345, line: 57, baseType: !574, size: 64, offset: 1024)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !346, file: !345, line: 59, baseType: !386, size: 32, offset: 1088)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "activate_time", scope: !346, file: !345, line: 60, baseType: !394, size: 32, offset: 1120)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !346, file: !345, line: 62, baseType: !386, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "have_grab", scope: !346, file: !345, line: 63, baseType: !386, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "have_xgrab", scope: !346, file: !345, line: 64, baseType: !386, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_leave", scope: !346, file: !345, line: 65, baseType: !386, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "menu_flag", scope: !346, file: !345, line: 66, baseType: !386, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_enter", scope: !346, file: !345, line: 67, baseType: !386, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard_mode", scope: !346, file: !345, line: 68, baseType: !386, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !6, line: 345, baseType: !342)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !6, line: 1688, baseType: !333)
!604 = !{!605, !616, !621, !623, !640, !642, !644, !0, !646, !648, !666, !668, !670, !672, !674, !676, !691, !693, !695, !697, !704, !751, !765}
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "entered", scope: !607, file: !3, line: 2153, type: !333, isLocal: true, isDefinition: true)
!607 = distinct !DISubprogram(name: "parse_queued_messages", scope: !3, file: !3, line: 2147, type: !608, isLocal: false, isDefinition: true, scopeLine: 2148, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !610)
!608 = !DISubroutineType(types: !609)
!609 = !{null}
!610 = !{!611, !612, !613, !614, !615}
!611 = !DILocalVariable(name: "old_curwin_id", scope: !607, file: !3, line: 2149, type: !333)
!612 = !DILocalVariable(name: "old_curbuf_fnum", scope: !607, file: !3, line: 2150, type: !333)
!613 = !DILocalVariable(name: "i", scope: !607, file: !3, line: 2151, type: !333)
!614 = !DILocalVariable(name: "save_may_garbage_collect", scope: !607, file: !3, line: 2152, type: !333)
!615 = !DILocalVariable(name: "was_safe", scope: !607, file: !3, line: 2154, type: !333)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "typebuf_init", scope: !2, file: !3, line: 85, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 2120, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 265)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "noremapbuf_init", scope: !2, file: !3, line: 86, type: !618, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "saved_typebuf", scope: !2, file: !3, line: 1369, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 5760, elements: !638)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "typebuf_T", file: !147, line: 1155, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !147, line: 1144, size: 384, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tb_buf", scope: !627, file: !147, line: 1146, baseType: !336, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "tb_noremap", scope: !627, file: !147, line: 1147, baseType: !336, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tb_buflen", scope: !627, file: !147, line: 1148, baseType: !333, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tb_off", scope: !627, file: !147, line: 1149, baseType: !333, size: 32, offset: 160)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "tb_len", scope: !627, file: !147, line: 1150, baseType: !333, size: 32, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tb_maplen", scope: !627, file: !147, line: 1151, baseType: !333, size: 32, offset: 224)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tb_silent", scope: !627, file: !147, line: 1152, baseType: !333, size: 32, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "tb_no_abbr_cnt", scope: !627, file: !147, line: 1153, baseType: !333, size: 32, offset: 288)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tb_change_cnt", scope: !627, file: !147, line: 1154, baseType: !333, size: 32, offset: 320)
!638 = !{!639}
!639 = !DISubrange(count: 15)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "old_mod_mask", scope: !2, file: !3, line: 1386, type: !333, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "old_mouse_row", scope: !2, file: !3, line: 1387, type: !333, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "old_mouse_col", scope: !2, file: !3, line: 1388, type: !333, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "last_recorded_len", scope: !2, file: !3, line: 88, type: !333, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "redobuff", scope: !2, file: !3, line: 43, type: !650, isLocal: true, isDefinition: true)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "buffheader_T", file: !147, line: 539, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffheader", file: !147, line: 553, size: 256, elements: !652)
!652 = !{!653, !663, !664, !665}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bh_first", scope: !651, file: !147, line: 555, baseType: !654, size: 128)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "buffblock_T", file: !147, line: 538, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffblock", file: !147, line: 544, size: 128, elements: !656)
!656 = !{!657, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !655, file: !147, line: 546, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "b_str", scope: !655, file: !147, line: 547, baseType: !660, size: 8, offset: 64)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 8, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 1)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bh_curr", scope: !651, file: !147, line: 556, baseType: !658, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bh_index", scope: !651, file: !147, line: 557, baseType: !333, size: 32, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bh_space", scope: !651, file: !147, line: 558, baseType: !333, size: 32, offset: 224)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "readbuf1", scope: !2, file: !3, line: 310, type: !650, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "readbuf2", scope: !2, file: !3, line: 313, type: !650, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "typeahead_char", scope: !2, file: !3, line: 47, type: !333, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "block_redo", scope: !2, file: !3, line: 53, type: !333, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "old_redobuff", scope: !2, file: !3, line: 44, type: !650, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "bp", scope: !678, file: !3, line: 740, type: !658, isLocal: true, isDefinition: true)
!678 = distinct !DISubprogram(name: "read_redo", scope: !3, file: !3, line: 738, type: !679, isLocal: true, isDefinition: true, scopeLine: 739, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !681)
!679 = !DISubroutineType(types: !680)
!680 = !{!333, !333, !333}
!681 = !{!682, !683, !684, !685, !686, !690}
!682 = !DILocalVariable(name: "init", arg: 1, scope: !678, file: !3, line: 738, type: !333)
!683 = !DILocalVariable(name: "old_redo", arg: 2, scope: !678, file: !3, line: 738, type: !333)
!684 = !DILocalVariable(name: "c", scope: !678, file: !3, line: 742, type: !333)
!685 = !DILocalVariable(name: "n", scope: !678, file: !3, line: 743, type: !333)
!686 = !DILocalVariable(name: "buf", scope: !678, file: !3, line: 744, type: !687)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 176, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 22)
!690 = !DILocalVariable(name: "i", scope: !678, file: !3, line: 745, type: !333)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "p", scope: !678, file: !3, line: 741, type: !336, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "KeyNoremap", scope: !2, file: !3, line: 55, type: !333, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "old_char", scope: !2, file: !3, line: 1385, type: !333, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "count", scope: !699, file: !3, line: 1575, type: !333, isLocal: true, isDefinition: true)
!699 = distinct !DISubprogram(name: "updatescript", scope: !3, file: !3, line: 1573, type: !700, isLocal: true, isDefinition: true, scopeLine: 1574, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !702)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !333}
!702 = !{!703}
!703 = !DILocalVariable(name: "c", arg: 1, scope: !699, file: !3, line: 1573, type: !333)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "tc", scope: !706, file: !3, line: 3162, type: !333, isLocal: true, isDefinition: true)
!706 = distinct !DISubprogram(name: "vgetorpeek", scope: !3, file: !3, line: 2864, type: !707, isLocal: true, isDefinition: true, scopeLine: 2865, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !709)
!707 = !DISubroutineType(types: !708)
!708 = !{!333, !333}
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !730, !731, !732, !737, !740, !741, !742, !745}
!710 = !DILocalVariable(name: "advance", arg: 1, scope: !706, file: !3, line: 2864, type: !333)
!711 = !DILocalVariable(name: "c", scope: !706, file: !3, line: 2866, type: !333)
!712 = !DILocalVariable(name: "c1", scope: !706, file: !3, line: 2866, type: !333)
!713 = !DILocalVariable(name: "timedout", scope: !706, file: !3, line: 2867, type: !333)
!714 = !DILocalVariable(name: "mapdepth", scope: !706, file: !3, line: 2869, type: !333)
!715 = !DILocalVariable(name: "mode_deleted", scope: !706, file: !3, line: 2870, type: !333)
!716 = !DILocalVariable(name: "new_wcol", scope: !706, file: !3, line: 2872, type: !333)
!717 = !DILocalVariable(name: "new_wrow", scope: !706, file: !3, line: 2872, type: !333)
!718 = !DILocalVariable(name: "shape_changed", scope: !706, file: !3, line: 2875, type: !333)
!719 = !DILocalVariable(name: "n", scope: !706, file: !3, line: 2877, type: !333)
!720 = !DILocalVariable(name: "old_wcol", scope: !706, file: !3, line: 2878, type: !333)
!721 = !DILocalVariable(name: "old_wrow", scope: !706, file: !3, line: 2878, type: !333)
!722 = !DILocalVariable(name: "wait_tb_len", scope: !706, file: !3, line: 2879, type: !333)
!723 = !DILocalVariable(name: "wait_time", scope: !724, file: !3, line: 2939, type: !335)
!724 = distinct !DILexicalBlock(scope: !725, file: !3, line: 2938, column: 6)
!725 = distinct !DILexicalBlock(scope: !726, file: !3, line: 2937, column: 6)
!726 = distinct !DILexicalBlock(scope: !727, file: !3, line: 2937, column: 6)
!727 = distinct !DILexicalBlock(scope: !728, file: !3, line: 2930, column: 2)
!728 = distinct !DILexicalBlock(scope: !729, file: !3, line: 2917, column: 6)
!729 = distinct !DILexicalBlock(scope: !706, file: !3, line: 2905, column: 5)
!730 = !DILocalVariable(name: "keylen", scope: !724, file: !3, line: 2940, type: !333)
!731 = !DILocalVariable(name: "showcmd_idx", scope: !724, file: !3, line: 2942, type: !333)
!732 = !DILocalVariable(name: "result", scope: !733, file: !3, line: 2988, type: !736)
!733 = distinct !DILexicalBlock(scope: !734, file: !3, line: 2984, column: 3)
!734 = distinct !DILexicalBlock(scope: !735, file: !3, line: 2983, column: 12)
!735 = distinct !DILexicalBlock(scope: !724, file: !3, line: 2953, column: 7)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "map_result_T", file: !3, line: 2246, baseType: !324)
!737 = !DILocalVariable(name: "col", scope: !738, file: !3, line: 3056, type: !603)
!738 = distinct !DILexicalBlock(scope: !739, file: !3, line: 3055, column: 3)
!739 = distinct !DILexicalBlock(scope: !724, file: !3, line: 3044, column: 11)
!740 = !DILocalVariable(name: "vcol", scope: !738, file: !3, line: 3056, type: !603)
!741 = !DILocalVariable(name: "ptr", scope: !738, file: !3, line: 3057, type: !336)
!742 = !DILocalVariable(name: "save_State", scope: !743, file: !3, line: 3068, type: !333)
!743 = distinct !DILexicalBlock(scope: !744, file: !3, line: 3067, column: 7)
!744 = distinct !DILexicalBlock(scope: !738, file: !3, line: 3066, column: 11)
!745 = !DILocalVariable(name: "nop_buf", scope: !746, file: !3, line: 3377, type: !748)
!746 = distinct !DILexicalBlock(scope: !747, file: !3, line: 3376, column: 5)
!747 = distinct !DILexicalBlock(scope: !706, file: !3, line: 3375, column: 9)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 24, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 3)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "buf", scope: !753, file: !3, line: 1257, type: !762, isLocal: true, isDefinition: true)
!753 = distinct !DISubprogram(name: "gotchars", scope: !3, file: !3, line: 1253, type: !754, isLocal: true, isDefinition: true, scopeLine: 1254, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !336, !333}
!756 = !{!757, !758, !759, !760, !761}
!757 = !DILocalVariable(name: "chars", arg: 1, scope: !753, file: !3, line: 1253, type: !336)
!758 = !DILocalVariable(name: "len", arg: 2, scope: !753, file: !3, line: 1253, type: !333)
!759 = !DILocalVariable(name: "s", scope: !753, file: !3, line: 1255, type: !336)
!760 = !DILocalVariable(name: "i", scope: !753, file: !3, line: 1256, type: !333)
!761 = !DILocalVariable(name: "todo", scope: !753, file: !3, line: 1259, type: !333)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 32, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 4)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "buflen", scope: !753, file: !3, line: 1258, type: !333, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!768 = !{i32 2, !"Dwarf Version", i32 4}
!769 = !{i32 2, !"Debug Info Version", i32 3}
!770 = !{i32 1, !"wchar_size", i32 4}
!771 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!772 = distinct !DISubprogram(name: "get_recorded", scope: !3, file: !3, line: 151, type: !773, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{!336}
!775 = !{!776, !777}
!776 = !DILocalVariable(name: "p", scope: !772, file: !3, line: 153, type: !336)
!777 = !DILocalVariable(name: "len", scope: !772, file: !3, line: 154, type: !340)
!778 = !DILocalVariable(name: "buffer", arg: 1, scope: !779, file: !3, line: 121, type: !782)
!779 = distinct !DISubprogram(name: "get_buffcont", scope: !3, file: !3, line: 120, type: !780, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !783)
!780 = !DISubroutineType(types: !781)
!781 = !{!336, !782, !333}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!783 = !{!778, !784, !785, !786, !787, !788, !789}
!784 = !DILocalVariable(name: "dozero", arg: 2, scope: !779, file: !3, line: 122, type: !333)
!785 = !DILocalVariable(name: "count", scope: !779, file: !3, line: 124, type: !602)
!786 = !DILocalVariable(name: "p", scope: !779, file: !3, line: 125, type: !336)
!787 = !DILocalVariable(name: "p2", scope: !779, file: !3, line: 126, type: !336)
!788 = !DILocalVariable(name: "str", scope: !779, file: !3, line: 127, type: !336)
!789 = !DILocalVariable(name: "bp", scope: !779, file: !3, line: 128, type: !658)
!790 = !DILocation(line: 121, column: 19, scope: !779, inlinedAt: !791)
!791 = distinct !DILocation(line: 156, column: 9, scope: !772)
!792 = !DILocation(line: 122, column: 11, scope: !779, inlinedAt: !791)
!793 = !DILocation(line: 124, column: 16, scope: !779, inlinedAt: !791)
!794 = !DILocation(line: 125, column: 17, scope: !779, inlinedAt: !791)
!795 = !DILocation(line: 128, column: 18, scope: !779, inlinedAt: !791)
!796 = !{!797, !798, i64 0}
!797 = !{!"buffblock", !798, i64 0, !799, i64 8}
!798 = !{!"any pointer", !799, i64 0}
!799 = !{!"omnipotent char", !800, i64 0}
!800 = !{!"Simple C/C++ TBAA"}
!801 = !DILocation(line: 131, column: 43, scope: !802, inlinedAt: !791)
!802 = distinct !DILexicalBlock(scope: !803, file: !3, line: 131, column: 5)
!803 = distinct !DILexicalBlock(scope: !779, file: !3, line: 131, column: 5)
!804 = !DILocation(line: 131, column: 5, scope: !803, inlinedAt: !791)
!805 = !DILocation(line: 132, column: 19, scope: !802, inlinedAt: !791)
!806 = !DILocation(line: 132, column: 8, scope: !802, inlinedAt: !791)
!807 = !DILocation(line: 131, column: 61, scope: !802, inlinedAt: !791)
!808 = distinct !{!808, !809, !810}
!809 = !DILocation(line: 131, column: 5, scope: !803)
!810 = !DILocation(line: 132, column: 19, scope: !803)
!811 = !DILocation(line: 134, column: 47, scope: !812, inlinedAt: !791)
!812 = distinct !DILexicalBlock(scope: !779, file: !3, line: 134, column: 9)
!813 = !DILocation(line: 134, column: 35, scope: !812, inlinedAt: !791)
!814 = !DILocation(line: 134, column: 53, scope: !812, inlinedAt: !791)
!815 = !DILocation(line: 134, column: 9, scope: !779, inlinedAt: !791)
!816 = !DILocation(line: 126, column: 17, scope: !779, inlinedAt: !791)
!817 = !DILocation(line: 137, column: 40, scope: !818, inlinedAt: !791)
!818 = distinct !DILexicalBlock(scope: !819, file: !3, line: 137, column: 2)
!819 = distinct !DILexicalBlock(scope: !820, file: !3, line: 137, column: 2)
!820 = distinct !DILexicalBlock(scope: !812, file: !3, line: 135, column: 5)
!821 = !DILocation(line: 137, column: 2, scope: !819, inlinedAt: !791)
!822 = !DILocation(line: 138, column: 17, scope: !823, inlinedAt: !791)
!823 = distinct !DILexicalBlock(scope: !818, file: !3, line: 138, column: 6)
!824 = !DILocation(line: 127, column: 17, scope: !779, inlinedAt: !791)
!825 = !DILocation(line: 138, column: 28, scope: !826, inlinedAt: !791)
!826 = distinct !DILexicalBlock(scope: !823, file: !3, line: 138, column: 6)
!827 = !{!799, !799, i64 0}
!828 = !DILocation(line: 138, column: 6, scope: !823, inlinedAt: !791)
!829 = !DILocation(line: 139, column: 15, scope: !826, inlinedAt: !791)
!830 = !DILocation(line: 139, column: 6, scope: !826, inlinedAt: !791)
!831 = !DILocation(line: 139, column: 9, scope: !826, inlinedAt: !791)
!832 = distinct !{!832, !833, !834}
!833 = !DILocation(line: 138, column: 6, scope: !823)
!834 = !DILocation(line: 139, column: 15, scope: !823)
!835 = !DILocation(line: 137, column: 58, scope: !818, inlinedAt: !791)
!836 = distinct !{!836, !837, !838}
!837 = !DILocation(line: 137, column: 2, scope: !819)
!838 = !DILocation(line: 139, column: 15, scope: !819)
!839 = !DILocation(line: 140, column: 6, scope: !820, inlinedAt: !791)
!840 = !DILocation(line: 141, column: 5, scope: !820, inlinedAt: !791)
!841 = !DILocation(line: 153, column: 13, scope: !772)
!842 = !DILocalVariable(name: "buf", arg: 1, scope: !843, file: !3, line: 103, type: !782)
!843 = distinct !DISubprogram(name: "free_buff", scope: !3, file: !3, line: 103, type: !844, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !846)
!844 = !DISubroutineType(types: !845)
!845 = !{null, !782}
!846 = !{!842, !847, !848}
!847 = !DILocalVariable(name: "p", scope: !843, file: !3, line: 105, type: !658)
!848 = !DILocalVariable(name: "np", scope: !843, file: !3, line: 105, type: !658)
!849 = !DILocation(line: 103, column: 25, scope: !843, inlinedAt: !850)
!850 = distinct !DILocation(line: 157, column: 5, scope: !772)
!851 = !DILocation(line: 107, column: 28, scope: !852, inlinedAt: !850)
!852 = distinct !DILexicalBlock(scope: !843, file: !3, line: 107, column: 5)
!853 = !{!854, !798, i64 0}
!854 = !{!"buffheader", !797, i64 0, !798, i64 16, !855, i64 24, !855, i64 28}
!855 = !{!"int", !799, i64 0}
!856 = !DILocation(line: 105, column: 18, scope: !843, inlinedAt: !850)
!857 = !DILocation(line: 107, column: 38, scope: !858, inlinedAt: !850)
!858 = distinct !DILexicalBlock(scope: !852, file: !3, line: 107, column: 5)
!859 = !DILocation(line: 107, column: 5, scope: !852, inlinedAt: !850)
!860 = !DILocation(line: 109, column: 10, scope: !861, inlinedAt: !850)
!861 = distinct !DILexicalBlock(scope: !858, file: !3, line: 108, column: 5)
!862 = !DILocation(line: 105, column: 22, scope: !843, inlinedAt: !850)
!863 = !DILocation(line: 110, column: 2, scope: !861, inlinedAt: !850)
!864 = distinct !{!864, !865, !866}
!865 = !DILocation(line: 107, column: 5, scope: !852)
!866 = !DILocation(line: 111, column: 5, scope: !852)
!867 = !DILocation(line: 112, column: 26, scope: !843, inlinedAt: !850)
!868 = !DILocation(line: 163, column: 11, scope: !772)
!869 = !DILocation(line: 154, column: 12, scope: !772)
!870 = !DILocation(line: 164, column: 9, scope: !871)
!871 = distinct !DILexicalBlock(scope: !772, file: !3, line: 164, column: 9)
!872 = !DILocation(line: 164, column: 21, scope: !871)
!873 = !{!855, !855, i64 0}
!874 = !DILocation(line: 164, column: 18, scope: !871)
!875 = !DILocation(line: 164, column: 9, scope: !772)
!876 = !DILocation(line: 166, column: 9, scope: !877)
!877 = distinct !DILexicalBlock(scope: !871, file: !3, line: 165, column: 5)
!878 = !DILocation(line: 166, column: 6, scope: !877)
!879 = !DILocation(line: 167, column: 2, scope: !877)
!880 = !DILocation(line: 167, column: 9, scope: !877)
!881 = !DILocation(line: 168, column: 5, scope: !877)
!882 = !DILocation(line: 174, column: 13, scope: !883)
!883 = distinct !DILexicalBlock(scope: !772, file: !3, line: 174, column: 9)
!884 = !DILocation(line: 174, column: 20, scope: !883)
!885 = !DILocation(line: 174, column: 33, scope: !883)
!886 = !DILocation(line: 174, column: 17, scope: !883)
!887 = !DILocation(line: 174, column: 47, scope: !883)
!888 = !DILocation(line: 174, column: 41, scope: !883)
!889 = !DILocation(line: 174, column: 52, scope: !883)
!890 = !DILocation(line: 174, column: 9, scope: !772)
!891 = !DILocation(line: 175, column: 13, scope: !883)
!892 = !DILocation(line: 175, column: 2, scope: !883)
!893 = !DILocation(line: 177, column: 5, scope: !772)
!894 = distinct !DISubprogram(name: "get_inserted", scope: !3, file: !3, line: 185, type: !773, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !895)
!895 = !{}
!896 = !DILocation(line: 121, column: 19, scope: !779, inlinedAt: !897)
!897 = distinct !DILocation(line: 187, column: 12, scope: !894)
!898 = !DILocation(line: 122, column: 11, scope: !779, inlinedAt: !897)
!899 = !DILocation(line: 124, column: 16, scope: !779, inlinedAt: !897)
!900 = !DILocation(line: 125, column: 17, scope: !779, inlinedAt: !897)
!901 = !DILocation(line: 128, column: 18, scope: !779, inlinedAt: !897)
!902 = !DILocation(line: 131, column: 43, scope: !802, inlinedAt: !897)
!903 = !DILocation(line: 131, column: 5, scope: !803, inlinedAt: !897)
!904 = !DILocation(line: 132, column: 19, scope: !802, inlinedAt: !897)
!905 = !DILocation(line: 132, column: 8, scope: !802, inlinedAt: !897)
!906 = !DILocation(line: 131, column: 61, scope: !802, inlinedAt: !897)
!907 = !DILocation(line: 134, column: 10, scope: !812, inlinedAt: !897)
!908 = !DILocation(line: 134, column: 16, scope: !812, inlinedAt: !897)
!909 = !DILocation(line: 134, column: 47, scope: !812, inlinedAt: !897)
!910 = !DILocation(line: 134, column: 35, scope: !812, inlinedAt: !897)
!911 = !DILocation(line: 134, column: 53, scope: !812, inlinedAt: !897)
!912 = !DILocation(line: 134, column: 9, scope: !779, inlinedAt: !897)
!913 = !DILocation(line: 126, column: 17, scope: !779, inlinedAt: !897)
!914 = !DILocation(line: 137, column: 40, scope: !818, inlinedAt: !897)
!915 = !DILocation(line: 137, column: 2, scope: !819, inlinedAt: !897)
!916 = !DILocation(line: 138, column: 17, scope: !823, inlinedAt: !897)
!917 = !DILocation(line: 127, column: 17, scope: !779, inlinedAt: !897)
!918 = !DILocation(line: 138, column: 28, scope: !826, inlinedAt: !897)
!919 = !DILocation(line: 138, column: 6, scope: !823, inlinedAt: !897)
!920 = !DILocation(line: 139, column: 15, scope: !826, inlinedAt: !897)
!921 = !DILocation(line: 139, column: 6, scope: !826, inlinedAt: !897)
!922 = !DILocation(line: 139, column: 9, scope: !826, inlinedAt: !897)
!923 = !DILocation(line: 137, column: 58, scope: !818, inlinedAt: !897)
!924 = !DILocation(line: 140, column: 6, scope: !820, inlinedAt: !897)
!925 = !DILocation(line: 141, column: 5, scope: !820, inlinedAt: !897)
!926 = !DILocation(line: 187, column: 5, scope: !894)
!927 = distinct !DISubprogram(name: "stuff_empty", scope: !3, file: !3, line: 378, type: !928, isLocal: false, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !895)
!928 = !DISubroutineType(types: !929)
!929 = !{!333}
!930 = !DILocation(line: 380, column: 31, scope: !927)
!931 = !DILocation(line: 380, column: 38, scope: !927)
!932 = !DILocation(line: 381, column: 24, scope: !927)
!933 = !DILocation(line: 381, column: 31, scope: !927)
!934 = !DILocation(line: 381, column: 3, scope: !927)
!935 = !DILocation(line: 380, column: 5, scope: !927)
!936 = distinct !DISubprogram(name: "readbuf1_empty", scope: !3, file: !3, line: 390, type: !928, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !895)
!937 = !DILocation(line: 392, column: 31, scope: !936)
!938 = !DILocation(line: 392, column: 38, scope: !936)
!939 = !DILocation(line: 392, column: 5, scope: !936)
!940 = distinct !DISubprogram(name: "typeahead_noflush", scope: !3, file: !3, line: 400, type: !700, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !941)
!941 = !{!942}
!942 = !DILocalVariable(name: "c", arg: 1, scope: !940, file: !3, line: 400, type: !333)
!943 = !DILocation(line: 400, column: 23, scope: !940)
!944 = !DILocation(line: 402, column: 20, scope: !940)
!945 = !DILocation(line: 403, column: 1, scope: !940)
!946 = distinct !DISubprogram(name: "flush_buffers", scope: !3, file: !3, line: 411, type: !947, isLocal: false, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !950)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !949}
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "flush_buffers_T", file: !6, line: 2139, baseType: !5)
!950 = !{!951}
!951 = !DILocalVariable(name: "flush_typeahead", arg: 1, scope: !946, file: !3, line: 411, type: !949)
!952 = !DILocation(line: 411, column: 31, scope: !946)
!953 = !DILocation(line: 923, column: 17, scope: !954, inlinedAt: !956)
!954 = distinct !DILexicalBlock(scope: !955, file: !3, line: 923, column: 9)
!955 = distinct !DISubprogram(name: "init_typebuf", scope: !3, file: !3, line: 921, type: !608, isLocal: true, isDefinition: true, scopeLine: 922, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !895)
!956 = distinct !DILocation(line: 413, column: 5, scope: !946)
!957 = !{!958, !798, i64 0}
!958 = !{!"", !798, i64 0, !798, i64 8, !855, i64 16, !855, i64 20, !855, i64 24, !855, i64 28, !855, i64 32, !855, i64 36, !855, i64 40}
!959 = !DILocation(line: 923, column: 24, scope: !954, inlinedAt: !956)
!960 = !DILocation(line: 923, column: 9, scope: !955, inlinedAt: !956)
!961 = !DILocation(line: 925, column: 17, scope: !962, inlinedAt: !956)
!962 = distinct !DILexicalBlock(scope: !954, file: !3, line: 924, column: 5)
!963 = !{!798, !798, i64 0}
!964 = !DILocation(line: 927, column: 20, scope: !962, inlinedAt: !956)
!965 = !{!958, !855, i64 16}
!966 = !DILocation(line: 928, column: 17, scope: !962, inlinedAt: !956)
!967 = !{!958, !855, i64 24}
!968 = !DILocation(line: 929, column: 17, scope: !962, inlinedAt: !956)
!969 = !{!958, !855, i64 20}
!970 = !DILocation(line: 930, column: 24, scope: !962, inlinedAt: !956)
!971 = !{!958, !855, i64 40}
!972 = !DILocation(line: 931, column: 5, scope: !962, inlinedAt: !956)
!973 = !DILocation(line: 362, column: 27, scope: !974, inlinedAt: !976)
!974 = distinct !DILexicalBlock(scope: !975, file: !3, line: 362, column: 9)
!975 = distinct !DISubprogram(name: "start_stuff", scope: !3, file: !3, line: 360, type: !608, isLocal: true, isDefinition: true, scopeLine: 361, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !895)
!976 = distinct !DILocation(line: 415, column: 5, scope: !946)
!977 = !DILocation(line: 362, column: 34, scope: !974, inlinedAt: !976)
!978 = !DILocation(line: 362, column: 9, scope: !975, inlinedAt: !976)
!979 = !DILocation(line: 364, column: 19, scope: !980, inlinedAt: !976)
!980 = distinct !DILexicalBlock(scope: !974, file: !3, line: 363, column: 5)
!981 = !{!854, !798, i64 16}
!982 = !DILocation(line: 365, column: 20, scope: !980, inlinedAt: !976)
!983 = !{!854, !855, i64 28}
!984 = !DILocation(line: 366, column: 5, scope: !980, inlinedAt: !976)
!985 = !DILocation(line: 367, column: 27, scope: !986, inlinedAt: !976)
!986 = distinct !DILexicalBlock(scope: !975, file: !3, line: 367, column: 9)
!987 = !DILocation(line: 367, column: 34, scope: !986, inlinedAt: !976)
!988 = !DILocation(line: 367, column: 9, scope: !975, inlinedAt: !976)
!989 = !DILocation(line: 369, column: 19, scope: !990, inlinedAt: !976)
!990 = distinct !DILexicalBlock(scope: !986, file: !3, line: 368, column: 5)
!991 = !DILocation(line: 370, column: 20, scope: !990, inlinedAt: !976)
!992 = !DILocation(line: 371, column: 5, scope: !990, inlinedAt: !976)
!993 = !DILocation(line: 338, column: 30, scope: !994, inlinedAt: !1003)
!994 = distinct !DILexicalBlock(scope: !995, file: !3, line: 338, column: 9)
!995 = distinct !DISubprogram(name: "read_readbuf", scope: !3, file: !3, line: 333, type: !996, isLocal: true, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !998)
!996 = !DISubroutineType(types: !997)
!997 = !{!333, !782, !333}
!998 = !{!999, !1000, !1001, !1002}
!999 = !DILocalVariable(name: "buf", arg: 1, scope: !995, file: !3, line: 333, type: !782)
!1000 = !DILocalVariable(name: "advance", arg: 2, scope: !995, file: !3, line: 333, type: !333)
!1001 = !DILocalVariable(name: "c", scope: !995, file: !3, line: 335, type: !337)
!1002 = !DILocalVariable(name: "curr", scope: !995, file: !3, line: 336, type: !658)
!1003 = distinct !DILocation(line: 326, column: 9, scope: !1004, inlinedAt: !1008)
!1004 = distinct !DISubprogram(name: "read_readbuffers", scope: !3, file: !3, line: 322, type: !707, isLocal: true, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1005)
!1005 = !{!1006, !1007}
!1006 = !DILocalVariable(name: "advance", arg: 1, scope: !1004, file: !3, line: 322, type: !333)
!1007 = !DILocalVariable(name: "c", scope: !1004, file: !3, line: 324, type: !333)
!1008 = distinct !DILocation(line: 416, column: 12, scope: !946)
!1009 = !DILocation(line: 338, column: 23, scope: !994, inlinedAt: !1003)
!1010 = !DILocation(line: 322, column: 22, scope: !1004, inlinedAt: !1008)
!1011 = !DILocation(line: 333, column: 28, scope: !995, inlinedAt: !1003)
!1012 = !DILocation(line: 333, column: 37, scope: !995, inlinedAt: !1003)
!1013 = !DILocation(line: 338, column: 9, scope: !995, inlinedAt: !1003)
!1014 = !DILocation(line: 336, column: 18, scope: !995, inlinedAt: !1003)
!1015 = !DILocation(line: 342, column: 26, scope: !995, inlinedAt: !1003)
!1016 = !{!854, !855, i64 24}
!1017 = !DILocation(line: 342, column: 9, scope: !995, inlinedAt: !1003)
!1018 = !DILocation(line: 335, column: 12, scope: !995, inlinedAt: !1003)
!1019 = !DILocation(line: 346, column: 18, scope: !1020, inlinedAt: !1003)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 346, column: 6)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 345, column: 5)
!1022 = distinct !DILexicalBlock(scope: !995, file: !3, line: 344, column: 9)
!1023 = !DILocation(line: 346, column: 6, scope: !1020, inlinedAt: !1003)
!1024 = !DILocation(line: 346, column: 35, scope: !1020, inlinedAt: !1003)
!1025 = !DILocation(line: 346, column: 6, scope: !1021, inlinedAt: !1003)
!1026 = !DILocation(line: 348, column: 35, scope: !1027, inlinedAt: !1003)
!1027 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 347, column: 2)
!1028 = !DILocation(line: 348, column: 27, scope: !1027, inlinedAt: !1003)
!1029 = !DILocation(line: 349, column: 15, scope: !1027, inlinedAt: !1003)
!1030 = !DILocation(line: 349, column: 6, scope: !1027, inlinedAt: !1003)
!1031 = !DILocation(line: 350, column: 20, scope: !1027, inlinedAt: !1003)
!1032 = !DILocation(line: 351, column: 2, scope: !1027, inlinedAt: !1003)
!1033 = !DILocation(line: 327, column: 11, scope: !1034, inlinedAt: !1008)
!1034 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 327, column: 9)
!1035 = !DILocation(line: 327, column: 9, scope: !1004, inlinedAt: !1008)
!1036 = !DILocation(line: 333, column: 28, scope: !995, inlinedAt: !1037)
!1037 = distinct !DILocation(line: 328, column: 6, scope: !1034, inlinedAt: !1008)
!1038 = !DILocation(line: 333, column: 37, scope: !995, inlinedAt: !1037)
!1039 = !DILocation(line: 338, column: 23, scope: !994, inlinedAt: !1037)
!1040 = !DILocation(line: 338, column: 30, scope: !994, inlinedAt: !1037)
!1041 = !DILocation(line: 338, column: 9, scope: !995, inlinedAt: !1037)
!1042 = !DILocation(line: 336, column: 18, scope: !995, inlinedAt: !1037)
!1043 = !DILocation(line: 342, column: 26, scope: !995, inlinedAt: !1037)
!1044 = !DILocation(line: 342, column: 9, scope: !995, inlinedAt: !1037)
!1045 = !DILocation(line: 335, column: 12, scope: !995, inlinedAt: !1037)
!1046 = !DILocation(line: 346, column: 18, scope: !1020, inlinedAt: !1037)
!1047 = !DILocation(line: 346, column: 6, scope: !1020, inlinedAt: !1037)
!1048 = !DILocation(line: 346, column: 35, scope: !1020, inlinedAt: !1037)
!1049 = !DILocation(line: 346, column: 6, scope: !1021, inlinedAt: !1037)
!1050 = !DILocation(line: 348, column: 35, scope: !1027, inlinedAt: !1037)
!1051 = !DILocation(line: 348, column: 27, scope: !1027, inlinedAt: !1037)
!1052 = !DILocation(line: 349, column: 15, scope: !1027, inlinedAt: !1037)
!1053 = !DILocation(line: 349, column: 6, scope: !1027, inlinedAt: !1037)
!1054 = !DILocation(line: 350, column: 20, scope: !1027, inlinedAt: !1037)
!1055 = !DILocation(line: 351, column: 2, scope: !1027, inlinedAt: !1037)
!1056 = !DILocation(line: 416, column: 35, scope: !946)
!1057 = !DILocation(line: 416, column: 5, scope: !946)
!1058 = distinct !{!1058, !1057, !1059}
!1059 = !DILocation(line: 417, column: 2, scope: !946)
!1060 = !DILocation(line: 419, column: 9, scope: !946)
!1061 = !DILocation(line: 436, column: 28, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 432, column: 6)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 430, column: 5)
!1064 = distinct !DILexicalBlock(scope: !946, file: !3, line: 419, column: 9)
!1065 = !DILocation(line: 422, column: 28, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 420, column: 5)
!1067 = !{!958, !855, i64 28}
!1068 = !DILocation(line: 422, column: 17, scope: !1066)
!1069 = !DILocation(line: 423, column: 17, scope: !1066)
!1070 = !DILocation(line: 425, column: 21, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 425, column: 6)
!1072 = !DILocation(line: 425, column: 6, scope: !1066)
!1073 = !DILocation(line: 436, column: 44, scope: !1062)
!1074 = !DILocation(line: 436, column: 54, scope: !1062)
!1075 = !DILocation(line: 436, column: 13, scope: !1062)
!1076 = !DILocation(line: 436, column: 64, scope: !1062)
!1077 = !DILocation(line: 436, column: 6, scope: !1062)
!1078 = distinct !{!1078, !1077, !1079}
!1079 = !DILocation(line: 437, column: 3, scope: !1062)
!1080 = !DILocation(line: 438, column: 17, scope: !1063)
!1081 = !DILocation(line: 439, column: 17, scope: !1063)
!1082 = !DILocation(line: 446, column: 23, scope: !946)
!1083 = !DILocation(line: 447, column: 23, scope: !946)
!1084 = !{!958, !855, i64 32}
!1085 = !DILocation(line: 448, column: 16, scope: !946)
!1086 = !DILocation(line: 449, column: 28, scope: !946)
!1087 = !{!958, !855, i64 36}
!1088 = !DILocation(line: 450, column: 9, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !946, file: !3, line: 450, column: 9)
!1090 = !DILocation(line: 450, column: 33, scope: !1089)
!1091 = !DILocation(line: 450, column: 9, scope: !946)
!1092 = !DILocation(line: 452, column: 1, scope: !946)
!1093 = distinct !DISubprogram(name: "inchar", scope: !3, file: !3, line: 3416, type: !1094, isLocal: true, isDefinition: true, scopeLine: 3420, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1096)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!333, !336, !333, !335}
!1096 = !{!1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104}
!1097 = !DILocalVariable(name: "buf", arg: 1, scope: !1093, file: !3, line: 3417, type: !336)
!1098 = !DILocalVariable(name: "maxlen", arg: 2, scope: !1093, file: !3, line: 3418, type: !333)
!1099 = !DILocalVariable(name: "wait_time", arg: 3, scope: !1093, file: !3, line: 3419, type: !335)
!1100 = !DILocalVariable(name: "len", scope: !1093, file: !3, line: 3421, type: !333)
!1101 = !DILocalVariable(name: "retesc", scope: !1093, file: !3, line: 3422, type: !333)
!1102 = !DILocalVariable(name: "script_char", scope: !1093, file: !3, line: 3423, type: !333)
!1103 = !DILocalVariable(name: "tb_change_cnt", scope: !1093, file: !3, line: 3424, type: !333)
!1104 = !DILocalVariable(name: "dum", scope: !1105, file: !3, line: 3499, type: !1109)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 3497, column: 2)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 3496, column: 6)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 3487, column: 5)
!1108 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 3486, column: 9)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 1232, elements: !1110)
!1110 = !{!1111}
!1111 = !DISubrange(count: 154)
!1112 = !DILocation(line: 3417, column: 13, scope: !1093)
!1113 = !DILocation(line: 3418, column: 10, scope: !1093)
!1114 = !DILocation(line: 3419, column: 10, scope: !1093)
!1115 = !DILocation(line: 3421, column: 10, scope: !1093)
!1116 = !DILocation(line: 3422, column: 10, scope: !1093)
!1117 = !DILocation(line: 3424, column: 34, scope: !1093)
!1118 = !DILocation(line: 3424, column: 10, scope: !1093)
!1119 = !DILocation(line: 3426, column: 19, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 3426, column: 9)
!1121 = !DILocation(line: 3426, column: 39, scope: !1120)
!1122 = !DILocation(line: 3426, column: 26, scope: !1120)
!1123 = !DILocation(line: 3428, column: 2, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 3427, column: 5)
!1125 = !DILocation(line: 3429, column: 2, scope: !1124)
!1126 = !DILocation(line: 3431, column: 10, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 3431, column: 6)
!1128 = !{!1129, !855, i64 4}
!1129 = !{!"Gui", !855, i64 0, !855, i64 4, !855, i64 8, !855, i64 12, !855, i64 16, !855, i64 20, !855, i64 24, !798, i64 32, !855, i64 40, !855, i64 44, !855, i64 48, !855, i64 52, !855, i64 56, !799, i64 60, !855, i64 64, !855, i64 68, !855, i64 72, !855, i64 76, !855, i64 80, !855, i64 84, !855, i64 88, !855, i64 92, !855, i64 96, !855, i64 100, !855, i64 104, !799, i64 108, !1130, i64 112, !799, i64 192, !855, i64 204, !855, i64 208, !855, i64 212, !855, i64 216, !855, i64 220, !855, i64 224, !798, i64 232, !855, i64 240, !798, i64 248, !1131, i64 256, !1131, i64 264, !1131, i64 272, !1131, i64 280, !855, i64 288, !798, i64 296, !798, i64 304, !798, i64 312, !798, i64 320, !798, i64 328, !798, i64 336, !798, i64 344, !798, i64 352, !798, i64 360, !798, i64 368, !798, i64 376, !798, i64 384, !798, i64 392, !798, i64 400, !798, i64 408, !798, i64 416, !798, i64 424, !798, i64 432, !855, i64 440, !798, i64 448, !798, i64 456}
!1130 = !{!"GuiScrollbar", !1131, i64 0, !798, i64 8, !855, i64 16, !1131, i64 24, !1131, i64 32, !1131, i64 40, !855, i64 48, !855, i64 52, !855, i64 56, !855, i64 60, !798, i64 64, !1131, i64 72}
!1131 = !{!"long", !799, i64 0}
!1132 = !DILocation(line: 3431, column: 6, scope: !1127)
!1133 = !DILocation(line: 3431, column: 20, scope: !1127)
!1134 = !DILocation(line: 3431, column: 17, scope: !1127)
!1135 = !DILocation(line: 3432, column: 6, scope: !1127)
!1136 = !DILocation(line: 3441, column: 9, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 3441, column: 9)
!1138 = !DILocation(line: 3441, column: 15, scope: !1137)
!1139 = !DILocation(line: 3441, column: 9, scope: !1093)
!1140 = !DILocation(line: 3443, column: 19, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 3442, column: 5)
!1142 = !DILocation(line: 3444, column: 20, scope: !1141)
!1143 = !DILocation(line: 3445, column: 5, scope: !1141)
!1144 = !DILocation(line: 3446, column: 14, scope: !1093)
!1145 = !DILocation(line: 3423, column: 10, scope: !1093)
!1146 = !DILocation(line: 3453, column: 21, scope: !1093)
!1147 = !DILocation(line: 3453, column: 12, scope: !1093)
!1148 = !DILocation(line: 3453, column: 32, scope: !1093)
!1149 = !DILocation(line: 3455, column: 10, scope: !1093)
!1150 = !DILocation(line: 3455, column: 9, scope: !1093)
!1151 = !DILocation(line: 3453, column: 40, scope: !1093)
!1152 = !DILocation(line: 3460, column: 2, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 3458, column: 5)
!1154 = !DILocation(line: 3463, column: 6, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 3463, column: 6)
!1156 = !DILocation(line: 3463, column: 14, scope: !1155)
!1157 = !DILocation(line: 3463, column: 46, scope: !1155)
!1158 = !DILocation(line: 3463, column: 37, scope: !1155)
!1159 = !DILocation(line: 3463, column: 32, scope: !1155)
!1160 = !DILocation(line: 3463, column: 59, scope: !1155)
!1161 = !DILocation(line: 3463, column: 6, scope: !1153)
!1162 = !DILocation(line: 1355, column: 17, scope: !1163, inlinedAt: !1165)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 1355, column: 9)
!1164 = distinct !DISubprogram(name: "free_typebuf", scope: !3, file: !3, line: 1353, type: !608, isLocal: true, isDefinition: true, scopeLine: 1354, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !895)
!1165 = distinct !DILocation(line: 1524, column: 5, scope: !1166, inlinedAt: !1167)
!1166 = distinct !DISubprogram(name: "closescript", scope: !3, file: !3, line: 1522, type: !608, isLocal: true, isDefinition: true, scopeLine: 1523, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !895)
!1167 = distinct !DILocation(line: 3468, column: 6, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1155, file: !3, line: 3464, column: 2)
!1169 = !DILocation(line: 1355, column: 24, scope: !1163, inlinedAt: !1165)
!1170 = !DILocation(line: 1355, column: 9, scope: !1164, inlinedAt: !1165)
!1171 = !DILocation(line: 1356, column: 2, scope: !1163, inlinedAt: !1165)
!1172 = !DILocation(line: 1358, column: 2, scope: !1173, inlinedAt: !1165)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !3, line: 1358, column: 2)
!1174 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 1358, column: 2)
!1175 = !DILocation(line: 1358, column: 2, scope: !1174, inlinedAt: !1165)
!1176 = !DILocation(line: 1358, column: 2, scope: !1177, inlinedAt: !1165)
!1177 = distinct !DILexicalBlock(scope: !1173, file: !3, line: 1358, column: 2)
!1178 = !DILocation(line: 1359, column: 17, scope: !1179, inlinedAt: !1165)
!1179 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 1359, column: 9)
!1180 = !{!958, !798, i64 8}
!1181 = !DILocation(line: 1359, column: 28, scope: !1179, inlinedAt: !1165)
!1182 = !DILocation(line: 1359, column: 9, scope: !1164, inlinedAt: !1165)
!1183 = !DILocation(line: 1360, column: 2, scope: !1179, inlinedAt: !1165)
!1184 = !DILocation(line: 1362, column: 2, scope: !1185, inlinedAt: !1165)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !3, line: 1362, column: 2)
!1186 = distinct !DILexicalBlock(scope: !1179, file: !3, line: 1362, column: 2)
!1187 = !DILocation(line: 1362, column: 2, scope: !1186, inlinedAt: !1165)
!1188 = !DILocation(line: 1362, column: 2, scope: !1189, inlinedAt: !1165)
!1189 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 1362, column: 2)
!1190 = !DILocation(line: 1525, column: 29, scope: !1166, inlinedAt: !1167)
!1191 = !DILocation(line: 1525, column: 15, scope: !1166, inlinedAt: !1167)
!1192 = !{i64 0, i64 8, !963, i64 8, i64 8, !963, i64 16, i64 4, !873, i64 20, i64 4, !873, i64 24, i64 4, !873, i64 28, i64 4, !873, i64 32, i64 4, !873, i64 36, i64 4, !873, i64 40, i64 4, !873}
!1193 = !DILocation(line: 1527, column: 12, scope: !1166, inlinedAt: !1167)
!1194 = !DILocation(line: 1527, column: 5, scope: !1166, inlinedAt: !1167)
!1195 = !DILocation(line: 1528, column: 14, scope: !1166, inlinedAt: !1167)
!1196 = !DILocation(line: 1528, column: 5, scope: !1166, inlinedAt: !1167)
!1197 = !DILocation(line: 1528, column: 25, scope: !1166, inlinedAt: !1167)
!1198 = !DILocation(line: 1529, column: 19, scope: !1199, inlinedAt: !1167)
!1199 = distinct !DILexicalBlock(scope: !1166, file: !3, line: 1529, column: 9)
!1200 = !DILocation(line: 1529, column: 9, scope: !1166, inlinedAt: !1167)
!1201 = !DILocation(line: 1530, column: 2, scope: !1199, inlinedAt: !1167)
!1202 = !DILocation(line: 3474, column: 10, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 3474, column: 10)
!1204 = !DILocation(line: 3474, column: 10, scope: !1168)
!1205 = !DILocation(line: 3481, column: 15, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1155, file: !3, line: 3480, column: 2)
!1207 = !DILocation(line: 3481, column: 13, scope: !1206)
!1208 = !DILocation(line: 3453, column: 55, scope: !1093)
!1209 = distinct !{!1209, !1210, !1211}
!1210 = !DILocation(line: 3453, column: 5, scope: !1093)
!1211 = !DILocation(line: 3484, column: 5, scope: !1093)
!1212 = !DILocation(line: 3486, column: 9, scope: !1093)
!1213 = !DILocation(line: 3496, column: 6, scope: !1106)
!1214 = !DILocation(line: 3496, column: 6, scope: !1107)
!1215 = !DILocation(line: 3499, column: 6, scope: !1105)
!1216 = !DILocation(line: 3499, column: 13, scope: !1105)
!1217 = !DILocation(line: 3501, column: 6, scope: !1105)
!1218 = !DILocation(line: 3503, column: 9, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1220, file: !3, line: 3502, column: 6)
!1220 = distinct !DILexicalBlock(scope: !1221, file: !3, line: 3501, column: 6)
!1221 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 3501, column: 6)
!1222 = !DILocation(line: 3504, column: 16, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1219, file: !3, line: 3504, column: 7)
!1224 = distinct !{!1224, !1225, !1226}
!1225 = !DILocation(line: 3501, column: 6, scope: !1221)
!1226 = !DILocation(line: 3506, column: 6, scope: !1221)
!1227 = !DILocation(line: 3504, column: 32, scope: !1223)
!1228 = !DILocation(line: 3504, column: 39, scope: !1223)
!1229 = !DILocation(line: 3504, column: 7, scope: !1219)
!1230 = !DILocation(line: 3508, column: 2, scope: !1106)
!1231 = !DILocation(line: 3514, column: 36, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 3514, column: 6)
!1233 = !DILocation(line: 3514, column: 23, scope: !1232)
!1234 = !DILocation(line: 3515, column: 6, scope: !1232)
!1235 = !DILocation(line: 3521, column: 30, scope: !1107)
!1236 = !DILocation(line: 3521, column: 8, scope: !1107)
!1237 = !DILocation(line: 3522, column: 5, scope: !1107)
!1238 = !DILocalVariable(name: "tb_change_cnt", arg: 1, scope: !1239, file: !3, line: 1143, type: !333)
!1239 = distinct !DISubprogram(name: "typebuf_changed", scope: !3, file: !3, line: 1142, type: !707, isLocal: false, isDefinition: true, scopeLine: 1144, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1240)
!1240 = !{!1238}
!1241 = !DILocation(line: 1143, column: 10, scope: !1239, inlinedAt: !1242)
!1242 = distinct !DILocation(line: 3526, column: 9, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 3526, column: 9)
!1244 = !DILocation(line: 1145, column: 27, scope: !1239, inlinedAt: !1242)
!1245 = !DILocation(line: 1145, column: 32, scope: !1239, inlinedAt: !1242)
!1246 = !DILocation(line: 1145, column: 44, scope: !1239, inlinedAt: !1242)
!1247 = !DILocation(line: 1145, column: 58, scope: !1239, inlinedAt: !1242)
!1248 = !DILocation(line: 1147, column: 9, scope: !1239, inlinedAt: !1242)
!1249 = !DILocation(line: 1147, column: 6, scope: !1239, inlinedAt: !1242)
!1250 = !DILocation(line: 3526, column: 9, scope: !1243)
!1251 = !DILocation(line: 3526, column: 9, scope: !1093)
!1252 = !DILocation(line: 3532, column: 13, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 3532, column: 9)
!1254 = !DILocation(line: 3532, column: 17, scope: !1253)
!1255 = !DILocation(line: 3532, column: 20, scope: !1253)
!1256 = !DILocation(line: 3532, column: 44, scope: !1253)
!1257 = !DILocation(line: 3532, column: 9, scope: !1093)
!1258 = !DILocalVariable(name: "buf", arg: 1, scope: !1259, file: !3, line: 3544, type: !336)
!1259 = distinct !DISubprogram(name: "fix_input_buffer", scope: !3, file: !3, line: 3544, type: !1260, isLocal: false, isDefinition: true, scopeLine: 3545, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1262)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!333, !336, !333}
!1262 = !{!1258, !1263, !1264, !1265}
!1263 = !DILocalVariable(name: "len", arg: 2, scope: !1259, file: !3, line: 3544, type: !333)
!1264 = !DILocalVariable(name: "i", scope: !1259, file: !3, line: 3546, type: !333)
!1265 = !DILocalVariable(name: "p", scope: !1259, file: !3, line: 3547, type: !336)
!1266 = !DILocation(line: 3544, column: 26, scope: !1259, inlinedAt: !1267)
!1267 = distinct !DILocation(line: 3535, column: 12, scope: !1093)
!1268 = !DILocation(line: 3544, column: 35, scope: !1259, inlinedAt: !1267)
!1269 = !DILocation(line: 3547, column: 13, scope: !1259, inlinedAt: !1267)
!1270 = !DILocation(line: 3546, column: 10, scope: !1259, inlinedAt: !1267)
!1271 = !DILocation(line: 3556, column: 5, scope: !1272, inlinedAt: !1267)
!1272 = distinct !DILexicalBlock(scope: !1259, file: !3, line: 3556, column: 5)
!1273 = !DILocation(line: 3556, column: 19, scope: !1274, inlinedAt: !1267)
!1274 = distinct !DILexicalBlock(scope: !1272, file: !3, line: 3556, column: 5)
!1275 = !DILocation(line: 3561, column: 10, scope: !1276, inlinedAt: !1267)
!1276 = distinct !DILexicalBlock(scope: !1277, file: !3, line: 3561, column: 6)
!1277 = distinct !DILexicalBlock(scope: !1274, file: !3, line: 3557, column: 5)
!1278 = !DILocation(line: 3561, column: 6, scope: !1276, inlinedAt: !1267)
!1279 = !DILocation(line: 3561, column: 17, scope: !1276, inlinedAt: !1267)
!1280 = !DILocation(line: 3561, column: 37, scope: !1276, inlinedAt: !1267)
!1281 = !DILocation(line: 3561, column: 32, scope: !1276, inlinedAt: !1267)
!1282 = !DILocation(line: 3563, column: 8, scope: !1283, inlinedAt: !1267)
!1283 = distinct !DILexicalBlock(scope: !1276, file: !3, line: 3562, column: 2)
!1284 = !DILocation(line: 3564, column: 8, scope: !1283, inlinedAt: !1267)
!1285 = !DILocation(line: 3565, column: 2, scope: !1283, inlinedAt: !1267)
!1286 = !DILocation(line: 3568, column: 11, scope: !1276, inlinedAt: !1267)
!1287 = !DILocation(line: 3570, column: 6, scope: !1288, inlinedAt: !1267)
!1288 = distinct !DILexicalBlock(scope: !1289, file: !3, line: 3569, column: 2)
!1289 = distinct !DILexicalBlock(scope: !1276, file: !3, line: 3568, column: 11)
!1290 = !DILocation(line: 3571, column: 11, scope: !1288, inlinedAt: !1267)
!1291 = !DILocation(line: 3572, column: 8, scope: !1288, inlinedAt: !1267)
!1292 = !DILocation(line: 3572, column: 11, scope: !1288, inlinedAt: !1267)
!1293 = !DILocation(line: 3573, column: 9, scope: !1288, inlinedAt: !1267)
!1294 = !DILocation(line: 3574, column: 10, scope: !1288, inlinedAt: !1267)
!1295 = !DILocation(line: 3575, column: 2, scope: !1288, inlinedAt: !1267)
!1296 = !DILocation(line: 3579, column: 18, scope: !1297, inlinedAt: !1267)
!1297 = distinct !DILexicalBlock(scope: !1289, file: !3, line: 3579, column: 6)
!1298 = !DILocation(line: 3581, column: 13, scope: !1297, inlinedAt: !1267)
!1299 = !DILocation(line: 3581, column: 17, scope: !1297, inlinedAt: !1267)
!1300 = !DILocation(line: 3581, column: 20, scope: !1297, inlinedAt: !1267)
!1301 = !DILocation(line: 3581, column: 25, scope: !1297, inlinedAt: !1267)
!1302 = !DILocation(line: 3581, column: 37, scope: !1297, inlinedAt: !1267)
!1303 = !DILocation(line: 3581, column: 40, scope: !1297, inlinedAt: !1267)
!1304 = !DILocation(line: 3581, column: 45, scope: !1297, inlinedAt: !1267)
!1305 = !DILocation(line: 3579, column: 6, scope: !1289, inlinedAt: !1267)
!1306 = !DILocation(line: 3592, column: 6, scope: !1307, inlinedAt: !1267)
!1307 = distinct !DILexicalBlock(scope: !1297, file: !3, line: 3591, column: 2)
!1308 = !DILocation(line: 3594, column: 13, scope: !1307, inlinedAt: !1267)
!1309 = !DILocation(line: 3594, column: 11, scope: !1307, inlinedAt: !1267)
!1310 = !DILocation(line: 3593, column: 6, scope: !1307, inlinedAt: !1267)
!1311 = !DILocation(line: 3593, column: 11, scope: !1307, inlinedAt: !1267)
!1312 = !DILocation(line: 3595, column: 11, scope: !1307, inlinedAt: !1267)
!1313 = !DILocation(line: 3597, column: 10, scope: !1307, inlinedAt: !1267)
!1314 = !DILocation(line: 3598, column: 2, scope: !1307, inlinedAt: !1267)
!1315 = !DILocation(line: 3556, column: 29, scope: !1274, inlinedAt: !1267)
!1316 = !DILocation(line: 3556, column: 23, scope: !1274, inlinedAt: !1267)
!1317 = distinct !{!1317, !1318, !1319}
!1318 = !DILocation(line: 3556, column: 5, scope: !1272)
!1319 = !DILocation(line: 3599, column: 5, scope: !1272)
!1320 = !DILocation(line: 3600, column: 8, scope: !1259, inlinedAt: !1267)
!1321 = !DILocation(line: 3535, column: 5, scope: !1093)
!1322 = !DILocation(line: 3536, column: 1, scope: !1093)
!1323 = distinct !DISubprogram(name: "ResetRedobuff", scope: !3, file: !3, line: 459, type: !608, isLocal: false, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !895)
!1324 = !DILocation(line: 461, column: 9, scope: !1323)
!1325 = !DILocation(line: 103, column: 25, scope: !843, inlinedAt: !1326)
!1326 = distinct !DILocation(line: 463, column: 2, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1328, file: !3, line: 462, column: 5)
!1328 = distinct !DILexicalBlock(scope: !1323, file: !3, line: 461, column: 9)
!1329 = !DILocation(line: 107, column: 28, scope: !852, inlinedAt: !1326)
!1330 = !DILocation(line: 105, column: 18, scope: !843, inlinedAt: !1326)
!1331 = !DILocation(line: 107, column: 38, scope: !858, inlinedAt: !1326)
!1332 = !DILocation(line: 107, column: 5, scope: !852, inlinedAt: !1326)
!1333 = !DILocation(line: 109, column: 10, scope: !861, inlinedAt: !1326)
!1334 = !DILocation(line: 105, column: 22, scope: !843, inlinedAt: !1326)
!1335 = !DILocation(line: 110, column: 2, scope: !861, inlinedAt: !1326)
!1336 = !DILocation(line: 464, column: 17, scope: !1327)
!1337 = !{i64 0, i64 8, !963, i64 8, i64 1, !827, i64 16, i64 8, !963, i64 24, i64 4, !873, i64 28, i64 4, !873}
!1338 = !DILocation(line: 465, column: 27, scope: !1327)
!1339 = !DILocation(line: 466, column: 5, scope: !1327)
!1340 = !DILocation(line: 467, column: 1, scope: !1323)
!1341 = distinct !DISubprogram(name: "CancelRedo", scope: !3, file: !3, line: 474, type: !608, isLocal: false, isDefinition: true, scopeLine: 475, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !895)
!1342 = !DILocation(line: 476, column: 9, scope: !1341)
!1343 = !DILocation(line: 103, column: 25, scope: !843, inlinedAt: !1344)
!1344 = distinct !DILocation(line: 478, column: 2, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1346, file: !3, line: 477, column: 5)
!1346 = distinct !DILexicalBlock(scope: !1341, file: !3, line: 476, column: 9)
!1347 = !DILocation(line: 107, column: 28, scope: !852, inlinedAt: !1344)
!1348 = !DILocation(line: 105, column: 18, scope: !843, inlinedAt: !1344)
!1349 = !DILocation(line: 107, column: 38, scope: !858, inlinedAt: !1344)
!1350 = !DILocation(line: 107, column: 5, scope: !852, inlinedAt: !1344)
!1351 = !DILocation(line: 109, column: 10, scope: !861, inlinedAt: !1344)
!1352 = !DILocation(line: 105, column: 22, scope: !843, inlinedAt: !1344)
!1353 = !DILocation(line: 110, column: 2, scope: !861, inlinedAt: !1344)
!1354 = !DILocation(line: 479, column: 13, scope: !1345)
!1355 = !DILocation(line: 480, column: 31, scope: !1345)
!1356 = !DILocation(line: 362, column: 27, scope: !974, inlinedAt: !1357)
!1357 = distinct !DILocation(line: 481, column: 2, scope: !1345)
!1358 = !DILocation(line: 362, column: 34, scope: !974, inlinedAt: !1357)
!1359 = !DILocation(line: 362, column: 9, scope: !975, inlinedAt: !1357)
!1360 = !DILocation(line: 364, column: 19, scope: !980, inlinedAt: !1357)
!1361 = !DILocation(line: 365, column: 20, scope: !980, inlinedAt: !1357)
!1362 = !DILocation(line: 366, column: 5, scope: !980, inlinedAt: !1357)
!1363 = !DILocation(line: 367, column: 27, scope: !986, inlinedAt: !1357)
!1364 = !DILocation(line: 367, column: 34, scope: !986, inlinedAt: !1357)
!1365 = !DILocation(line: 367, column: 9, scope: !975, inlinedAt: !1357)
!1366 = !DILocation(line: 369, column: 19, scope: !990, inlinedAt: !1357)
!1367 = !DILocation(line: 370, column: 20, scope: !990, inlinedAt: !1357)
!1368 = !DILocation(line: 371, column: 5, scope: !990, inlinedAt: !1357)
!1369 = !DILocation(line: 338, column: 30, scope: !994, inlinedAt: !1370)
!1370 = distinct !DILocation(line: 326, column: 9, scope: !1004, inlinedAt: !1371)
!1371 = distinct !DILocation(line: 482, column: 9, scope: !1345)
!1372 = !DILocation(line: 338, column: 23, scope: !994, inlinedAt: !1370)
!1373 = !DILocation(line: 322, column: 22, scope: !1004, inlinedAt: !1371)
!1374 = !DILocation(line: 333, column: 28, scope: !995, inlinedAt: !1370)
!1375 = !DILocation(line: 333, column: 37, scope: !995, inlinedAt: !1370)
!1376 = !DILocation(line: 338, column: 9, scope: !995, inlinedAt: !1370)
!1377 = !DILocation(line: 336, column: 18, scope: !995, inlinedAt: !1370)
!1378 = !DILocation(line: 342, column: 26, scope: !995, inlinedAt: !1370)
!1379 = !DILocation(line: 342, column: 9, scope: !995, inlinedAt: !1370)
!1380 = !DILocation(line: 335, column: 12, scope: !995, inlinedAt: !1370)
!1381 = !DILocation(line: 346, column: 18, scope: !1020, inlinedAt: !1370)
!1382 = !DILocation(line: 346, column: 6, scope: !1020, inlinedAt: !1370)
!1383 = !DILocation(line: 346, column: 35, scope: !1020, inlinedAt: !1370)
!1384 = !DILocation(line: 346, column: 6, scope: !1021, inlinedAt: !1370)
!1385 = !DILocation(line: 348, column: 35, scope: !1027, inlinedAt: !1370)
!1386 = !DILocation(line: 348, column: 27, scope: !1027, inlinedAt: !1370)
!1387 = !DILocation(line: 349, column: 15, scope: !1027, inlinedAt: !1370)
!1388 = !DILocation(line: 349, column: 6, scope: !1027, inlinedAt: !1370)
!1389 = !DILocation(line: 350, column: 20, scope: !1027, inlinedAt: !1370)
!1390 = !DILocation(line: 351, column: 2, scope: !1027, inlinedAt: !1370)
!1391 = !DILocation(line: 327, column: 11, scope: !1034, inlinedAt: !1371)
!1392 = !DILocation(line: 327, column: 9, scope: !1004, inlinedAt: !1371)
!1393 = !DILocation(line: 333, column: 28, scope: !995, inlinedAt: !1394)
!1394 = distinct !DILocation(line: 328, column: 6, scope: !1034, inlinedAt: !1371)
!1395 = !DILocation(line: 333, column: 37, scope: !995, inlinedAt: !1394)
!1396 = !DILocation(line: 338, column: 23, scope: !994, inlinedAt: !1394)
!1397 = !DILocation(line: 338, column: 30, scope: !994, inlinedAt: !1394)
!1398 = !DILocation(line: 338, column: 9, scope: !995, inlinedAt: !1394)
!1399 = !DILocation(line: 336, column: 18, scope: !995, inlinedAt: !1394)
!1400 = !DILocation(line: 342, column: 26, scope: !995, inlinedAt: !1394)
!1401 = !DILocation(line: 342, column: 9, scope: !995, inlinedAt: !1394)
!1402 = !DILocation(line: 335, column: 12, scope: !995, inlinedAt: !1394)
!1403 = !DILocation(line: 346, column: 18, scope: !1020, inlinedAt: !1394)
!1404 = !DILocation(line: 346, column: 6, scope: !1020, inlinedAt: !1394)
!1405 = !DILocation(line: 346, column: 35, scope: !1020, inlinedAt: !1394)
!1406 = !DILocation(line: 346, column: 6, scope: !1021, inlinedAt: !1394)
!1407 = !DILocation(line: 348, column: 35, scope: !1027, inlinedAt: !1394)
!1408 = !DILocation(line: 348, column: 27, scope: !1027, inlinedAt: !1394)
!1409 = !DILocation(line: 349, column: 15, scope: !1027, inlinedAt: !1394)
!1410 = !DILocation(line: 349, column: 6, scope: !1027, inlinedAt: !1394)
!1411 = !DILocation(line: 350, column: 20, scope: !1027, inlinedAt: !1394)
!1412 = !DILocation(line: 351, column: 2, scope: !1027, inlinedAt: !1394)
!1413 = !DILocation(line: 482, column: 32, scope: !1345)
!1414 = !DILocation(line: 482, column: 2, scope: !1345)
!1415 = distinct !{!1415, !1414, !1416}
!1416 = !DILocation(line: 483, column: 6, scope: !1345)
!1417 = !DILocation(line: 485, column: 1, scope: !1341)
!1418 = distinct !DISubprogram(name: "saveRedobuff", scope: !3, file: !3, line: 492, type: !1419, isLocal: false, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1427)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{null, !1421}
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "save_redo_T", file: !147, line: 565, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !147, line: 561, size: 512, elements: !1424)
!1424 = !{!1425, !1426}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "sr_redobuff", scope: !1423, file: !147, line: 563, baseType: !650, size: 256)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "sr_old_redobuff", scope: !1423, file: !147, line: 564, baseType: !650, size: 256, offset: 256)
!1427 = !{!1428, !1429}
!1428 = !DILocalVariable(name: "save_redo", arg: 1, scope: !1418, file: !3, line: 492, type: !1421)
!1429 = !DILocalVariable(name: "s", scope: !1418, file: !3, line: 494, type: !336)
!1430 = !DILocation(line: 492, column: 27, scope: !1418)
!1431 = !DILocation(line: 496, column: 30, scope: !1418)
!1432 = !DILocation(line: 497, column: 30, scope: !1418)
!1433 = !DILocation(line: 498, column: 16, scope: !1418)
!1434 = !DILocation(line: 498, column: 34, scope: !1418)
!1435 = !DILocation(line: 499, column: 34, scope: !1418)
!1436 = !DILocation(line: 121, column: 19, scope: !779, inlinedAt: !1437)
!1437 = distinct !DILocation(line: 502, column: 9, scope: !1418)
!1438 = !DILocation(line: 122, column: 11, scope: !779, inlinedAt: !1437)
!1439 = !DILocation(line: 124, column: 16, scope: !779, inlinedAt: !1437)
!1440 = !DILocation(line: 125, column: 17, scope: !779, inlinedAt: !1437)
!1441 = !DILocation(line: 131, column: 32, scope: !803, inlinedAt: !1437)
!1442 = !DILocation(line: 128, column: 18, scope: !779, inlinedAt: !1437)
!1443 = !DILocation(line: 131, column: 43, scope: !802, inlinedAt: !1437)
!1444 = !DILocation(line: 131, column: 5, scope: !803, inlinedAt: !1437)
!1445 = !DILocation(line: 132, column: 19, scope: !802, inlinedAt: !1437)
!1446 = !DILocation(line: 132, column: 8, scope: !802, inlinedAt: !1437)
!1447 = !DILocation(line: 131, column: 61, scope: !802, inlinedAt: !1437)
!1448 = !DILocation(line: 134, column: 10, scope: !812, inlinedAt: !1437)
!1449 = !DILocation(line: 134, column: 16, scope: !812, inlinedAt: !1437)
!1450 = !DILocation(line: 134, column: 47, scope: !812, inlinedAt: !1437)
!1451 = !DILocation(line: 134, column: 35, scope: !812, inlinedAt: !1437)
!1452 = !DILocation(line: 134, column: 53, scope: !812, inlinedAt: !1437)
!1453 = !DILocation(line: 134, column: 9, scope: !779, inlinedAt: !1437)
!1454 = !DILocation(line: 126, column: 17, scope: !779, inlinedAt: !1437)
!1455 = !DILocation(line: 137, column: 40, scope: !818, inlinedAt: !1437)
!1456 = !DILocation(line: 137, column: 2, scope: !819, inlinedAt: !1437)
!1457 = !DILocation(line: 138, column: 17, scope: !823, inlinedAt: !1437)
!1458 = !DILocation(line: 127, column: 17, scope: !779, inlinedAt: !1437)
!1459 = !DILocation(line: 138, column: 28, scope: !826, inlinedAt: !1437)
!1460 = !DILocation(line: 138, column: 6, scope: !823, inlinedAt: !1437)
!1461 = !DILocation(line: 139, column: 15, scope: !826, inlinedAt: !1437)
!1462 = !DILocation(line: 139, column: 6, scope: !826, inlinedAt: !1437)
!1463 = !DILocation(line: 139, column: 9, scope: !826, inlinedAt: !1437)
!1464 = !DILocation(line: 137, column: 58, scope: !818, inlinedAt: !1437)
!1465 = !DILocation(line: 140, column: 6, scope: !820, inlinedAt: !1437)
!1466 = !DILocation(line: 505, column: 2, scope: !1467)
!1467 = distinct !DILexicalBlock(scope: !1468, file: !3, line: 504, column: 5)
!1468 = distinct !DILexicalBlock(scope: !1418, file: !3, line: 503, column: 9)
!1469 = !DILocation(line: 506, column: 2, scope: !1467)
!1470 = !DILocation(line: 507, column: 5, scope: !1467)
!1471 = !DILocation(line: 508, column: 1, scope: !1418)
!1472 = distinct !DISubprogram(name: "add_buff", scope: !3, file: !3, line: 195, type: !1473, isLocal: true, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1475)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{null, !782, !336, !335}
!1475 = !{!1476, !1477, !1478, !1479, !1480}
!1476 = !DILocalVariable(name: "buf", arg: 1, scope: !1472, file: !3, line: 196, type: !782)
!1477 = !DILocalVariable(name: "s", arg: 2, scope: !1472, file: !3, line: 197, type: !336)
!1478 = !DILocalVariable(name: "slen", arg: 3, scope: !1472, file: !3, line: 198, type: !335)
!1479 = !DILocalVariable(name: "p", scope: !1472, file: !3, line: 200, type: !658)
!1480 = !DILocalVariable(name: "len", scope: !1472, file: !3, line: 201, type: !602)
!1481 = !DILocation(line: 196, column: 19, scope: !1472)
!1482 = !DILocation(line: 197, column: 14, scope: !1472)
!1483 = !DILocation(line: 198, column: 11, scope: !1472)
!1484 = !DILocation(line: 203, column: 14, scope: !1485)
!1485 = distinct !DILexicalBlock(scope: !1472, file: !3, line: 203, column: 9)
!1486 = !DILocation(line: 203, column: 9, scope: !1472)
!1487 = !DILocation(line: 204, column: 15, scope: !1485)
!1488 = !DILocation(line: 204, column: 2, scope: !1485)
!1489 = !DILocation(line: 205, column: 14, scope: !1490)
!1490 = distinct !DILexicalBlock(scope: !1472, file: !3, line: 205, column: 9)
!1491 = !DILocation(line: 205, column: 9, scope: !1472)
!1492 = !DILocation(line: 208, column: 23, scope: !1493)
