; ModuleID = 'gui_beval.c'
source_filename = "gui_beval.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Gui = type { i32, i32, i32, i32, i32, i32, i32, %struct.window_S*, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, %struct.GuiScrollbar, [3 x i32], i32, i32, i32, i32, i32, i32, %struct._PangoFontDescription*, i32, %struct._PangoFontDescription*, i64, i64, i64, i64, i32, %struct._GdkCursor*, i8*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GdkColor*, %struct._GdkColor*, %struct._GdkColor*, %struct._GdkGC*, %struct._PangoContext*, %struct._PangoFont*, %struct._PangoGlyphString*, %struct._GtkWidget*, %struct._GtkAccelGroup*, %struct._GtkWidget*, i8*, i32, i8*, i8* }

!277 = !DIEnumerator(name: "HLF_TP", value: 39)
!278 = !DIEnumerator(name: "HLF_TPS", value: 40)
!279 = !DIEnumerator(name: "HLF_TPF", value: 41)
!280 = !DIEnumerator(name: "HLF_CUC", value: 42)
!281 = !DIEnumerator(name: "HLF_CUL", value: 43)
!282 = !DIEnumerator(name: "HLF_MC", value: 44)
!283 = !DIEnumerator(name: "HLF_QFL", value: 45)
!284 = !DIEnumerator(name: "HLF_ST", value: 46)
!285 = !DIEnumerator(name: "HLF_STNC", value: 47)
!286 = !DIEnumerator(name: "HLF_COUNT", value: 48)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !288, line: 460, size: 32, elements: !289)
!288 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkenums.h", directory: "/home/sahil/vim/src")
!289 = !{!290, !291}
!290 = !DIEnumerator(name: "GTK_WINDOW_TOPLEVEL", value: 0)
!291 = !DIEnumerator(name: "GTK_WINDOW_POPUP", value: 1)
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !288, line: 181, size: 32, elements: !293)
!293 = !{!294, !295, !296, !297}
!294 = !DIEnumerator(name: "GTK_JUSTIFY_LEFT", value: 0)
!295 = !DIEnumerator(name: "GTK_JUSTIFY_RIGHT", value: 1)
!296 = !DIEnumerator(name: "GTK_JUSTIFY_CENTER", value: 2)
!297 = !DIEnumerator(name: "GTK_JUSTIFY_FILL", value: 3)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !288, line: 399, size: 32, elements: !299)
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIEnumerator(name: "GTK_STATE_NORMAL", value: 0)
!301 = !DIEnumerator(name: "GTK_STATE_ACTIVE", value: 1)
!302 = !DIEnumerator(name: "GTK_STATE_PRELIGHT", value: 2)
!303 = !DIEnumerator(name: "GTK_STATE_SELECTED", value: 3)
!304 = !DIEnumerator(name: "GTK_STATE_INSENSITIVE", value: 4)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !288, line: 389, size: 32, elements: !306)
!306 = !{!307, !308, !309, !310, !311}
!307 = !DIEnumerator(name: "GTK_SHADOW_NONE", value: 0)
!308 = !DIEnumerator(name: "GTK_SHADOW_IN", value: 1)
!309 = !DIEnumerator(name: "GTK_SHADOW_OUT", value: 2)
!310 = !DIEnumerator(name: "GTK_SHADOW_ETCHED_IN", value: 3)
!311 = !DIEnumerator(name: "GTK_SHADOW_ETCHED_OUT", value: 4)
!312 = !{!313, !314, !316, !321, !566, !567, !349, !568, !573, !410, !357, !355, !574, !575, !666, !712, !352, !715, !717, !718, !719}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "BalloonEval", file: !30, line: 86, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BalloonEvalStruct", file: !30, line: 33, size: 704, elements: !319)
!319 = !{!320, !546, !547, !548, !549, !551, !552, !553, !554, !559, !560, !561, !563}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !318, file: !30, line: 37, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWidget", file: !323, line: 69, baseType: !324)
!323 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkstyle.h", directory: "/home/sahil/vim/src")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWidget", file: !325, line: 530, size: 768, elements: !326)
!325 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkwidget.h", directory: "/home/sahil/vim/src")
!326 = !{!327, !365, !368, !371, !372, !375, !527, !533, !542, !545}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !324, file: !325, line: 538, baseType: !328, size: 256)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkObject", file: !329, line: 49, baseType: !330)
!329 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtktypeutils.h", directory: "/home/sahil/vim/src")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkObject", file: !331, line: 107, size: 256, elements: !332)
!331 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkobject.h", directory: "/home/sahil/vim/src")
!332 = !{!333, !363}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !330, file: !331, line: 109, baseType: !334, size: 192)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInitiallyUnowned", file: !335, line: 189, baseType: !336)
!335 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gobject.h", directory: "/home/sahil/vim/src")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GObject", file: !335, line: 245, size: 192, elements: !337)
!337 = !{!338, !353, !358}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "g_type_instance", scope: !336, file: !335, line: 247, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeInstance", file: !340, line: 393, baseType: !341)
!340 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gtype.h", directory: "/home/sahil/vim/src")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeInstance", file: !340, line: 418, size: 64, elements: !342)
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "g_class", scope: !341, file: !340, line: 421, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeClass", file: !340, line: 391, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeClass", file: !340, line: 408, size: 64, elements: !347)
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !346, file: !340, line: 411, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "GType", file: !340, line: 384, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !351, line: 78, baseType: !352)
!351 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/sahil/vim/src")
!352 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !336, file: !335, line: 250, baseType: !354, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !356, line: 55, baseType: !357)
!356 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/sahil/vim/src")
!357 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !336, file: !335, line: 251, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !361, line: 36, baseType: !362)
!361 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/sahil/vim/src")
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !361, line: 36, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !330, file: !331, line: 116, baseType: !364, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !351, line: 52, baseType: !357)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "private_flags", scope: !324, file: !325, line: 545, baseType: !366, size: 16, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint16", file: !351, line: 44, baseType: !367)
!367 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !324, file: !325, line: 550, baseType: !369, size: 8, offset: 272)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint8", file: !351, line: 41, baseType: !370)
!370 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "saved_state", scope: !324, file: !325, line: 558, baseType: !369, size: 8, offset: 280)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !324, file: !325, line: 566, baseType: !373, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !356, line: 46, baseType: !315)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !324, file: !325, line: 575, baseType: !376, size: 64, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkStyle", file: !323, line: 54, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkStyle", file: !323, line: 73, size: 7872, elements: !379)
!379 = !{!380, !382, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !408, !411, !412, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !474, !475, !476, !477, !486, !487, !524, !525, !526}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !378, file: !323, line: 75, baseType: !381, size: 192)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "GObject", file: !335, line: 187, baseType: !336)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "fg", scope: !378, file: !323, line: 79, baseType: !383, size: 480, offset: 192)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 480, elements: !392)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkColor", file: !13, line: 102, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkColor", file: !386, line: 46, size: 96, elements: !387)
!386 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkcolor.h", directory: "/home/sahil/vim/src")
!387 = !{!388, !389, !390, !391}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !385, file: !386, line: 48, baseType: !364, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !385, file: !386, line: 49, baseType: !366, size: 16, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !385, file: !386, line: 50, baseType: !366, size: 16, offset: 48)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !385, file: !386, line: 51, baseType: !366, size: 16, offset: 64)
!392 = !{!393}
!393 = !DISubrange(count: 5)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !378, file: !323, line: 80, baseType: !383, size: 480, offset: 672)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "light", scope: !378, file: !323, line: 81, baseType: !383, size: 480, offset: 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dark", scope: !378, file: !323, line: 82, baseType: !383, size: 480, offset: 1632)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !378, file: !323, line: 83, baseType: !383, size: 480, offset: 2112)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !378, file: !323, line: 84, baseType: !383, size: 480, offset: 2592)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !378, file: !323, line: 85, baseType: !383, size: 480, offset: 3072)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "text_aa", scope: !378, file: !323, line: 86, baseType: !383, size: 480, offset: 3552)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !378, file: !323, line: 88, baseType: !384, size: 96, offset: 4032)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !378, file: !323, line: 89, baseType: !384, size: 96, offset: 4128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "font_desc", scope: !378, file: !323, line: 90, baseType: !404, size: 64, offset: 4224)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoFontDescription", file: !406, line: 41, baseType: !407)
!406 = !DIFile(filename: "/usr/include/pango-1.0/pango/pango-font.h", directory: "/home/sahil/vim/src")
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoFontDescription", file: !406, line: 41, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "xthickness", scope: !378, file: !323, line: 92, baseType: !409, size: 32, offset: 4288)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !356, line: 49, baseType: !410)
!410 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ythickness", scope: !378, file: !323, line: 93, baseType: !409, size: 32, offset: 4320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fg_gc", scope: !378, file: !323, line: 95, baseType: !413, size: 320, offset: 4352)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 320, elements: !392)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkGC", file: !13, line: 106, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkGC", file: !417, line: 189, size: 384, elements: !418)
!417 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkgc.h", directory: "/home/sahil/vim/src")
!418 = !{!419, !420, !421, !422, !423, !424}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !416, file: !417, line: 191, baseType: !381, size: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "clip_x_origin", scope: !416, file: !417, line: 193, baseType: !409, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "clip_y_origin", scope: !416, file: !417, line: 194, baseType: !409, size: 32, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ts_x_origin", scope: !416, file: !417, line: 195, baseType: !409, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ts_y_origin", scope: !416, file: !417, line: 196, baseType: !409, size: 32, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !416, file: !417, line: 198, baseType: !425, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkColormap", file: !13, line: 103, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkColormap", file: !386, line: 68, size: 448, elements: !428)
!428 = !{!429, !430, !431, !433, !455}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !427, file: !386, line: 71, baseType: !381, size: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !427, file: !386, line: 74, baseType: !409, size: 32, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !427, file: !386, line: 75, baseType: !432, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !427, file: !386, line: 78, baseType: !434, size: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisual", file: !13, line: 109, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkVisual", file: !4, line: 77, size: 640, elements: !437)
!437 = !{!438, !439, !441, !442, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !436, file: !4, line: 79, baseType: !381, size: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !4, line: 81, baseType: !440, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisualType", file: !4, line: 63, baseType: !3)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !436, file: !4, line: 82, baseType: !409, size: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !436, file: !4, line: 83, baseType: !443, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkByteOrder", file: !13, line: 122, baseType: !12)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "colormap_size", scope: !436, file: !4, line: 84, baseType: !409, size: 32, offset: 288)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !436, file: !4, line: 85, baseType: !409, size: 32, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !436, file: !4, line: 87, baseType: !364, size: 32, offset: 352)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "red_shift", scope: !436, file: !4, line: 88, baseType: !409, size: 32, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "red_prec", scope: !436, file: !4, line: 89, baseType: !409, size: 32, offset: 416)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !436, file: !4, line: 91, baseType: !364, size: 32, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "green_shift", scope: !436, file: !4, line: 92, baseType: !409, size: 32, offset: 480)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "green_prec", scope: !436, file: !4, line: 93, baseType: !409, size: 32, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !436, file: !4, line: 95, baseType: !364, size: 32, offset: 544)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "blue_shift", scope: !436, file: !4, line: 96, baseType: !409, size: 32, offset: 576)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "blue_prec", scope: !436, file: !4, line: 97, baseType: !409, size: 32, offset: 608)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "windowing_data", scope: !427, file: !386, line: 80, baseType: !456, size: 64, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !356, line: 103, baseType: !313)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "bg_gc", scope: !378, file: !323, line: 96, baseType: !413, size: 320, offset: 4672)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "light_gc", scope: !378, file: !323, line: 97, baseType: !413, size: 320, offset: 4992)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dark_gc", scope: !378, file: !323, line: 98, baseType: !413, size: 320, offset: 5312)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mid_gc", scope: !378, file: !323, line: 99, baseType: !413, size: 320, offset: 5632)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "text_gc", scope: !378, file: !323, line: 100, baseType: !413, size: 320, offset: 5952)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "base_gc", scope: !378, file: !323, line: 101, baseType: !413, size: 320, offset: 6272)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "text_aa_gc", scope: !378, file: !323, line: 102, baseType: !413, size: 320, offset: 6592)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "black_gc", scope: !378, file: !323, line: 103, baseType: !414, size: 64, offset: 6912)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "white_gc", scope: !378, file: !323, line: 104, baseType: !414, size: 64, offset: 6976)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bg_pixmap", scope: !378, file: !323, line: 106, baseType: !467, size: 320, offset: 7040)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 320, elements: !392)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkPixmap", file: !13, line: 113, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDrawable", file: !471, line: 53, size: 192, elements: !472)
!471 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkdrawable.h", directory: "/home/sahil/vim/src")
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !470, file: !471, line: 55, baseType: !381, size: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "attach_count", scope: !378, file: !323, line: 110, baseType: !409, size: 32, offset: 7360)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !378, file: !323, line: 112, baseType: !409, size: 32, offset: 7392)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !378, file: !323, line: 113, baseType: !425, size: 64, offset: 7424)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "private_font", scope: !378, file: !323, line: 114, baseType: !478, size: 64, offset: 7488)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkFont", file: !13, line: 105, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkFont", file: !18, line: 49, size: 96, elements: !481)
!481 = !{!482, !484, !485}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !480, file: !18, line: 51, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkFontType", file: !18, line: 47, baseType: !17)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !480, file: !18, line: 52, baseType: !409, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !480, file: !18, line: 53, baseType: !409, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "private_font_desc", scope: !378, file: !323, line: 115, baseType: !404, size: 64, offset: 7552)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rc_style", scope: !378, file: !323, line: 118, baseType: !488, size: 64, offset: 7616)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRcStyle", file: !323, line: 57, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkRcStyle", file: !23, line: 60, size: 3072, elements: !491)
!491 = !{!492, !493, !494, !496, !497, !500, !501, !502, !503, !504, !505, !506, !514, !522, !523}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !490, file: !23, line: 62, baseType: !381, size: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !23, line: 66, baseType: !373, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "bg_pixmap_name", scope: !490, file: !23, line: 67, baseType: !495, size: 320, offset: 256)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 320, elements: !392)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "font_desc", scope: !490, file: !23, line: 68, baseType: !404, size: 64, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "color_flags", scope: !490, file: !23, line: 70, baseType: !498, size: 160, offset: 640)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 160, elements: !392)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRcFlags", file: !23, line: 58, baseType: !22)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "fg", scope: !490, file: !23, line: 71, baseType: !383, size: 480, offset: 800)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !490, file: !23, line: 72, baseType: !383, size: 480, offset: 1280)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !490, file: !23, line: 73, baseType: !383, size: 480, offset: 1760)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !490, file: !23, line: 74, baseType: !383, size: 480, offset: 2240)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "xthickness", scope: !490, file: !23, line: 76, baseType: !409, size: 32, offset: 2720)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ythickness", scope: !490, file: !23, line: 77, baseType: !409, size: 32, offset: 2752)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rc_properties", scope: !490, file: !23, line: 80, baseType: !507, size: 64, offset: 2816)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !509, line: 37, baseType: !510)
!509 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/sahil/vim/src")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !509, line: 41, size: 128, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !510, file: !509, line: 43, baseType: !373, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !510, file: !509, line: 44, baseType: !355, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "rc_style_lists", scope: !490, file: !23, line: 83, baseType: !515, size: 64, offset: 2880)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !517, line: 37, baseType: !518)
!517 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/sahil/vim/src")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !517, line: 39, size: 128, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !518, file: !517, line: 41, baseType: !456, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !518, file: !517, line: 42, baseType: !515, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "icon_factories", scope: !490, file: !23, line: 85, baseType: !515, size: 64, offset: 2944)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "engine_specified", scope: !490, file: !23, line: 87, baseType: !355, size: 1, offset: 3008, flags: DIFlagBitField, extraData: i64 3008)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "styles", scope: !378, file: !323, line: 120, baseType: !515, size: 64, offset: 7680)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "property_cache", scope: !378, file: !323, line: 121, baseType: !507, size: 64, offset: 7744)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "icon_factories", scope: !378, file: !323, line: 122, baseType: !515, size: 64, offset: 7808)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "requisition", scope: !324, file: !325, line: 579, baseType: !528, size: 64, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRequisition", file: !325, line: 478, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkRequisition", file: !325, line: 519, size: 64, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !529, file: !325, line: 521, baseType: !409, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !529, file: !325, line: 522, baseType: !409, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "allocation", scope: !324, file: !325, line: 583, baseType: !534, size: 128, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkAllocation", file: !325, line: 498, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkRectangle", file: !13, line: 69, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkRectangle", file: !13, line: 200, size: 128, elements: !537)
!537 = !{!538, !539, !540, !541}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !536, file: !13, line: 202, baseType: !409, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !536, file: !13, line: 203, baseType: !409, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !536, file: !13, line: 204, baseType: !409, size: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !536, file: !13, line: 205, baseType: !409, size: 32, offset: 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !324, file: !325, line: 589, baseType: !543, size: 64, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkWindow", file: !13, line: 114, baseType: !470)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !324, file: !325, line: 593, baseType: !321, size: 64, offset: 704)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "balloonShell", scope: !318, file: !30, line: 38, baseType: !321, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "balloonLabel", scope: !318, file: !30, line: 39, baseType: !321, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "timerID", scope: !318, file: !30, line: 40, baseType: !357, size: 32, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "showState", scope: !318, file: !30, line: 41, baseType: !550, size: 32, offset: 224)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "BeState", file: !30, line: 31, baseType: !29)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !318, file: !30, line: 42, baseType: !410, size: 32, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !318, file: !30, line: 43, baseType: !410, size: 32, offset: 288)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !318, file: !30, line: 44, baseType: !357, size: 32, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "msgCB", scope: !318, file: !30, line: 70, baseType: !555, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !558, !410}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !318, file: !30, line: 71, baseType: !313, size: 64, offset: 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !318, file: !30, line: 74, baseType: !410, size: 32, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "vts", scope: !318, file: !30, line: 76, baseType: !562, size: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !318, file: !30, line: 78, baseType: !564, size: 64, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !236, line: 324, baseType: !370)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCallback", file: !569, line: 86, baseType: !570)
!569 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gclosure.h", directory: "/home/sahil/vim/src")
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null}
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "GConnectFlags", file: !37, line: 159, baseType: !36)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSignalMatchType", file: !37, line: 181, baseType: !189)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWindow", file: !325, line: 485, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWindow", file: !578, line: 54, size: 1920, elements: !579)
!578 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkwindow.h", directory: "/home/sahil/vim/src")
!579 = !{!580, !598, !599, !600, !601, !602, !603, !604, !605, !609, !610, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !645}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "bin", scope: !577, file: !578, line: 56, baseType: !581, size: 960)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkBin", file: !582, line: 48, baseType: !583)
!582 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkbin.h", directory: "/home/sahil/vim/src")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkBin", file: !582, line: 51, size: 960, elements: !584)
!584 = !{!585, !597}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !583, file: !582, line: 53, baseType: !586, size: 896)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkContainer", file: !587, line: 51, baseType: !588)
!587 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkcontainer.h", directory: "/home/sahil/vim/src")
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkContainer", file: !587, line: 54, size: 896, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "widget", scope: !588, file: !587, line: 56, baseType: !322, size: 768)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "focus_child", scope: !588, file: !587, line: 58, baseType: !321, size: 64, offset: 768)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !588, file: !587, line: 60, baseType: !355, size: 16, offset: 832, flags: DIFlagBitField, extraData: i64 832)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "need_resize", scope: !588, file: !587, line: 63, baseType: !355, size: 1, offset: 848, flags: DIFlagBitField, extraData: i64 832)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "resize_mode", scope: !588, file: !587, line: 64, baseType: !355, size: 2, offset: 849, flags: DIFlagBitField, extraData: i64 832)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "reallocate_redraws", scope: !588, file: !587, line: 65, baseType: !355, size: 1, offset: 851, flags: DIFlagBitField, extraData: i64 832)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "has_focus_chain", scope: !588, file: !587, line: 66, baseType: !355, size: 1, offset: 852, flags: DIFlagBitField, extraData: i64 832)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !583, file: !582, line: 55, baseType: !321, size: 64, offset: 896)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !577, file: !578, line: 58, baseType: !373, size: 64, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "wmclass_name", scope: !577, file: !578, line: 59, baseType: !373, size: 64, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "wmclass_class", scope: !577, file: !578, line: 60, baseType: !373, size: 64, offset: 1088)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "wm_role", scope: !577, file: !578, line: 61, baseType: !373, size: 64, offset: 1152)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "focus_widget", scope: !577, file: !578, line: 63, baseType: !321, size: 64, offset: 1216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "default_widget", scope: !577, file: !578, line: 64, baseType: !321, size: 64, offset: 1280)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "transient_parent", scope: !577, file: !578, line: 65, baseType: !575, size: 64, offset: 1344)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "geometry_info", scope: !577, file: !578, line: 66, baseType: !606, size: 64, offset: 1408)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWindowGeometryInfo", file: !578, line: 50, baseType: !608)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWindowGeometryInfo", file: !578, line: 50, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !577, file: !578, line: 67, baseType: !543, size: 64, offset: 1472)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !577, file: !578, line: 68, baseType: !611, size: 64, offset: 1536)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWindowGroup", file: !578, line: 51, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWindowGroup", file: !578, line: 154, size: 256, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !613, file: !578, line: 156, baseType: !381, size: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "grabs", scope: !613, file: !578, line: 158, baseType: !515, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "configure_request_count", scope: !577, file: !578, line: 70, baseType: !366, size: 16, offset: 1600)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "allow_shrink", scope: !577, file: !578, line: 71, baseType: !355, size: 1, offset: 1616, flags: DIFlagBitField, extraData: i64 1616)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "allow_grow", scope: !577, file: !578, line: 72, baseType: !355, size: 1, offset: 1617, flags: DIFlagBitField, extraData: i64 1616)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "configure_notify_received", scope: !577, file: !578, line: 73, baseType: !355, size: 1, offset: 1618, flags: DIFlagBitField, extraData: i64 1616)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "need_default_position", scope: !577, file: !578, line: 80, baseType: !355, size: 1, offset: 1619, flags: DIFlagBitField, extraData: i64 1616)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "need_default_size", scope: !577, file: !578, line: 81, baseType: !355, size: 1, offset: 1620, flags: DIFlagBitField, extraData: i64 1616)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !577, file: !578, line: 82, baseType: !355, size: 3, offset: 1621, flags: DIFlagBitField, extraData: i64 1616)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !577, file: !578, line: 83, baseType: !355, size: 4, offset: 1624, flags: DIFlagBitField, extraData: i64 1616)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "has_user_ref_count", scope: !577, file: !578, line: 84, baseType: !355, size: 1, offset: 1628, flags: DIFlagBitField, extraData: i64 1616)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "has_focus", scope: !577, file: !578, line: 85, baseType: !355, size: 1, offset: 1629, flags: DIFlagBitField, extraData: i64 1616)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !577, file: !578, line: 87, baseType: !355, size: 1, offset: 1630, flags: DIFlagBitField, extraData: i64 1616)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_with_parent", scope: !577, file: !578, line: 88, baseType: !355, size: 1, offset: 1631, flags: DIFlagBitField, extraData: i64 1616)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "has_frame", scope: !577, file: !578, line: 90, baseType: !355, size: 1, offset: 1632, flags: DIFlagBitField, extraData: i64 1616)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "iconify_initially", scope: !577, file: !578, line: 93, baseType: !355, size: 1, offset: 1633, flags: DIFlagBitField, extraData: i64 1616)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "stick_initially", scope: !577, file: !578, line: 94, baseType: !355, size: 1, offset: 1634, flags: DIFlagBitField, extraData: i64 1616)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "maximize_initially", scope: !577, file: !578, line: 95, baseType: !355, size: 1, offset: 1635, flags: DIFlagBitField, extraData: i64 1616)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "decorated", scope: !577, file: !578, line: 96, baseType: !355, size: 1, offset: 1636, flags: DIFlagBitField, extraData: i64 1616)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type_hint", scope: !577, file: !578, line: 98, baseType: !355, size: 3, offset: 1637, flags: DIFlagBitField, extraData: i64 1616)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !577, file: !578, line: 101, baseType: !355, size: 5, offset: 1640, flags: DIFlagBitField, extraData: i64 1616)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "is_active", scope: !577, file: !578, line: 103, baseType: !355, size: 1, offset: 1645, flags: DIFlagBitField, extraData: i64 1616)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "has_toplevel_focus", scope: !577, file: !578, line: 104, baseType: !355, size: 1, offset: 1646, flags: DIFlagBitField, extraData: i64 1616)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_left", scope: !577, file: !578, line: 106, baseType: !355, size: 32, offset: 1664)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_top", scope: !577, file: !578, line: 107, baseType: !355, size: 32, offset: 1696)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_right", scope: !577, file: !578, line: 108, baseType: !355, size: 32, offset: 1728)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bottom", scope: !577, file: !578, line: 109, baseType: !355, size: 32, offset: 1760)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "keys_changed_handler", scope: !577, file: !578, line: 111, baseType: !355, size: 32, offset: 1792)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_modifier", scope: !577, file: !578, line: 113, baseType: !644, size: 32, offset: 1824)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkModifierType", file: !13, line: 153, baseType: !110)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !577, file: !578, line: 114, baseType: !646, size: 64, offset: 1856)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkScreen", file: !13, line: 116, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkScreen", file: !649, line: 46, size: 6528, elements: !650)
!649 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkscreen.h", directory: "/home/sahil/vim/src")
!650 = !{!651, !652, !653, !657, !658, !659, !664}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !648, file: !649, line: 48, baseType: !381, size: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !648, file: !649, line: 50, baseType: !355, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "normal_gcs", scope: !648, file: !649, line: 52, baseType: !654, size: 2048, offset: 256)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 2048, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "exposure_gcs", scope: !648, file: !649, line: 53, baseType: !654, size: 2048, offset: 2304)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow_gcs", scope: !648, file: !649, line: 54, baseType: !654, size: 2048, offset: 4352)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "font_options", scope: !648, file: !649, line: 56, baseType: !660, size: 64, offset: 6400)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "cairo_font_options_t", file: !662, line: 1385, baseType: !663)
!662 = !DIFile(filename: "/usr/include/cairo/cairo.h", directory: "/home/sahil/vim/src")
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cairo_font_options", file: !662, line: 1385, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !648, file: !649, line: 57, baseType: !665, size: 64, offset: 6464)
!665 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkLabel", file: !668, line: 49, baseType: !669)
!668 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtklabel.h", directory: "/home/sahil/vim/src")
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkLabel", file: !668, line: 54, size: 1472, elements: !670)
!670 = !{!671, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !701, !702, !706, !707, !708}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !669, file: !668, line: 56, baseType: !672, size: 896)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkMisc", file: !673, line: 48, baseType: !674)
!673 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkmisc.h", directory: "/home/sahil/vim/src")
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkMisc", file: !673, line: 51, size: 896, elements: !675)
!675 = !{!676, !677, !680, !681, !682}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "widget", scope: !674, file: !673, line: 53, baseType: !322, size: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "xalign", scope: !674, file: !673, line: 55, baseType: !678, size: 32, offset: 768)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfloat", file: !356, line: 57, baseType: !679)
!679 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "yalign", scope: !674, file: !673, line: 56, baseType: !678, size: 32, offset: 800)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "xpad", scope: !674, file: !673, line: 58, baseType: !366, size: 16, offset: 832)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ypad", scope: !674, file: !673, line: 59, baseType: !366, size: 16, offset: 848)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !669, file: !668, line: 59, baseType: !373, size: 64, offset: 896)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "jtype", scope: !669, file: !668, line: 60, baseType: !355, size: 2, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !669, file: !668, line: 61, baseType: !355, size: 1, offset: 962, flags: DIFlagBitField, extraData: i64 960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "use_underline", scope: !669, file: !668, line: 62, baseType: !355, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "use_markup", scope: !669, file: !668, line: 63, baseType: !355, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ellipsize", scope: !669, file: !668, line: 64, baseType: !355, size: 3, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "single_line_mode", scope: !669, file: !668, line: 65, baseType: !355, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "have_transform", scope: !669, file: !668, line: 66, baseType: !355, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "in_click", scope: !669, file: !668, line: 67, baseType: !355, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_mode", scope: !669, file: !668, line: 68, baseType: !355, size: 3, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_set", scope: !669, file: !668, line: 69, baseType: !355, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "track_links", scope: !669, file: !668, line: 70, baseType: !355, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_keyval", scope: !669, file: !668, line: 72, baseType: !355, size: 32, offset: 992)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !669, file: !668, line: 74, baseType: !373, size: 64, offset: 1024)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !669, file: !668, line: 75, baseType: !698, size: 64, offset: 1088)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAttrList", file: !204, line: 119, baseType: !700)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoAttrList", file: !204, line: 119, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "effective_attrs", scope: !669, file: !668, line: 76, baseType: !698, size: 64, offset: 1152)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !669, file: !668, line: 78, baseType: !703, size: 64, offset: 1216)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoLayout", file: !198, line: 32, baseType: !705)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoLayout", file: !198, line: 32, flags: DIFlagFwdDecl)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_widget", scope: !669, file: !668, line: 80, baseType: !321, size: 64, offset: 1280)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_window", scope: !669, file: !668, line: 81, baseType: !575, size: 64, offset: 1344)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "select_info", scope: !669, file: !668, line: 83, baseType: !709, size: 64, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkLabelSelectionInfo", file: !668, line: 52, baseType: !711)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkLabelSelectionInfo", file: !668, line: 52, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "guicolor_T", file: !713, line: 198, baseType: !714)
!713 = !DIFile(filename: "./gui.h", directory: "/home/sahil/vim/src")
!714 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!720 = !{i32 2, !"Dwarf Version", i32 4}
!721 = !{i32 2, !"Debug Info Version", i32 3}
!722 = !{i32 1, !"wchar_size", i32 4}
!723 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!724 = distinct !DISubprogram(name: "gui_mch_create_beval_area", scope: !1, file: !1, line: 91, type: !725, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !730)
!725 = !DISubroutineType(types: !726)
!726 = !{!316, !313, !564, !727, !313}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !316, !410}
!730 = !{!731, !732, !733, !734, !735}
!731 = !DILocalVariable(name: "target", arg: 1, scope: !724, file: !1, line: 92, type: !313)
!732 = !DILocalVariable(name: "mesg", arg: 2, scope: !724, file: !1, line: 93, type: !564)
!733 = !DILocalVariable(name: "mesgCB", arg: 3, scope: !724, file: !1, line: 94, type: !727)
!734 = !DILocalVariable(name: "clientData", arg: 4, scope: !724, file: !1, line: 95, type: !313)
!735 = !DILocalVariable(name: "beval", scope: !724, file: !1, line: 102, type: !316)
!736 = !DILocation(line: 92, column: 11, scope: !724)
!737 = !DILocation(line: 93, column: 13, scope: !724)
!738 = !DILocation(line: 94, column: 12, scope: !724)
!739 = !DILocation(line: 95, column: 11, scope: !724)
!740 = !DILocation(line: 104, column: 14, scope: !741)
!741 = distinct !DILexicalBlock(scope: !724, file: !1, line: 104, column: 9)
!742 = !DILocation(line: 104, column: 32, scope: !741)
!743 = !DILocation(line: 104, column: 22, scope: !741)
!744 = !DILocation(line: 106, column: 8, scope: !745)
!745 = distinct !DILexicalBlock(scope: !741, file: !1, line: 105, column: 5)
!746 = !DILocation(line: 106, column: 2, scope: !745)
!747 = !DILocation(line: 107, column: 2, scope: !745)
!748 = !DILocation(line: 110, column: 13, scope: !724)
!749 = !DILocation(line: 102, column: 18, scope: !724)
!750 = !DILocation(line: 111, column: 15, scope: !751)
!751 = distinct !DILexicalBlock(scope: !724, file: !1, line: 111, column: 9)
!752 = !DILocation(line: 111, column: 9, scope: !724)
!753 = !DILocation(line: 114, column: 18, scope: !754)
!754 = distinct !DILexicalBlock(scope: !751, file: !1, line: 112, column: 5)
!755 = !DILocation(line: 114, column: 9, scope: !754)
!756 = !DILocation(line: 114, column: 16, scope: !754)
!757 = !{!758, !759, i64 0}
!758 = !{!"BalloonEvalStruct", !759, i64 0, !759, i64 8, !759, i64 16, !762, i64 24, !760, i64 28, !762, i64 32, !762, i64 36, !762, i64 40, !759, i64 48, !759, i64 56, !762, i64 64, !759, i64 72, !759, i64 80}
!759 = !{!"any pointer", !760, i64 0}
!760 = !{!"omnipotent char", !761, i64 0}
!761 = !{!"Simple C/C++ TBAA"}
!762 = !{!"int", !760, i64 0}
!763 = !DILocation(line: 119, column: 9, scope: !754)
!764 = !DILocation(line: 119, column: 19, scope: !754)
!765 = !{!758, !760, i64 28}
!766 = !DILocation(line: 120, column: 18, scope: !754)
!767 = !{!758, !759, i64 80}
!768 = !DILocation(line: 120, column: 2, scope: !754)
!769 = !DILocation(line: 121, column: 20, scope: !754)
!770 = !DILocation(line: 121, column: 15, scope: !754)
!771 = !DILocation(line: 121, column: 37, scope: !754)
!772 = !DILocation(line: 121, column: 13, scope: !754)
!773 = !DILocation(line: 122, column: 9, scope: !754)
!774 = !DILocation(line: 122, column: 15, scope: !754)
!775 = !{!758, !759, i64 48}
!776 = !DILocation(line: 123, column: 9, scope: !754)
!777 = !DILocation(line: 123, column: 20, scope: !754)
!778 = !{!758, !759, i64 56}
!779 = !DILocation(line: 130, column: 25, scope: !754)
!780 = !DILocation(line: 130, column: 2, scope: !754)
!781 = !DILocalVariable(name: "beval", arg: 1, scope: !782, file: !1, line: 1012, type: !316)
!782 = distinct !DISubprogram(name: "createBalloonEvalWindow", scope: !1, file: !1, line: 1012, type: !783, isLocal: true, isDefinition: true, scopeLine: 1013, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !785)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !316}
!785 = !{!781}
!786 = !DILocation(line: 1012, column: 38, scope: !782, inlinedAt: !787)
!787 = distinct !DILocation(line: 131, column: 2, scope: !754)
!788 = !DILocation(line: 1014, column: 27, scope: !782, inlinedAt: !787)
!789 = !DILocation(line: 1014, column: 12, scope: !782, inlinedAt: !787)
!790 = !DILocation(line: 1014, column: 25, scope: !782, inlinedAt: !787)
!791 = !{!758, !759, i64 8}
!792 = !DILocation(line: 1016, column: 5, scope: !782, inlinedAt: !787)
!793 = !DILocation(line: 1017, column: 30, scope: !782, inlinedAt: !787)
!794 = !DILocation(line: 1017, column: 5, scope: !782, inlinedAt: !787)
!795 = !DILocation(line: 1018, column: 32, scope: !782, inlinedAt: !787)
!796 = !DILocation(line: 1018, column: 5, scope: !782, inlinedAt: !787)
!797 = !DILocation(line: 1019, column: 36, scope: !782, inlinedAt: !787)
!798 = !DILocation(line: 1019, column: 5, scope: !782, inlinedAt: !787)
!799 = !DILocation(line: 1025, column: 5, scope: !782, inlinedAt: !787)
!800 = !DILocation(line: 1028, column: 27, scope: !782, inlinedAt: !787)
!801 = !DILocation(line: 1028, column: 12, scope: !782, inlinedAt: !787)
!802 = !DILocation(line: 1028, column: 25, scope: !782, inlinedAt: !787)
!803 = !{!758, !759, i64 16}
!804 = !DILocation(line: 1030, column: 29, scope: !782, inlinedAt: !787)
!805 = !DILocation(line: 1030, column: 5, scope: !782, inlinedAt: !787)
!806 = !DILocation(line: 1031, column: 27, scope: !782, inlinedAt: !787)
!807 = !DILocation(line: 1031, column: 5, scope: !782, inlinedAt: !787)
!808 = !DILocation(line: 1043, column: 28, scope: !782, inlinedAt: !787)
!809 = !DILocation(line: 1043, column: 5, scope: !782, inlinedAt: !787)
!810 = !DILocation(line: 1045, column: 32, scope: !782, inlinedAt: !787)
!811 = !DILocation(line: 1045, column: 5, scope: !782, inlinedAt: !787)
!812 = !DILocation(line: 1046, column: 28, scope: !782, inlinedAt: !787)
!813 = !DILocation(line: 1046, column: 5, scope: !782, inlinedAt: !787)
!814 = !DILocation(line: 1048, column: 23, scope: !782, inlinedAt: !787)
!815 = !DILocation(line: 1048, column: 66, scope: !782, inlinedAt: !787)
!816 = !DILocation(line: 1048, column: 5, scope: !782, inlinedAt: !787)
!817 = !DILocation(line: 146, column: 5, scope: !754)
!818 = !DILocation(line: 149, column: 1, scope: !724)
!819 = distinct !DISubprogram(name: "addEventHandler", scope: !1, file: !1, line: 237, type: !820, isLocal: true, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !822)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !321, !316}
!822 = !{!823, !824}
!823 = !DILocalVariable(name: "target", arg: 1, scope: !819, file: !1, line: 237, type: !321)
!824 = !DILocalVariable(name: "beval", arg: 2, scope: !819, file: !1, line: 237, type: !316)
!825 = !DILocation(line: 237, column: 28, scope: !819)
!826 = !DILocation(line: 237, column: 49, scope: !819)
!827 = !DILocation(line: 245, column: 5, scope: !819)
!828 = !DILocation(line: 253, column: 9, scope: !829)
!829 = distinct !DILexicalBlock(scope: !819, file: !1, line: 253, column: 9)
!830 = !{!762, !762, i64 0}
!831 = !DILocation(line: 253, column: 23, scope: !829)
!832 = !DILocation(line: 253, column: 35, scope: !829)
!833 = !DILocation(line: 253, column: 43, scope: !829)
!834 = !DILocation(line: 253, column: 28, scope: !829)
!835 = !DILocation(line: 254, column: 9, scope: !829)
!836 = !DILocation(line: 253, column: 9, scope: !819)
!837 = !DILocation(line: 256, column: 2, scope: !838)
!838 = distinct !DILexicalBlock(scope: !829, file: !1, line: 255, column: 5)
!839 = !{!840, !759, i64 312}
!840 = !{!"Gui", !762, i64 0, !762, i64 4, !762, i64 8, !762, i64 12, !762, i64 16, !762, i64 20, !762, i64 24, !759, i64 32, !762, i64 40, !762, i64 44, !762, i64 48, !762, i64 52, !762, i64 56, !760, i64 60, !762, i64 64, !762, i64 68, !762, i64 72, !762, i64 76, !762, i64 80, !762, i64 84, !762, i64 88, !762, i64 92, !762, i64 96, !762, i64 100, !762, i64 104, !760, i64 108, !841, i64 112, !760, i64 192, !762, i64 204, !762, i64 208, !762, i64 212, !762, i64 216, !762, i64 220, !762, i64 224, !759, i64 232, !762, i64 240, !759, i64 248, !842, i64 256, !842, i64 264, !842, i64 272, !842, i64 280, !762, i64 288, !759, i64 296, !759, i64 304, !759, i64 312, !759, i64 320, !759, i64 328, !759, i64 336, !759, i64 344, !759, i64 352, !759, i64 360, !759, i64 368, !759, i64 376, !759, i64 384, !759, i64 392, !759, i64 400, !759, i64 408, !759, i64 416, !759, i64 424, !759, i64 432, !762, i64 440, !759, i64 448, !759, i64 456}
!841 = !{!"GuiScrollbar", !842, i64 0, !759, i64 8, !762, i64 16, !842, i64 24, !842, i64 32, !842, i64 40, !762, i64 48, !762, i64 52, !762, i64 56, !762, i64 60, !759, i64 64, !842, i64 72}
!842 = !{!"long", !760, i64 0}
!843 = !DILocation(line: 259, column: 5, scope: !838)
!844 = !DILocation(line: 260, column: 1, scope: !819)
!845 = distinct !DISubprogram(name: "gui_mch_enable_beval_area", scope: !1, file: !1, line: 175, type: !783, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !846)
!846 = !{!847}
!847 = !DILocalVariable(name: "beval", arg: 1, scope: !845, file: !1, line: 175, type: !316)
!848 = !DILocation(line: 175, column: 40, scope: !845)
!849 = !DILocation(line: 177, column: 15, scope: !850)
!850 = distinct !DILexicalBlock(scope: !845, file: !1, line: 177, column: 9)
!851 = !DILocation(line: 177, column: 9, scope: !845)
!852 = !DILocation(line: 178, column: 25, scope: !850)
!853 = !DILocation(line: 178, column: 2, scope: !850)
!854 = !DILocation(line: 179, column: 1, scope: !845)
!855 = distinct !DISubprogram(name: "gui_mch_disable_beval_area", scope: !1, file: !1, line: 182, type: !783, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !856)
!856 = !{!857}
!857 = !DILocalVariable(name: "beval", arg: 1, scope: !855, file: !1, line: 182, type: !316)
!858 = !DILocation(line: 182, column: 41, scope: !855)
!859 = !DILocation(line: 184, column: 15, scope: !860)
!860 = distinct !DILexicalBlock(scope: !855, file: !1, line: 184, column: 9)
!861 = !DILocation(line: 184, column: 9, scope: !855)
!862 = !DILocalVariable(name: "beval", arg: 1, scope: !863, file: !1, line: 263, type: !316)
!863 = distinct !DISubprogram(name: "removeEventHandler", scope: !1, file: !1, line: 263, type: !783, isLocal: true, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !864)
!864 = !{!862}
!865 = !DILocation(line: 263, column: 33, scope: !863, inlinedAt: !866)
!866 = distinct !DILocation(line: 185, column: 2, scope: !860)
!867 = !DILocation(line: 265, column: 5, scope: !863, inlinedAt: !866)
!868 = !DILocation(line: 269, column: 9, scope: !869, inlinedAt: !866)
!869 = distinct !DILexicalBlock(scope: !863, file: !1, line: 269, column: 9)
!870 = !DILocation(line: 269, column: 23, scope: !869, inlinedAt: !866)
!871 = !DILocation(line: 269, column: 35, scope: !869, inlinedAt: !866)
!872 = !DILocation(line: 269, column: 43, scope: !869, inlinedAt: !866)
!873 = !DILocation(line: 269, column: 28, scope: !869, inlinedAt: !866)
!874 = !DILocation(line: 270, column: 39, scope: !869, inlinedAt: !866)
!875 = !DILocation(line: 270, column: 9, scope: !869, inlinedAt: !866)
!876 = !DILocation(line: 269, column: 9, scope: !863, inlinedAt: !866)
!877 = !DILocation(line: 272, column: 2, scope: !878, inlinedAt: !866)
!878 = distinct !DILexicalBlock(scope: !869, file: !1, line: 271, column: 5)
!879 = !DILocation(line: 275, column: 5, scope: !878, inlinedAt: !866)
!880 = !DILocation(line: 186, column: 1, scope: !855)
!881 = distinct !DISubprogram(name: "gui_mch_post_balloon", scope: !1, file: !1, line: 210, type: !882, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !316, !564}
!884 = !{!885, !886}
!885 = !DILocalVariable(name: "beval", arg: 1, scope: !881, file: !1, line: 210, type: !316)
!886 = !DILocalVariable(name: "mesg", arg: 2, scope: !881, file: !1, line: 210, type: !564)
!887 = !DILocation(line: 210, column: 35, scope: !881)
!888 = !DILocation(line: 210, column: 50, scope: !881)
!889 = !DILocation(line: 212, column: 21, scope: !881)
!890 = !DILocation(line: 212, column: 5, scope: !881)
!891 = !DILocation(line: 213, column: 23, scope: !881)
!892 = !DILocation(line: 213, column: 18, scope: !881)
!893 = !DILocation(line: 213, column: 16, scope: !881)
!894 = !DILocation(line: 214, column: 9, scope: !881)
!895 = !DILocation(line: 213, column: 40, scope: !881)
!896 = !DILocation(line: 214, column: 20, scope: !897)
!897 = distinct !DILexicalBlock(scope: !881, file: !1, line: 214, column: 9)
!898 = !DILocation(line: 215, column: 2, scope: !897)
!899 = !DILocalVariable(name: "beval", arg: 1, scope: !900, file: !1, line: 989, type: !316)
!900 = distinct !DISubprogram(name: "undrawBalloon", scope: !1, file: !1, line: 989, type: !783, isLocal: true, isDefinition: true, scopeLine: 990, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !901)
!901 = !{!899}
!902 = !DILocation(line: 989, column: 28, scope: !900, inlinedAt: !903)
!903 = distinct !DILocation(line: 217, column: 2, scope: !897)
!904 = !DILocation(line: 991, column: 16, scope: !905, inlinedAt: !903)
!905 = distinct !DILexicalBlock(scope: !900, file: !1, line: 991, column: 9)
!906 = !DILocation(line: 991, column: 29, scope: !905, inlinedAt: !903)
!907 = !DILocation(line: 991, column: 9, scope: !900, inlinedAt: !903)
!908 = !DILocation(line: 992, column: 2, scope: !905, inlinedAt: !903)
!909 = !DILocation(line: 993, column: 12, scope: !900, inlinedAt: !903)
!910 = !DILocation(line: 993, column: 22, scope: !900, inlinedAt: !903)
!911 = !DILocation(line: 218, column: 1, scope: !881)
!912 = distinct !DISubprogram(name: "drawBalloon", scope: !1, file: !1, line: 902, type: !783, isLocal: true, isDefinition: true, scopeLine: 903, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !913)
!913 = !{!914, !915, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927}
!914 = !DILocalVariable(name: "beval", arg: 1, scope: !912, file: !1, line: 902, type: !316)
!915 = !DILocalVariable(name: "requisition", scope: !916, file: !1, line: 906, type: !528)
!916 = distinct !DILexicalBlock(scope: !917, file: !1, line: 905, column: 5)
!917 = distinct !DILexicalBlock(scope: !912, file: !1, line: 904, column: 9)
!918 = !DILocalVariable(name: "screen_w", scope: !916, file: !1, line: 907, type: !410)
!919 = !DILocalVariable(name: "screen_h", scope: !916, file: !1, line: 908, type: !410)
!920 = !DILocalVariable(name: "screen_x", scope: !916, file: !1, line: 909, type: !410)
!921 = !DILocalVariable(name: "screen_y", scope: !916, file: !1, line: 910, type: !410)
!922 = !DILocalVariable(name: "x", scope: !916, file: !1, line: 911, type: !410)
!923 = !DILocalVariable(name: "y", scope: !916, file: !1, line: 912, type: !410)
!924 = !DILocalVariable(name: "x_offset", scope: !916, file: !1, line: 913, type: !410)
!925 = !DILocalVariable(name: "y_offset", scope: !916, file: !1, line: 914, type: !410)
!926 = !DILocalVariable(name: "layout", scope: !916, file: !1, line: 915, type: !703)
!927 = !DILocalVariable(name: "screen", scope: !916, file: !1, line: 918, type: !646)
!928 = !DILocation(line: 902, column: 26, scope: !912)
!929 = !DILocation(line: 904, column: 16, scope: !917)
!930 = !DILocation(line: 904, column: 20, scope: !917)
!931 = !DILocation(line: 904, column: 9, scope: !912)
!932 = !DILocation(line: 906, column: 2, scope: !916)
!933 = !DILocation(line: 907, column: 2, scope: !916)
!934 = !DILocation(line: 908, column: 2, scope: !916)
!935 = !DILocation(line: 909, column: 2, scope: !916)
!936 = !DILocation(line: 910, column: 2, scope: !916)
!937 = !DILocation(line: 911, column: 2, scope: !916)
!938 = !DILocation(line: 912, column: 2, scope: !916)
!939 = !DILocation(line: 913, column: 7, scope: !916)
!940 = !DILocation(line: 914, column: 7, scope: !916)
!941 = !DILocation(line: 920, column: 40, scope: !916)
!942 = !DILocation(line: 920, column: 11, scope: !916)
!943 = !DILocation(line: 918, column: 13, scope: !916)
!944 = !DILocation(line: 921, column: 24, scope: !916)
!945 = !DILocation(line: 921, column: 2, scope: !916)
!946 = !DILocation(line: 923, column: 40, scope: !916)
!947 = !DILocation(line: 907, column: 7, scope: !916)
!948 = !DILocation(line: 908, column: 7, scope: !916)
!949 = !DILocation(line: 909, column: 7, scope: !916)
!950 = !DILocation(line: 910, column: 7, scope: !916)
!951 = !DILocation(line: 923, column: 2, scope: !916)
!952 = !DILocation(line: 926, column: 33, scope: !916)
!953 = !DILocation(line: 926, column: 2, scope: !916)
!954 = !DILocation(line: 927, column: 33, scope: !916)
!955 = !DILocation(line: 927, column: 2, scope: !916)
!956 = !DILocation(line: 930, column: 27, scope: !916)
!957 = !DILocation(line: 930, column: 66, scope: !916)
!958 = !DILocalVariable(name: "label", arg: 1, scope: !959, file: !1, line: 725, type: !666)
!959 = distinct !DISubprogram(name: "set_printable_label_text", scope: !1, file: !1, line: 725, type: !960, isLocal: true, isDefinition: true, scopeLine: 726, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !962)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !666, !564}
!962 = !{!958, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !1008, !1038, !1039, !1040}
!963 = !DILocalVariable(name: "text", arg: 2, scope: !959, file: !1, line: 725, type: !564)
!964 = !DILocalVariable(name: "convbuf", scope: !959, file: !1, line: 727, type: !564)
!965 = !DILocalVariable(name: "buf", scope: !959, file: !1, line: 728, type: !564)
!966 = !DILocalVariable(name: "p", scope: !959, file: !1, line: 729, type: !564)
!967 = !DILocalVariable(name: "pdest", scope: !959, file: !1, line: 730, type: !564)
!968 = !DILocalVariable(name: "len", scope: !959, file: !1, line: 731, type: !357)
!969 = !DILocalVariable(name: "charlen", scope: !959, file: !1, line: 732, type: !410)
!970 = !DILocalVariable(name: "uc", scope: !959, file: !1, line: 733, type: !410)
!971 = !DILocalVariable(name: "attr_list", scope: !959, file: !1, line: 734, type: !698)
!972 = !DILocalVariable(name: "aep", scope: !973, file: !1, line: 778, type: !975)
!973 = distinct !DILexicalBlock(scope: !974, file: !1, line: 777, column: 5)
!974 = distinct !DILexicalBlock(scope: !959, file: !1, line: 776, column: 9)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "attrentry_T", file: !977, line: 1122, baseType: !978)
!977 = !DIFile(filename: "./structs.h", directory: "/home/sahil/vim/src")
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attr_entry", file: !977, line: 1087, size: 320, elements: !979)
!979 = !{!980, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ae_attr", scope: !978, file: !977, line: 1089, baseType: !981, size: 16)
!981 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ae_u", scope: !978, file: !977, line: 1121, baseType: !983, size: 256, offset: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !978, file: !977, line: 1090, size: 256, elements: !984)
!984 = !{!985, !990, !1000}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "term", scope: !983, file: !977, line: 1096, baseType: !986, size: 128)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !983, file: !977, line: 1092, size: 128, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !986, file: !977, line: 1094, baseType: !564, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !986, file: !977, line: 1095, baseType: !564, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "cterm", scope: !983, file: !977, line: 1108, baseType: !991, size: 256)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !983, file: !977, line: 1097, size: 256, elements: !992)
!992 = !{!993, !995, !996, !997, !998, !999}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "fg_color", scope: !991, file: !977, line: 1100, baseType: !994, size: 16)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !236, line: 325, baseType: !367)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "bg_color", scope: !991, file: !977, line: 1101, baseType: !994, size: 16, offset: 16)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ul_color", scope: !991, file: !977, line: 1102, baseType: !994, size: 16, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "fg_rgb", scope: !991, file: !977, line: 1104, baseType: !712, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "bg_rgb", scope: !991, file: !977, line: 1105, baseType: !712, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ul_rgb", scope: !991, file: !977, line: 1106, baseType: !712, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gui", scope: !983, file: !977, line: 1119, baseType: !1001, size: 256)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !983, file: !977, line: 1110, size: 256, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "fg_color", scope: !1001, file: !977, line: 1112, baseType: !712, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "bg_color", scope: !1001, file: !977, line: 1113, baseType: !712, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "sp_color", scope: !1001, file: !977, line: 1114, baseType: !712, size: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1001, file: !977, line: 1115, baseType: !1007, size: 64, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuiFont", file: !713, line: 208, baseType: !404)
!1008 = !DILocalVariable(name: "attr", scope: !973, file: !1, line: 779, type: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAttribute", file: !204, line: 75, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoAttribute", file: !204, line: 256, size: 128, elements: !1012)
!1012 = !{!1013, !1036, !1037}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "klass", scope: !1011, file: !204, line: 258, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAttrClass", file: !204, line: 76, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoAttrClass", file: !204, line: 298, size: 256, elements: !1018)
!1018 = !{!1019, !1021, !1027, !1031}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1017, file: !204, line: 301, baseType: !1020, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAttrType", file: !204, line: 192, baseType: !203)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !1017, file: !204, line: 302, baseType: !1022, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1009, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1017, file: !204, line: 303, baseType: !1028, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !1009}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !1017, file: !204, line: 304, baseType: !1032, size: 64, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!1035, !1025, !1025}
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !356, line: 50, baseType: !409)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "start_index", scope: !1011, file: !204, line: 259, baseType: !355, size: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "end_index", scope: !1011, file: !204, line: 260, baseType: !355, size: 32, offset: 96)
!1038 = !DILocalVariable(name: "pixel", scope: !973, file: !1, line: 780, type: !712)
!1039 = !DILocalVariable(name: "color", scope: !973, file: !1, line: 787, type: !384)
!1040 = !DILocalVariable(name: "outlen", scope: !1041, file: !1, line: 825, type: !410)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !1, line: 824, column: 3)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !1, line: 823, column: 7)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 816, column: 6)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !1, line: 811, column: 10)
!1045 = distinct !DILexicalBlock(scope: !973, file: !1, line: 809, column: 2)
!1046 = !DILocation(line: 725, column: 36, scope: !959, inlinedAt: !1047)
!1047 = distinct !DILocation(line: 930, column: 2, scope: !916)
!1048 = !DILocation(line: 725, column: 51, scope: !959, inlinedAt: !1047)
!1049 = !DILocation(line: 727, column: 17, scope: !959, inlinedAt: !1047)
!1050 = !DILocation(line: 737, column: 21, scope: !1051, inlinedAt: !1047)
!1051 = distinct !DILexicalBlock(scope: !959, file: !1, line: 737, column: 9)
!1052 = !{!1053, !762, i64 0}
!1053 = !{!"", !762, i64 0, !762, i64 4, !759, i64 8, !762, i64 16}
!1054 = !DILocation(line: 737, column: 29, scope: !1051, inlinedAt: !1047)
!1055 = !DILocation(line: 737, column: 9, scope: !959, inlinedAt: !1047)
!1056 = !DILocation(line: 739, column: 12, scope: !1057, inlinedAt: !1047)
!1057 = distinct !DILexicalBlock(scope: !1051, file: !1, line: 738, column: 5)
!1058 = !DILocation(line: 740, column: 14, scope: !1059, inlinedAt: !1047)
!1059 = distinct !DILexicalBlock(scope: !1057, file: !1, line: 740, column: 6)
!1060 = !DILocation(line: 740, column: 6, scope: !1057, inlinedAt: !1047)
!1061 = !DILocation(line: 731, column: 21, scope: !959, inlinedAt: !1047)
!1062 = !DILocation(line: 729, column: 17, scope: !959, inlinedAt: !1047)
!1063 = !DILocation(line: 746, column: 20, scope: !1064, inlinedAt: !1047)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !1, line: 746, column: 5)
!1065 = distinct !DILexicalBlock(scope: !959, file: !1, line: 746, column: 5)
!1066 = !{!760, !760, i64 0}
!1067 = !DILocation(line: 746, column: 23, scope: !1064, inlinedAt: !1047)
!1068 = !DILocation(line: 746, column: 5, scope: !1065, inlinedAt: !1047)
!1069 = !DILocation(line: 748, column: 18, scope: !1070, inlinedAt: !1047)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 748, column: 6)
!1071 = distinct !DILexicalBlock(scope: !1064, file: !1, line: 747, column: 5)
!1072 = !DILocation(line: 748, column: 6, scope: !1071, inlinedAt: !1047)
!1073 = !DILocation(line: 732, column: 14, scope: !959, inlinedAt: !1047)
!1074 = !DILocation(line: 751, column: 13, scope: !1075, inlinedAt: !1047)
!1075 = distinct !DILexicalBlock(scope: !1070, file: !1, line: 749, column: 2)
!1076 = !DILocation(line: 755, column: 16, scope: !1077, inlinedAt: !1047)
!1077 = distinct !DILexicalBlock(scope: !1070, file: !1, line: 754, column: 2)
!1078 = !DILocation(line: 756, column: 11, scope: !1077, inlinedAt: !1047)
!1079 = !DILocation(line: 733, column: 14, scope: !959, inlinedAt: !1047)
!1080 = !DILocation(line: 758, column: 21, scope: !1081, inlinedAt: !1047)
!1081 = distinct !DILexicalBlock(scope: !1077, file: !1, line: 758, column: 10)
!1082 = !DILocation(line: 758, column: 18, scope: !1081, inlinedAt: !1047)
!1083 = !DILocation(line: 758, column: 10, scope: !1077, inlinedAt: !1047)
!1084 = !DILocation(line: 761, column: 18, scope: !1085, inlinedAt: !1047)
!1085 = distinct !DILexicalBlock(scope: !1077, file: !1, line: 761, column: 10)
!1086 = !DILocation(line: 761, column: 29, scope: !1085, inlinedAt: !1047)
!1087 = !DILocation(line: 761, column: 23, scope: !1085, inlinedAt: !1047)
!1088 = !DILocation(line: 763, column: 16, scope: !1089, inlinedAt: !1047)
!1089 = distinct !DILexicalBlock(scope: !1085, file: !1, line: 763, column: 15)
!1090 = !DILocation(line: 766, column: 3, scope: !1089, inlinedAt: !1047)
!1091 = !DILocation(line: 746, column: 33, scope: !1064, inlinedAt: !1047)
!1092 = distinct !{!1092, !1093, !1094}
!1093 = !DILocation(line: 746, column: 5, scope: !1065)
!1094 = !DILocation(line: 770, column: 5, scope: !1065)
!1095 = !DILocation(line: 772, column: 17, scope: !959, inlinedAt: !1047)
!1096 = !DILocation(line: 734, column: 22, scope: !959, inlinedAt: !1047)
!1097 = !DILocation(line: 773, column: 11, scope: !959, inlinedAt: !1047)
!1098 = !DILocation(line: 728, column: 17, scope: !959, inlinedAt: !1047)
!1099 = !DILocation(line: 776, column: 13, scope: !974, inlinedAt: !1047)
!1100 = !DILocation(line: 776, column: 9, scope: !959, inlinedAt: !1047)
!1101 = !DILocation(line: 787, column: 2, scope: !973, inlinedAt: !1047)
!1102 = !DILocation(line: 787, column: 11, scope: !973, inlinedAt: !1047)
!1103 = !DILocation(line: 791, column: 27, scope: !973, inlinedAt: !1047)
!1104 = !DILocation(line: 791, column: 8, scope: !973, inlinedAt: !1047)
!1105 = !DILocation(line: 778, column: 15, scope: !973, inlinedAt: !1047)
!1106 = !DILocation(line: 792, column: 15, scope: !973, inlinedAt: !1047)
!1107 = !DILocation(line: 792, column: 10, scope: !973, inlinedAt: !1047)
!1108 = !DILocation(line: 792, column: 31, scope: !973, inlinedAt: !1047)
!1109 = !DILocation(line: 792, column: 40, scope: !973, inlinedAt: !1047)
!1110 = !DILocation(line: 780, column: 13, scope: !973, inlinedAt: !1047)
!1111 = !DILocation(line: 793, column: 12, scope: !1112, inlinedAt: !1047)
!1112 = distinct !DILexicalBlock(scope: !973, file: !1, line: 793, column: 6)
!1113 = !DILocation(line: 793, column: 6, scope: !973, inlinedAt: !1047)
!1114 = !DILocation(line: 802, column: 59, scope: !1112, inlinedAt: !1047)
!1115 = !{!840, !759, i64 328}
!1116 = !DILocation(line: 802, column: 31, scope: !1112, inlinedAt: !1047)
!1117 = !DILocation(line: 802, column: 6, scope: !1112, inlinedAt: !1047)
!1118 = !DILocation(line: 730, column: 17, scope: !959, inlinedAt: !1047)
!1119 = !DILocation(line: 808, column: 9, scope: !973, inlinedAt: !1047)
!1120 = !DILocation(line: 808, column: 12, scope: !973, inlinedAt: !1047)
!1121 = !DILocation(line: 808, column: 2, scope: !973, inlinedAt: !1047)
!1122 = !DILocation(line: 811, column: 22, scope: !1044, inlinedAt: !1047)
!1123 = !DILocation(line: 811, column: 27, scope: !1044, inlinedAt: !1047)
!1124 = !DILocation(line: 811, column: 31, scope: !1044, inlinedAt: !1047)
!1125 = !DILocation(line: 813, column: 16, scope: !1126, inlinedAt: !1047)
!1126 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 812, column: 6)
!1127 = !DILocation(line: 813, column: 9, scope: !1126, inlinedAt: !1047)
!1128 = !DILocation(line: 813, column: 12, scope: !1126, inlinedAt: !1047)
!1129 = !DILocation(line: 814, column: 6, scope: !1126, inlinedAt: !1047)
!1130 = !DILocation(line: 817, column: 13, scope: !1043, inlinedAt: !1047)
!1131 = !DILocation(line: 818, column: 8, scope: !1043, inlinedAt: !1047)
!1132 = !DILocation(line: 820, column: 18, scope: !1133, inlinedAt: !1047)
!1133 = distinct !DILexicalBlock(scope: !1043, file: !1, line: 820, column: 7)
!1134 = !DILocation(line: 820, column: 15, scope: !1133, inlinedAt: !1047)
!1135 = !DILocation(line: 820, column: 7, scope: !1043, inlinedAt: !1047)
!1136 = !DILocation(line: 823, column: 15, scope: !1042, inlinedAt: !1047)
!1137 = !DILocation(line: 823, column: 26, scope: !1042, inlinedAt: !1047)
!1138 = !DILocation(line: 823, column: 20, scope: !1042, inlinedAt: !1047)
!1139 = !DILocation(line: 823, column: 37, scope: !1042, inlinedAt: !1047)
!1140 = !DILocation(line: 823, column: 7, scope: !1043, inlinedAt: !1047)
!1141 = !DILocation(line: 829, column: 11, scope: !1142, inlinedAt: !1047)
!1142 = distinct !DILexicalBlock(scope: !1041, file: !1, line: 829, column: 11)
!1143 = !DILocation(line: 829, column: 14, scope: !1142, inlinedAt: !1047)
!1144 = !DILocation(line: 829, column: 21, scope: !1142, inlinedAt: !1047)
!1145 = !DILocation(line: 831, column: 4, scope: !1146, inlinedAt: !1047)
!1146 = distinct !DILexicalBlock(scope: !1142, file: !1, line: 830, column: 7)
!1147 = !DILocation(line: 825, column: 11, scope: !1041, inlinedAt: !1047)
!1148 = !DILocation(line: 833, column: 7, scope: !1146, inlinedAt: !1047)
!1149 = !DILocation(line: 834, column: 19, scope: !1150, inlinedAt: !1047)
!1150 = distinct !DILexicalBlock(scope: !1142, file: !1, line: 834, column: 16)
!1151 = !DILocation(line: 834, column: 16, scope: !1142, inlinedAt: !1047)
!1152 = !DILocation(line: 838, column: 4, scope: !1153, inlinedAt: !1047)
!1153 = distinct !DILexicalBlock(scope: !1150, file: !1, line: 835, column: 7)
!1154 = !DILocation(line: 839, column: 17, scope: !1153, inlinedAt: !1047)
!1155 = !DILocation(line: 839, column: 13, scope: !1153, inlinedAt: !1047)
!1156 = !DILocation(line: 840, column: 7, scope: !1153, inlinedAt: !1047)
!1157 = !DILocation(line: 843, column: 23, scope: !1158, inlinedAt: !1047)
!1158 = distinct !DILexicalBlock(scope: !1150, file: !1, line: 842, column: 7)
!1159 = !{!759, !759, i64 0}
!1160 = !DILocation(line: 843, column: 4, scope: !1158, inlinedAt: !1047)
!1161 = !DILocation(line: 846, column: 11, scope: !1041, inlinedAt: !1047)
!1162 = !DILocation(line: 861, column: 11, scope: !1163, inlinedAt: !1047)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !1, line: 847, column: 7)
!1164 = distinct !DILexicalBlock(scope: !1041, file: !1, line: 846, column: 11)
!1165 = !{!1166, !1167, i64 4}
!1166 = !{!"_GdkColor", !762, i64 0, !1167, i64 4, !1167, i64 6, !1167, i64 8}
!1167 = !{!"short", !760, i64 0}
!1168 = !DILocation(line: 861, column: 22, scope: !1163, inlinedAt: !1047)
!1169 = !{!1166, !1167, i64 6}
!1170 = !DILocation(line: 861, column: 35, scope: !1163, inlinedAt: !1047)
!1171 = !{!1166, !1167, i64 8}
!1172 = !DILocation(line: 860, column: 11, scope: !1163, inlinedAt: !1047)
!1173 = !DILocation(line: 779, column: 18, scope: !973, inlinedAt: !1047)
!1174 = !DILocation(line: 863, column: 30, scope: !1163, inlinedAt: !1047)
!1175 = !DILocation(line: 863, column: 24, scope: !1163, inlinedAt: !1047)
!1176 = !DILocation(line: 863, column: 10, scope: !1163, inlinedAt: !1047)
!1177 = !DILocation(line: 863, column: 22, scope: !1163, inlinedAt: !1047)
!1178 = !{!1179, !762, i64 8}
!1179 = !{!"_PangoAttribute", !759, i64 0, !762, i64 8, !762, i64 12}
!1180 = !DILocation(line: 864, column: 24, scope: !1163, inlinedAt: !1047)
!1181 = !DILocation(line: 864, column: 10, scope: !1163, inlinedAt: !1047)
!1182 = !DILocation(line: 864, column: 22, scope: !1163, inlinedAt: !1047)
!1183 = !{!1179, !762, i64 12}
!1184 = !DILocation(line: 865, column: 4, scope: !1163, inlinedAt: !1047)
!1185 = !DILocation(line: 873, column: 7, scope: !1163, inlinedAt: !1047)
!1186 = !DILocation(line: 874, column: 13, scope: !1041, inlinedAt: !1047)
!1187 = !DILocation(line: 875, column: 9, scope: !1041, inlinedAt: !1047)
!1188 = !DILocation(line: 876, column: 3, scope: !1041, inlinedAt: !1047)
!1189 = !DILocation(line: 879, column: 7, scope: !1190, inlinedAt: !1047)
!1190 = distinct !DILexicalBlock(scope: !1042, file: !1, line: 878, column: 3)
!1191 = distinct !{!1191, !1192, !1193}
!1192 = !DILocation(line: 879, column: 7, scope: !1190)
!1193 = !DILocation(line: 881, column: 28, scope: !1190)
!1194 = !DILocation(line: 880, column: 15, scope: !1190, inlinedAt: !1047)
!1195 = !{!1196}
!1196 = distinct !{!1196, !1197}
!1197 = distinct !{!1197, !"LVerDomain"}
!1198 = !DILocation(line: 880, column: 13, scope: !1190, inlinedAt: !1047)
!1199 = !{!1200}
!1200 = distinct !{!1200, !1197}
!1201 = distinct !{!1201, !1192, !1193, !1202}
!1202 = !{!"llvm.loop.isvectorized", i32 1}
!1203 = !DILocation(line: 880, column: 17, scope: !1190, inlinedAt: !1047)
!1204 = !DILocation(line: 880, column: 10, scope: !1190, inlinedAt: !1047)
!1205 = !DILocation(line: 881, column: 14, scope: !1190, inlinedAt: !1047)
!1206 = !DILocation(line: 880, column: 4, scope: !1190, inlinedAt: !1047)
!1207 = distinct !{!1207, !1208}
!1208 = !{!"llvm.loop.unroll.disable"}
!1209 = !DILocation(line: 881, column: 24, scope: !1190, inlinedAt: !1047)
!1210 = distinct !{!1210, !1192, !1193, !1202}
!1211 = distinct !{!1211, !1212, !1213}
!1212 = !DILocation(line: 808, column: 2, scope: !973)
!1213 = !DILocation(line: 884, column: 2, scope: !973)
!1214 = !DILocation(line: 885, column: 9, scope: !973, inlinedAt: !1047)
!1215 = !DILocation(line: 886, column: 5, scope: !974, inlinedAt: !1047)
!1216 = !DILocation(line: 886, column: 5, scope: !973, inlinedAt: !1047)
!1217 = !DILocation(line: 888, column: 5, scope: !959, inlinedAt: !1047)
!1218 = !DILocation(line: 890, column: 5, scope: !959, inlinedAt: !1047)
!1219 = !DILocation(line: 891, column: 5, scope: !959, inlinedAt: !1047)
!1220 = !DILocation(line: 893, column: 5, scope: !959, inlinedAt: !1047)
!1221 = !DILocation(line: 894, column: 5, scope: !959, inlinedAt: !1047)
!1222 = !DILocation(line: 936, column: 32, scope: !916)
!1223 = !DILocation(line: 936, column: 11, scope: !916)
!1224 = !DILocation(line: 915, column: 15, scope: !916)
!1225 = !DILocation(line: 940, column: 2, scope: !916)
!1226 = !DILocation(line: 944, column: 17, scope: !916)
!1227 = !{!840, !762, i64 64}
!1228 = !{!840, !762, i64 208}
!1229 = !DILocation(line: 944, column: 15, scope: !916)
!1230 = !DILocation(line: 942, column: 2, scope: !916)
!1231 = !DILocation(line: 952, column: 33, scope: !916)
!1232 = !DILocation(line: 906, column: 17, scope: !916)
!1233 = !DILocation(line: 952, column: 2, scope: !916)
!1234 = !DILocation(line: 956, column: 53, scope: !916)
!1235 = !DILocation(line: 956, column: 24, scope: !916)
!1236 = !DILocation(line: 911, column: 7, scope: !916)
!1237 = !DILocation(line: 912, column: 7, scope: !916)
!1238 = !DILocation(line: 956, column: 2, scope: !916)
!1239 = !DILocation(line: 957, column: 14, scope: !916)
!1240 = !{!758, !762, i64 32}
!1241 = !DILocation(line: 957, column: 4, scope: !916)
!1242 = !DILocation(line: 958, column: 14, scope: !916)
!1243 = !{!758, !762, i64 36}
!1244 = !DILocation(line: 958, column: 4, scope: !916)
!1245 = !DILocation(line: 961, column: 8, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !916, file: !1, line: 961, column: 6)
!1247 = !DILocation(line: 961, column: 33, scope: !1246)
!1248 = !{!1249, !762, i64 0}
!1249 = !{!"_GtkRequisition", !762, i64 0, !762, i64 4}
!1250 = !DILocation(line: 961, column: 19, scope: !1246)
!1251 = !DILocation(line: 961, column: 41, scope: !1246)
!1252 = !DILocation(line: 961, column: 52, scope: !1246)
!1253 = !DILocation(line: 961, column: 50, scope: !1246)
!1254 = !DILocation(line: 961, column: 39, scope: !1246)
!1255 = !DILocation(line: 961, column: 6, scope: !916)
!1256 = !DILocation(line: 963, column: 33, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !916, file: !1, line: 963, column: 6)
!1258 = !{!1249, !762, i64 4}
!1259 = !DILocation(line: 963, column: 8, scope: !1257)
!1260 = !DILocation(line: 963, column: 19, scope: !1257)
!1261 = !DILocation(line: 963, column: 42, scope: !1257)
!1262 = !DILocation(line: 963, column: 53, scope: !1257)
!1263 = !DILocation(line: 963, column: 51, scope: !1257)
!1264 = !DILocation(line: 963, column: 40, scope: !1257)
!1265 = !DILocation(line: 964, column: 37, scope: !1257)
!1266 = !DILocation(line: 963, column: 6, scope: !916)
!1267 = !DILocation(line: 967, column: 6, scope: !916)
!1268 = !DILocation(line: 967, column: 4, scope: !916)
!1269 = !DILocation(line: 969, column: 6, scope: !916)
!1270 = !DILocation(line: 969, column: 4, scope: !916)
!1271 = !DILocation(line: 976, column: 34, scope: !916)
!1272 = !DILocation(line: 976, column: 2, scope: !916)
!1273 = !DILocation(line: 978, column: 25, scope: !916)
!1274 = !DILocation(line: 978, column: 2, scope: !916)
!1275 = !DILocation(line: 980, column: 9, scope: !916)
!1276 = !DILocation(line: 980, column: 19, scope: !916)
!1277 = !DILocation(line: 981, column: 2, scope: !916)
!1278 = !DILocation(line: 982, column: 5, scope: !917)
!1279 = !DILocation(line: 982, column: 5, scope: !916)
!1280 = !DILocation(line: 983, column: 1, scope: !912)
!1281 = distinct !DISubprogram(name: "target_event_cb", scope: !1, file: !1, line: 279, type: !1282, isLocal: true, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1599)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!409, !321, !1284, !456}
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEvent", file: !42, line: 68, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GdkEvent", file: !42, line: 491, size: 704, elements: !1287)
!1287 = !{!1288, !1290, !1299, !1312, !1319, !1328, !1376, !1392, !1408, !1423, !1442, !1450, !1461, !1474, !1487, !1500, !1509, !1532, !1569, !1579, !1589}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1286, file: !42, line: 493, baseType: !1289, size: 32)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventType", file: !42, line: 156, baseType: !41)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !1286, file: !42, line: 494, baseType: !1291, size: 192)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventAny", file: !42, line: 47, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventAny", file: !42, line: 266, size: 192, elements: !1293)
!1293 = !{!1294, !1295, !1296}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1292, file: !42, line: 268, baseType: !1289, size: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1292, file: !42, line: 269, baseType: !543, size: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1292, file: !42, line: 270, baseType: !1297, size: 8, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint8", file: !351, line: 40, baseType: !1298)
!1298 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "expose", scope: !1286, file: !42, line: 495, baseType: !1300, size: 448)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventExpose", file: !42, line: 48, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventExpose", file: !42, line: 273, size: 448, elements: !1302)
!1302 = !{!1303, !1304, !1305, !1306, !1307, !1311}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1301, file: !42, line: 275, baseType: !1289, size: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1301, file: !42, line: 276, baseType: !543, size: 64, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1301, file: !42, line: 277, baseType: !1297, size: 8, offset: 128)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !1301, file: !42, line: 278, baseType: !535, size: 128, offset: 160)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1301, file: !42, line: 279, baseType: !1308, size: 64, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkRegion", file: !13, line: 108, baseType: !1310)
!1310 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkRegion", file: !13, line: 108, flags: DIFlagFwdDecl)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1301, file: !42, line: 280, baseType: !409, size: 32, offset: 384)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "no_expose", scope: !1286, file: !42, line: 496, baseType: !1313, size: 192)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventNoExpose", file: !42, line: 49, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventNoExpose", file: !42, line: 283, size: 192, elements: !1315)
!1315 = !{!1316, !1317, !1318}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1314, file: !42, line: 285, baseType: !1289, size: 32)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1314, file: !42, line: 286, baseType: !543, size: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1314, file: !42, line: 287, baseType: !1297, size: 8, offset: 128)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1286, file: !42, line: 497, baseType: !1320, size: 192)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventVisibility", file: !42, line: 50, baseType: !1321)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventVisibility", file: !42, line: 290, size: 192, elements: !1322)
!1322 = !{!1323, !1324, !1325, !1326}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1321, file: !42, line: 292, baseType: !1289, size: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1321, file: !42, line: 293, baseType: !543, size: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1321, file: !42, line: 294, baseType: !1297, size: 8, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1321, file: !42, line: 295, baseType: !1327, size: 32, offset: 160)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisibilityState", file: !42, line: 192, baseType: !83)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !1286, file: !42, line: 498, baseType: !1329, size: 640)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventMotion", file: !42, line: 51, baseType: !1330)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventMotion", file: !42, line: 298, size: 640, elements: !1331)
!1331 = !{!1332, !1333, !1334, !1335, !1336, !1338, !1339, !1341, !1342, !1344, !1374, !1375}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1330, file: !42, line: 300, baseType: !1289, size: 32)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1330, file: !42, line: 301, baseType: !543, size: 64, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1330, file: !42, line: 302, baseType: !1297, size: 8, offset: 128)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1330, file: !42, line: 303, baseType: !364, size: 32, offset: 160)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1330, file: !42, line: 304, baseType: !1337, size: 64, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !356, line: 58, baseType: !665)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1330, file: !42, line: 305, baseType: !1337, size: 64, offset: 256)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "axes", scope: !1330, file: !42, line: 306, baseType: !1340, size: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1330, file: !42, line: 307, baseType: !355, size: 32, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "is_hint", scope: !1330, file: !42, line: 308, baseType: !1343, size: 16, offset: 416)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint16", file: !351, line: 43, baseType: !981)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !1330, file: !42, line: 309, baseType: !1345, size: 64, offset: 448)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDevice", file: !89, line: 47, baseType: !1347)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDevice", file: !89, line: 98, size: 576, elements: !1348)
!1348 = !{!1349, !1350, !1351, !1353, !1355, !1356, !1357, !1366, !1367}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1347, file: !89, line: 100, baseType: !381, size: 192)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1347, file: !89, line: 103, baseType: !373, size: 64, offset: 192)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1347, file: !89, line: 104, baseType: !1352, size: 32, offset: 256)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkInputSource", file: !89, line: 64, baseType: !88)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1347, file: !89, line: 105, baseType: !1354, size: 32, offset: 288)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkInputMode", file: !89, line: 71, baseType: !95)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "has_cursor", scope: !1347, file: !89, line: 106, baseType: !1035, size: 32, offset: 320)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "num_axes", scope: !1347, file: !89, line: 108, baseType: !409, size: 32, offset: 352)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "axes", scope: !1347, file: !89, line: 109, baseType: !1358, size: 64, offset: 384)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDeviceAxis", file: !89, line: 46, baseType: !1360)
