; ModuleID = 'gui_gtk_f.c'
source_filename = "gui_gtk_f.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!478 = !DIEnumerator(name: "GDK_WINDOW_TYPE_HINT_TOOLTIP", value: 10)
!479 = !DIEnumerator(name: "GDK_WINDOW_TYPE_HINT_NOTIFICATION", value: 11)
!480 = !DIEnumerator(name: "GDK_WINDOW_TYPE_HINT_COMBO", value: 12)
!481 = !DIEnumerator(name: "GDK_WINDOW_TYPE_HINT_DND", value: 13)
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !78, line: 161, size: 32, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!484 = !DIEnumerator(name: "GDK_EXPOSURE_MASK", value: 2)
!485 = !DIEnumerator(name: "GDK_POINTER_MOTION_MASK", value: 4)
!486 = !DIEnumerator(name: "GDK_POINTER_MOTION_HINT_MASK", value: 8)
!487 = !DIEnumerator(name: "GDK_BUTTON_MOTION_MASK", value: 16)
!488 = !DIEnumerator(name: "GDK_BUTTON1_MOTION_MASK", value: 32)
!489 = !DIEnumerator(name: "GDK_BUTTON2_MOTION_MASK", value: 64)
!490 = !DIEnumerator(name: "GDK_BUTTON3_MOTION_MASK", value: 128)
!491 = !DIEnumerator(name: "GDK_BUTTON_PRESS_MASK", value: 256)
!492 = !DIEnumerator(name: "GDK_BUTTON_RELEASE_MASK", value: 512)
!493 = !DIEnumerator(name: "GDK_KEY_PRESS_MASK", value: 1024)
!494 = !DIEnumerator(name: "GDK_KEY_RELEASE_MASK", value: 2048)
!495 = !DIEnumerator(name: "GDK_ENTER_NOTIFY_MASK", value: 4096)
!496 = !DIEnumerator(name: "GDK_LEAVE_NOTIFY_MASK", value: 8192)
!497 = !DIEnumerator(name: "GDK_FOCUS_CHANGE_MASK", value: 16384)
!498 = !DIEnumerator(name: "GDK_STRUCTURE_MASK", value: 32768)
!499 = !DIEnumerator(name: "GDK_PROPERTY_CHANGE_MASK", value: 65536)
!500 = !DIEnumerator(name: "GDK_VISIBILITY_NOTIFY_MASK", value: 131072)
!501 = !DIEnumerator(name: "GDK_PROXIMITY_IN_MASK", value: 262144)
!502 = !DIEnumerator(name: "GDK_PROXIMITY_OUT_MASK", value: 524288)
!503 = !DIEnumerator(name: "GDK_SUBSTRUCTURE_MASK", value: 1048576)
!504 = !DIEnumerator(name: "GDK_SCROLL_MASK", value: 2097152)
!505 = !DIEnumerator(name: "GDK_ALL_EVENTS_MASK", value: 4194302)
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !370, line: 92, size: 32, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516}
!508 = !DIEnumerator(name: "GDK_WA_TITLE", value: 2)
!509 = !DIEnumerator(name: "GDK_WA_X", value: 4)
!510 = !DIEnumerator(name: "GDK_WA_Y", value: 8)
!511 = !DIEnumerator(name: "GDK_WA_CURSOR", value: 16)
!512 = !DIEnumerator(name: "GDK_WA_COLORMAP", value: 32)
!513 = !DIEnumerator(name: "GDK_WA_VISUAL", value: 64)
!514 = !DIEnumerator(name: "GDK_WA_WMCLASS", value: 128)
!515 = !DIEnumerator(name: "GDK_WA_NOREDIR", value: 256)
!516 = !DIEnumerator(name: "GDK_WA_TYPE_HINT", value: 512)
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !518, line: 173, size: 32, elements: !519)
!518 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gsignal.h", directory: "/home/sahil/vim/src")
!519 = !{!520, !521, !522, !523, !524, !525}
!520 = !DIEnumerator(name: "G_SIGNAL_MATCH_ID", value: 1)
!521 = !DIEnumerator(name: "G_SIGNAL_MATCH_DETAIL", value: 2)
!522 = !DIEnumerator(name: "G_SIGNAL_MATCH_CLOSURE", value: 4)
!523 = !DIEnumerator(name: "G_SIGNAL_MATCH_FUNC", value: 8)
!524 = !DIEnumerator(name: "G_SIGNAL_MATCH_DATA", value: 16)
!525 = !DIEnumerator(name: "G_SIGNAL_MATCH_UNBLOCKED", value: 32)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !518, line: 155, size: 32, elements: !527)
!527 = !{!528, !529}
!528 = !DIEnumerator(name: "G_CONNECT_AFTER", value: 1)
!529 = !DIEnumerator(name: "G_CONNECT_SWAPPED", value: 2)
!530 = !{!531, !751, !576, !752, !754, !10, !661, !763, !768, !773, !1580, !1635, !791, !8, !1644, !907, !551, !986, !1590, !1645}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWidget", file: !533, line: 69, baseType: !534)
!533 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkstyle.h", directory: "/home/sahil/vim/src")
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWidget", file: !226, line: 530, size: 768, elements: !535)
!535 = !{!536, !568, !571, !574, !575, !579, !732, !738, !747, !750}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !534, file: !226, line: 538, baseType: !537, size: 256)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkObject", file: !7, line: 49, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkObject", file: !539, line: 107, size: 256, elements: !540)
!539 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkobject.h", directory: "/home/sahil/vim/src")
!540 = !{!541, !566}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !538, file: !539, line: 109, baseType: !542, size: 192)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInitiallyUnowned", file: !543, line: 189, baseType: !544)
!543 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gobject.h", directory: "/home/sahil/vim/src")
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GObject", file: !543, line: 245, size: 192, elements: !545)
!545 = !{!546, !556, !561}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "g_type_instance", scope: !544, file: !543, line: 247, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeInstance", file: !9, line: 393, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeInstance", file: !9, line: 418, size: 64, elements: !549)
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "g_class", scope: !548, file: !9, line: 421, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeClass", file: !9, line: 391, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeClass", file: !9, line: 408, size: 64, elements: !554)
!554 = !{!555}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !553, file: !9, line: 411, baseType: !8, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !544, file: !543, line: 250, baseType: !557, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !559, line: 55, baseType: !560)
!559 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/sahil/vim/src")
!560 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !544, file: !543, line: 251, baseType: !562, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !564, line: 36, baseType: !565)
!564 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/sahil/vim/src")
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !564, line: 36, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !538, file: !539, line: 116, baseType: !567, size: 32, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !11, line: 52, baseType: !560)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "private_flags", scope: !534, file: !226, line: 545, baseType: !569, size: 16, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint16", file: !11, line: 44, baseType: !570)
!570 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !534, file: !226, line: 550, baseType: !572, size: 8, offset: 272)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint8", file: !11, line: 41, baseType: !573)
!573 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "saved_state", scope: !534, file: !226, line: 558, baseType: !572, size: 8, offset: 280)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !534, file: !226, line: 566, baseType: !576, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !559, line: 46, baseType: !578)
!578 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !534, file: !226, line: 575, baseType: !580, size: 64, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkStyle", file: !533, line: 54, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkStyle", file: !533, line: 73, size: 7872, elements: !583)
!583 = !{!584, !586, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !612, !615, !616, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !679, !680, !681, !682, !691, !692, !729, !730, !731}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !582, file: !533, line: 75, baseType: !585, size: 192)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "GObject", file: !543, line: 187, baseType: !544)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "fg", scope: !582, file: !533, line: 79, baseType: !587, size: 480, offset: 192)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 480, elements: !596)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkColor", file: !25, line: 102, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkColor", file: !590, line: 46, size: 96, elements: !591)
!590 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkcolor.h", directory: "/home/sahil/vim/src")
!591 = !{!592, !593, !594, !595}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !589, file: !590, line: 48, baseType: !567, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !589, file: !590, line: 49, baseType: !569, size: 16, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !589, file: !590, line: 50, baseType: !569, size: 16, offset: 48)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !589, file: !590, line: 51, baseType: !569, size: 16, offset: 64)
!596 = !{!597}
!597 = !DISubrange(count: 5)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !582, file: !533, line: 80, baseType: !587, size: 480, offset: 672)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "light", scope: !582, file: !533, line: 81, baseType: !587, size: 480, offset: 1152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "dark", scope: !582, file: !533, line: 82, baseType: !587, size: 480, offset: 1632)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !582, file: !533, line: 83, baseType: !587, size: 480, offset: 2112)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !582, file: !533, line: 84, baseType: !587, size: 480, offset: 2592)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !582, file: !533, line: 85, baseType: !587, size: 480, offset: 3072)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "text_aa", scope: !582, file: !533, line: 86, baseType: !587, size: 480, offset: 3552)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !582, file: !533, line: 88, baseType: !588, size: 96, offset: 4032)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !582, file: !533, line: 89, baseType: !588, size: 96, offset: 4128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "font_desc", scope: !582, file: !533, line: 90, baseType: !608, size: 64, offset: 4224)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoFontDescription", file: !610, line: 41, baseType: !611)
!610 = !DIFile(filename: "/usr/include/pango-1.0/pango/pango-font.h", directory: "/home/sahil/vim/src")
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoFontDescription", file: !610, line: 41, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "xthickness", scope: !582, file: !533, line: 92, baseType: !613, size: 32, offset: 4288)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !559, line: 49, baseType: !614)
!614 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ythickness", scope: !582, file: !533, line: 93, baseType: !613, size: 32, offset: 4320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fg_gc", scope: !582, file: !533, line: 95, baseType: !617, size: 320, offset: 4352)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 320, elements: !596)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkGC", file: !25, line: 106, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkGC", file: !621, line: 189, size: 384, elements: !622)
!621 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkgc.h", directory: "/home/sahil/vim/src")
!622 = !{!623, !624, !625, !626, !627, !628}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !620, file: !621, line: 191, baseType: !585, size: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "clip_x_origin", scope: !620, file: !621, line: 193, baseType: !613, size: 32, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "clip_y_origin", scope: !620, file: !621, line: 194, baseType: !613, size: 32, offset: 224)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ts_x_origin", scope: !620, file: !621, line: 195, baseType: !613, size: 32, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ts_y_origin", scope: !620, file: !621, line: 196, baseType: !613, size: 32, offset: 288)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !620, file: !621, line: 198, baseType: !629, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkColormap", file: !25, line: 103, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkColormap", file: !590, line: 68, size: 448, elements: !632)
!632 = !{!633, !634, !635, !637, !659}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !631, file: !590, line: 71, baseType: !585, size: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !631, file: !590, line: 74, baseType: !613, size: 32, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !631, file: !590, line: 75, baseType: !636, size: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !631, file: !590, line: 78, baseType: !638, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisual", file: !25, line: 109, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkVisual", file: !16, line: 77, size: 640, elements: !641)
!641 = !{!642, !643, !645, !646, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !640, file: !16, line: 79, baseType: !585, size: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !640, file: !16, line: 81, baseType: !644, size: 32, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisualType", file: !16, line: 63, baseType: !15)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !640, file: !16, line: 82, baseType: !613, size: 32, offset: 224)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !640, file: !16, line: 83, baseType: !647, size: 32, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkByteOrder", file: !25, line: 122, baseType: !24)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "colormap_size", scope: !640, file: !16, line: 84, baseType: !613, size: 32, offset: 288)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !640, file: !16, line: 85, baseType: !613, size: 32, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !640, file: !16, line: 87, baseType: !567, size: 32, offset: 352)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "red_shift", scope: !640, file: !16, line: 88, baseType: !613, size: 32, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "red_prec", scope: !640, file: !16, line: 89, baseType: !613, size: 32, offset: 416)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !640, file: !16, line: 91, baseType: !567, size: 32, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "green_shift", scope: !640, file: !16, line: 92, baseType: !613, size: 32, offset: 480)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "green_prec", scope: !640, file: !16, line: 93, baseType: !613, size: 32, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !640, file: !16, line: 95, baseType: !567, size: 32, offset: 544)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "blue_shift", scope: !640, file: !16, line: 96, baseType: !613, size: 32, offset: 576)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "blue_prec", scope: !640, file: !16, line: 97, baseType: !613, size: 32, offset: 608)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "windowing_data", scope: !631, file: !590, line: 80, baseType: !660, size: 64, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !559, line: 103, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "bg_gc", scope: !582, file: !533, line: 96, baseType: !617, size: 320, offset: 4672)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "light_gc", scope: !582, file: !533, line: 97, baseType: !617, size: 320, offset: 4992)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dark_gc", scope: !582, file: !533, line: 98, baseType: !617, size: 320, offset: 5312)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mid_gc", scope: !582, file: !533, line: 99, baseType: !617, size: 320, offset: 5632)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "text_gc", scope: !582, file: !533, line: 100, baseType: !617, size: 320, offset: 5952)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "base_gc", scope: !582, file: !533, line: 101, baseType: !617, size: 320, offset: 6272)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "text_aa_gc", scope: !582, file: !533, line: 102, baseType: !617, size: 320, offset: 6592)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "black_gc", scope: !582, file: !533, line: 103, baseType: !618, size: 64, offset: 6912)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "white_gc", scope: !582, file: !533, line: 104, baseType: !618, size: 64, offset: 6976)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "bg_pixmap", scope: !582, file: !533, line: 106, baseType: !672, size: 320, offset: 7040)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 320, elements: !596)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkPixmap", file: !25, line: 113, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDrawable", file: !676, line: 53, size: 192, elements: !677)
!676 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkdrawable.h", directory: "/home/sahil/vim/src")
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !675, file: !676, line: 55, baseType: !585, size: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "attach_count", scope: !582, file: !533, line: 110, baseType: !613, size: 32, offset: 7360)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !582, file: !533, line: 112, baseType: !613, size: 32, offset: 7392)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !582, file: !533, line: 113, baseType: !629, size: 64, offset: 7424)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "private_font", scope: !582, file: !533, line: 114, baseType: !683, size: 64, offset: 7488)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkFont", file: !25, line: 105, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkFont", file: !30, line: 49, size: 96, elements: !686)
!686 = !{!687, !689, !690}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !685, file: !30, line: 51, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkFontType", file: !30, line: 47, baseType: !29)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !685, file: !30, line: 52, baseType: !613, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !685, file: !30, line: 53, baseType: !613, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "private_font_desc", scope: !582, file: !533, line: 115, baseType: !608, size: 64, offset: 7552)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rc_style", scope: !582, file: !533, line: 118, baseType: !693, size: 64, offset: 7616)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRcStyle", file: !533, line: 57, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkRcStyle", file: !35, line: 60, size: 3072, elements: !696)
!696 = !{!697, !698, !699, !701, !702, !705, !706, !707, !708, !709, !710, !711, !719, !727, !728}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !695, file: !35, line: 62, baseType: !585, size: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !695, file: !35, line: 66, baseType: !576, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bg_pixmap_name", scope: !695, file: !35, line: 67, baseType: !700, size: 320, offset: 256)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 320, elements: !596)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "font_desc", scope: !695, file: !35, line: 68, baseType: !608, size: 64, offset: 576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "color_flags", scope: !695, file: !35, line: 70, baseType: !703, size: 160, offset: 640)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 160, elements: !596)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRcFlags", file: !35, line: 58, baseType: !34)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fg", scope: !695, file: !35, line: 71, baseType: !587, size: 480, offset: 800)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !695, file: !35, line: 72, baseType: !587, size: 480, offset: 1280)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !695, file: !35, line: 73, baseType: !587, size: 480, offset: 1760)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !695, file: !35, line: 74, baseType: !587, size: 480, offset: 2240)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "xthickness", scope: !695, file: !35, line: 76, baseType: !613, size: 32, offset: 2720)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ythickness", scope: !695, file: !35, line: 77, baseType: !613, size: 32, offset: 2752)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "rc_properties", scope: !695, file: !35, line: 80, baseType: !712, size: 64, offset: 2816)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !714, line: 37, baseType: !715)
!714 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/sahil/vim/src")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !714, line: 41, size: 128, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !715, file: !714, line: 43, baseType: !576, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !715, file: !714, line: 44, baseType: !558, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "rc_style_lists", scope: !695, file: !35, line: 83, baseType: !720, size: 64, offset: 2880)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !722, line: 37, baseType: !723)
!722 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/sahil/vim/src")
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !722, line: 39, size: 128, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !723, file: !722, line: 41, baseType: !660, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !723, file: !722, line: 42, baseType: !720, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "icon_factories", scope: !695, file: !35, line: 85, baseType: !720, size: 64, offset: 2944)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "engine_specified", scope: !695, file: !35, line: 87, baseType: !558, size: 1, offset: 3008, flags: DIFlagBitField, extraData: i64 3008)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "styles", scope: !582, file: !533, line: 120, baseType: !720, size: 64, offset: 7680)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "property_cache", scope: !582, file: !533, line: 121, baseType: !712, size: 64, offset: 7744)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "icon_factories", scope: !582, file: !533, line: 122, baseType: !720, size: 64, offset: 7808)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "requisition", scope: !534, file: !226, line: 579, baseType: !733, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRequisition", file: !226, line: 478, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkRequisition", file: !226, line: 519, size: 64, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !734, file: !226, line: 521, baseType: !613, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !734, file: !226, line: 522, baseType: !613, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "allocation", scope: !534, file: !226, line: 583, baseType: !739, size: 128, offset: 512)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkAllocation", file: !226, line: 498, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkRectangle", file: !25, line: 69, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkRectangle", file: !25, line: 200, size: 128, elements: !742)
!742 = !{!743, !744, !745, !746}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !741, file: !25, line: 202, baseType: !613, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !741, file: !25, line: 203, baseType: !613, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !741, file: !25, line: 204, baseType: !613, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !741, file: !25, line: 205, baseType: !613, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !534, file: !226, line: 589, baseType: !748, size: 64, offset: 640)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkWindow", file: !25, line: 114, baseType: !675)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !534, file: !226, line: 593, baseType: !531, size: 64, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkFormChild", file: !3, line: 39, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkFormChild", file: !3, line: 41, size: 256, elements: !757)
!757 = !{!758, !759, !760, !761, !762}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "widget", scope: !756, file: !3, line: 43, baseType: !531, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !756, file: !3, line: 44, baseType: !748, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !756, file: !3, line: 45, baseType: !613, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !756, file: !3, line: 46, baseType: !613, size: 32, offset: 160)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !756, file: !3, line: 47, baseType: !613, size: 32, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkClassInitFunc", file: !7, line: 122, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "GBaseInitFunc", file: !9, line: 772, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !660}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkObjectInitFunc", file: !7, line: 123, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInstanceInitFunc", file: !9, line: 920, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !751, !660}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWidgetClass", file: !226, line: 480, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWidgetClass", file: !226, line: 614, size: 5760, elements: !776)
!776 = !{!777, !918, !919, !920, !924, !928, !929, !930, !931, !932, !933, !934, !935, !940, !945, !950, !954, !955, !959, !964, !968, !972, !976, !977, !982, !1303, !1308, !1309, !1314, !1319, !1324, !1325, !1330, !1335, !1336, !1341, !1342, !1347, !1352, !1353, !1354, !1355, !1360, !1365, !1366, !1367, !1372, !1373, !1378, !1383, !1384, !1389, !1489, !1493, !1497, !1498, !1502, !1503, !1507, !1511, !1512, !1516, !1520, !1525, !1556, !1560, !1564, !1569, !1570, !1577, !1578, !1579}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "parent_class", scope: !775, file: !226, line: 622, baseType: !778, size: 1280)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkObjectClass", file: !539, line: 104, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkObjectClass", file: !539, line: 119, size: 1280, elements: !780)
!780 = !{!781, !875, !913, !914}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "parent_class", scope: !779, file: !539, line: 121, baseType: !782, size: 1088)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInitiallyUnownedClass", file: !543, line: 190, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GObjectClass", file: !543, line: 315, size: 1088, elements: !784)
!784 = !{!785, !786, !787, !845, !851, !855, !859, !860, !865, !869, !870, !871}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "g_type_class", scope: !783, file: !543, line: 317, baseType: !552, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "construct_properties", scope: !783, file: !543, line: 320, baseType: !720, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !783, file: !543, line: 324, baseType: !788, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!791, !8, !558, !792}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "GObjectConstructParam", file: !543, line: 191, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GObjectConstructParam", file: !543, line: 364, size: 128, elements: !795)
!795 = !{!796, !814}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pspec", scope: !794, file: !543, line: 366, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "GParamSpec", file: !42, line: 192, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GParamSpec", file: !42, line: 207, size: 576, elements: !800)
!800 = !{!801, !802, !805, !807, !808, !809, !810, !811, !812, !813}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "g_type_instance", scope: !799, file: !42, line: 209, baseType: !547, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !799, file: !42, line: 211, baseType: !803, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !799, file: !42, line: 212, baseType: !806, size: 32, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "GParamFlags", file: !42, line: 166, baseType: !41)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "value_type", scope: !799, file: !42, line: 213, baseType: !8, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "owner_type", scope: !799, file: !42, line: 214, baseType: !8, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_nick", scope: !799, file: !42, line: 217, baseType: !576, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_blurb", scope: !799, file: !42, line: 218, baseType: !576, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !799, file: !42, line: 219, baseType: !562, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !799, file: !42, line: 220, baseType: !558, size: 32, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "param_id", scope: !799, file: !42, line: 221, baseType: !558, size: 32, offset: 544)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !794, file: !543, line: 367, baseType: !815, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "GValue", file: !9, line: 388, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GValue", file: !818, line: 108, size: 192, elements: !819)
!818 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gvalue.h", directory: "/home/sahil/vim/src")
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !817, file: !818, line: 111, baseType: !8, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !817, file: !818, line: 124, baseType: !822, size: 128, offset: 64)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 128, elements: !843)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !817, file: !818, line: 114, size: 64, elements: !824)
!824 = !{!825, !826, !827, !830, !832, !834, !836, !839, !842}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "v_int", scope: !823, file: !818, line: 115, baseType: !613, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "v_uint", scope: !823, file: !818, line: 116, baseType: !558, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "v_long", scope: !823, file: !818, line: 117, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !559, line: 48, baseType: !829)
!829 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "v_ulong", scope: !823, file: !818, line: 118, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !559, line: 54, baseType: !12)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "v_int64", scope: !823, file: !818, line: 119, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !11, line: 61, baseType: !829)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "v_uint64", scope: !823, file: !818, line: 120, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !11, line: 62, baseType: !12)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !823, file: !818, line: 121, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfloat", file: !559, line: 57, baseType: !838)
!838 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "v_double", scope: !823, file: !818, line: 122, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !559, line: 58, baseType: !841)
!841 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "v_pointer", scope: !823, file: !818, line: 123, baseType: !660, size: 64)
!843 = !{!844}
!844 = !DISubrange(count: 2)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "set_property", scope: !783, file: !543, line: 328, baseType: !846, size: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !791, !558, !849, !797}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !816)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "get_property", scope: !783, file: !543, line: 332, baseType: !852, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !791, !558, !815, !797}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !783, file: !543, line: 336, baseType: !856, size: 64, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !791}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !783, file: !543, line: 337, baseType: !856, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch_properties_changed", scope: !783, file: !543, line: 339, baseType: !861, size: 64, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !791, !558, !864}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !783, file: !543, line: 343, baseType: !866, size: 64, offset: 512)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !791, !797}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "constructed", scope: !783, file: !543, line: 347, baseType: !856, size: 64, offset: 576)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !783, file: !543, line: 350, baseType: !10, size: 64, offset: 640)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "pdummy", scope: !783, file: !543, line: 353, baseType: !872, size: 384, offset: 704)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 384, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 6)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "set_arg", scope: !779, file: !539, line: 124, baseType: !876, size: 64, offset: 1088)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !879, !880, !558}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkArg", file: !7, line: 48, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkArg", file: !7, line: 138, size: 256, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !882, file: !7, line: 140, baseType: !8, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !882, file: !7, line: 141, baseType: !576, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !882, file: !7, line: 169, baseType: !887, size: 128, offset: 128)
!887 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !882, file: !7, line: 149, size: 128, elements: !888)
!888 = !{!889, !890, !892, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "char_data", scope: !887, file: !7, line: 151, baseType: !577, size: 8)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "uchar_data", scope: !887, file: !7, line: 152, baseType: !891, size: 8)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "guchar", file: !559, line: 52, baseType: !573)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "bool_data", scope: !887, file: !7, line: 153, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !559, line: 50, baseType: !613)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "int_data", scope: !887, file: !7, line: 154, baseType: !613, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "uint_data", scope: !887, file: !7, line: 155, baseType: !558, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "long_data", scope: !887, file: !7, line: 156, baseType: !828, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ulong_data", scope: !887, file: !7, line: 157, baseType: !831, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "float_data", scope: !887, file: !7, line: 158, baseType: !837, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "double_data", scope: !887, file: !7, line: 159, baseType: !840, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "string_data", scope: !887, file: !7, line: 160, baseType: !576, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "object_data", scope: !887, file: !7, line: 161, baseType: !879, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_data", scope: !887, file: !7, line: 162, baseType: !660, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "signal_data", scope: !887, file: !7, line: 168, baseType: !904, size: 128)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !7, line: 165, size: 128, elements: !905)
!905 = !{!906, !912}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !904, file: !7, line: 166, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCallback", file: !908, line: 86, baseType: !909)
!908 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gclosure.h", directory: "/home/sahil/vim/src")
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{null}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !904, file: !7, line: 167, baseType: !660, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "get_arg", scope: !779, file: !539, line: 127, baseType: !876, size: 64, offset: 1152)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !779, file: !539, line: 139, baseType: !915, size: 64, offset: 1216)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !879}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "activate_signal", scope: !775, file: !226, line: 626, baseType: !558, size: 32, offset: 1280)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "set_scroll_adjustments_signal", scope: !775, file: !226, line: 628, baseType: !558, size: 32, offset: 1312)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch_child_properties_changed", scope: !775, file: !226, line: 633, baseType: !921, size: 64, offset: 1344)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !531, !558, !864}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !775, file: !226, line: 638, baseType: !925, size: 64, offset: 1408)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !531}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "show_all", scope: !775, file: !226, line: 639, baseType: !925, size: 64, offset: 1472)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !775, file: !226, line: 640, baseType: !925, size: 64, offset: 1536)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "hide_all", scope: !775, file: !226, line: 641, baseType: !925, size: 64, offset: 1600)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !775, file: !226, line: 642, baseType: !925, size: 64, offset: 1664)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "unmap", scope: !775, file: !226, line: 643, baseType: !925, size: 64, offset: 1728)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "realize", scope: !775, file: !226, line: 644, baseType: !925, size: 64, offset: 1792)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "unrealize", scope: !775, file: !226, line: 645, baseType: !925, size: 64, offset: 1856)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "size_request", scope: !775, file: !226, line: 646, baseType: !936, size: 64, offset: 1920)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !531, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "size_allocate", scope: !775, file: !226, line: 648, baseType: !941, size: 64, offset: 1984)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !531, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "state_changed", scope: !775, file: !226, line: 650, baseType: !946, size: 64, offset: 2048)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !531, !949}
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkStateType", file: !57, line: 406, baseType: !56)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "parent_set", scope: !775, file: !226, line: 652, baseType: !951, size: 64, offset: 2112)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !531, !531}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "hierarchy_changed", scope: !775, file: !226, line: 654, baseType: !951, size: 64, offset: 2176)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "style_set", scope: !775, file: !226, line: 656, baseType: !956, size: 64, offset: 2240)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !531, !580}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "direction_changed", scope: !775, file: !226, line: 658, baseType: !960, size: 64, offset: 2304)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{null, !531, !963}
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkTextDirection", file: !57, line: 178, baseType: !64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "grab_notify", scope: !775, file: !226, line: 660, baseType: !965, size: 64, offset: 2368)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !531, !893}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "child_notify", scope: !775, file: !226, line: 662, baseType: !969, size: 64, offset: 2432)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !531, !797}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_activate", scope: !775, file: !226, line: 666, baseType: !973, size: 64, offset: 2496)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!893, !531, !893}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "grab_focus", scope: !775, file: !226, line: 670, baseType: !925, size: 64, offset: 2560)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "focus", scope: !775, file: !226, line: 671, baseType: !978, size: 64, offset: 2624)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!893, !531, !981}
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkDirectionType", file: !57, line: 130, baseType: !69)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !775, file: !226, line: 675, baseType: !983, size: 64, offset: 2688)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!893, !531, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEvent", file: !78, line: 68, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GdkEvent", file: !78, line: 491, size: 704, elements: !989)
!989 = !{!990, !992, !1001, !1014, !1021, !1030, !1079, !1095, !1111, !1126, !1145, !1153, !1164, !1177, !1190, !1203, !1212, !1235, !1272, !1282, !1293}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !988, file: !78, line: 493, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventType", file: !78, line: 156, baseType: !77)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !988, file: !78, line: 494, baseType: !993, size: 192)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventAny", file: !78, line: 47, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventAny", file: !78, line: 266, size: 192, elements: !995)
!995 = !{!996, !997, !998}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !994, file: !78, line: 268, baseType: !991, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !994, file: !78, line: 269, baseType: !748, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !994, file: !78, line: 270, baseType: !999, size: 8, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint8", file: !11, line: 40, baseType: !1000)
!1000 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "expose", scope: !988, file: !78, line: 495, baseType: !1002, size: 448)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventExpose", file: !78, line: 48, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventExpose", file: !78, line: 273, size: 448, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1013}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1003, file: !78, line: 275, baseType: !991, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1003, file: !78, line: 276, baseType: !748, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1003, file: !78, line: 277, baseType: !999, size: 8, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !1003, file: !78, line: 278, baseType: !740, size: 128, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1003, file: !78, line: 279, baseType: !1010, size: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkRegion", file: !25, line: 108, baseType: !1012)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkRegion", file: !25, line: 108, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1003, file: !78, line: 280, baseType: !613, size: 32, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "no_expose", scope: !988, file: !78, line: 496, baseType: !1015, size: 192)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventNoExpose", file: !78, line: 49, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventNoExpose", file: !78, line: 283, size: 192, elements: !1017)
!1017 = !{!1018, !1019, !1020}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1016, file: !78, line: 285, baseType: !991, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1016, file: !78, line: 286, baseType: !748, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1016, file: !78, line: 287, baseType: !999, size: 8, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !988, file: !78, line: 497, baseType: !1022, size: 192)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventVisibility", file: !78, line: 50, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventVisibility", file: !78, line: 290, size: 192, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1023, file: !78, line: 292, baseType: !991, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1023, file: !78, line: 293, baseType: !748, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1023, file: !78, line: 294, baseType: !999, size: 8, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1023, file: !78, line: 295, baseType: !1029, size: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisibilityState", file: !78, line: 192, baseType: !119)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !988, file: !78, line: 498, baseType: !1031, size: 640)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventMotion", file: !78, line: 51, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventMotion", file: !78, line: 298, size: 640, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038, !1039, !1040, !1042, !1043, !1046, !1077, !1078}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1032, file: !78, line: 300, baseType: !991, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1032, file: !78, line: 301, baseType: !748, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1032, file: !78, line: 302, baseType: !999, size: 8, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1032, file: !78, line: 303, baseType: !567, size: 32, offset: 160)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1032, file: !78, line: 304, baseType: !840, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1032, file: !78, line: 305, baseType: !840, size: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "axes", scope: !1032, file: !78, line: 306, baseType: !1041, size: 64, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1032, file: !78, line: 307, baseType: !558, size: 32, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "is_hint", scope: !1032, file: !78, line: 308, baseType: !1044, size: 16, offset: 416)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint16", file: !11, line: 43, baseType: !1045)
!1045 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !1032, file: !78, line: 309, baseType: !1047, size: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDevice", file: !125, line: 47, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDevice", file: !125, line: 98, size: 576, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1055, !1057, !1058, !1059, !1068, !1069}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1049, file: !125, line: 100, baseType: !585, size: 192)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1049, file: !125, line: 103, baseType: !576, size: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1049, file: !125, line: 104, baseType: !1054, size: 32, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkInputSource", file: !125, line: 64, baseType: !124)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1049, file: !125, line: 105, baseType: !1056, size: 32, offset: 288)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkInputMode", file: !125, line: 71, baseType: !131)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "has_cursor", scope: !1049, file: !125, line: 106, baseType: !893, size: 32, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "num_axes", scope: !1049, file: !125, line: 108, baseType: !613, size: 32, offset: 352)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "axes", scope: !1049, file: !125, line: 109, baseType: !1060, size: 64, offset: 384)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDeviceAxis", file: !125, line: 46, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDeviceAxis", file: !125, line: 91, size: 192, elements: !1063)
!1063 = !{!1064, !1066, !1067}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1062, file: !125, line: 93, baseType: !1065, size: 32)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkAxisUse", file: !125, line: 83, baseType: !136)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1062, file: !125, line: 94, baseType: !840, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1062, file: !125, line: 95, baseType: !840, size: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "num_keys", scope: !1049, file: !125, line: 111, baseType: !613, size: 32, offset: 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1049, file: !125, line: 112, baseType: !1070, size: 64, offset: 512)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDeviceKey", file: !125, line: 45, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDeviceKey", file: !125, line: 85, size: 64, elements: !1073)
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "keyval", scope: !1072, file: !125, line: 87, baseType: !558, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1072, file: !125, line: 88, baseType: !1076, size: 32, offset: 32)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkModifierType", file: !25, line: 153, baseType: !146)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1032, file: !78, line: 310, baseType: !840, size: 64, offset: 512)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1032, file: !78, line: 310, baseType: !840, size: 64, offset: 576)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !988, file: !78, line: 499, baseType: !1080, size: 640)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventButton", file: !78, line: 52, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventButton", file: !78, line: 313, size: 640, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1081, file: !78, line: 315, baseType: !991, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1081, file: !78, line: 316, baseType: !748, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1081, file: !78, line: 317, baseType: !999, size: 8, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1081, file: !78, line: 318, baseType: !567, size: 32, offset: 160)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1081, file: !78, line: 319, baseType: !840, size: 64, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1081, file: !78, line: 320, baseType: !840, size: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "axes", scope: !1081, file: !78, line: 321, baseType: !1041, size: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1081, file: !78, line: 322, baseType: !558, size: 32, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !1081, file: !78, line: 323, baseType: !558, size: 32, offset: 416)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !1081, file: !78, line: 324, baseType: !1047, size: 64, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1081, file: !78, line: 325, baseType: !840, size: 64, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1081, file: !78, line: 325, baseType: !840, size: 64, offset: 576)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !988, file: !78, line: 500, baseType: !1096, size: 576)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventScroll", file: !78, line: 53, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventScroll", file: !78, line: 328, size: 576, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1108, !1109, !1110}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1097, file: !78, line: 330, baseType: !991, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1097, file: !78, line: 331, baseType: !748, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1097, file: !78, line: 332, baseType: !999, size: 8, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1097, file: !78, line: 333, baseType: !567, size: 32, offset: 160)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1097, file: !78, line: 334, baseType: !840, size: 64, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1097, file: !78, line: 335, baseType: !840, size: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1097, file: !78, line: 336, baseType: !558, size: 32, offset: 320)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1097, file: !78, line: 337, baseType: !1107, size: 32, offset: 352)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkScrollDirection", file: !78, line: 200, baseType: !166)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !1097, file: !78, line: 338, baseType: !1047, size: 64, offset: 384)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1097, file: !78, line: 339, baseType: !840, size: 64, offset: 448)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1097, file: !78, line: 339, baseType: !840, size: 64, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !988, file: !78, line: 501, baseType: !1112, size: 448)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventKey", file: !78, line: 54, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventKey", file: !78, line: 342, size: 448, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1113, file: !78, line: 344, baseType: !991, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1113, file: !78, line: 345, baseType: !748, size: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1113, file: !78, line: 346, baseType: !999, size: 8, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1113, file: !78, line: 347, baseType: !567, size: 32, offset: 160)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1113, file: !78, line: 348, baseType: !558, size: 32, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "keyval", scope: !1113, file: !78, line: 349, baseType: !558, size: 32, offset: 224)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1113, file: !78, line: 350, baseType: !613, size: 32, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1113, file: !78, line: 351, baseType: !576, size: 64, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "hardware_keycode", scope: !1113, file: !78, line: 352, baseType: !569, size: 16, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1113, file: !78, line: 353, baseType: !572, size: 8, offset: 400)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "is_modifier", scope: !1113, file: !78, line: 354, baseType: !558, size: 1, offset: 408, flags: DIFlagBitField, extraData: i64 408)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "crossing", scope: !988, file: !78, line: 502, baseType: !1127, size: 704)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventCrossing", file: !78, line: 56, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventCrossing", file: !78, line: 357, size: 704, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1141, !1143, !1144}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1128, file: !78, line: 359, baseType: !991, size: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1128, file: !78, line: 360, baseType: !748, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1128, file: !78, line: 361, baseType: !999, size: 8, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1128, file: !78, line: 362, baseType: !748, size: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1128, file: !78, line: 363, baseType: !567, size: 32, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1128, file: !78, line: 364, baseType: !840, size: 64, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1128, file: !78, line: 365, baseType: !840, size: 64, offset: 384)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1128, file: !78, line: 366, baseType: !840, size: 64, offset: 448)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1128, file: !78, line: 367, baseType: !840, size: 64, offset: 512)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1128, file: !78, line: 368, baseType: !1140, size: 32, offset: 576)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkCrossingMode", file: !78, line: 233, baseType: !172)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !1128, file: !78, line: 369, baseType: !1142, size: 32, offset: 608)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkNotifyType", file: !78, line: 218, baseType: !180)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "focus", scope: !1128, file: !78, line: 370, baseType: !893, size: 32, offset: 640)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1128, file: !78, line: 371, baseType: !558, size: 32, offset: 672)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "focus_change", scope: !988, file: !78, line: 503, baseType: !1146, size: 192)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventFocus", file: !78, line: 55, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventFocus", file: !78, line: 374, size: 192, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1147, file: !78, line: 376, baseType: !991, size: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1147, file: !78, line: 377, baseType: !748, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1147, file: !78, line: 378, baseType: !999, size: 8, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1147, file: !78, line: 379, baseType: !1044, size: 16, offset: 144)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !988, file: !78, line: 504, baseType: !1154, size: 320)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventConfigure", file: !78, line: 57, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventConfigure", file: !78, line: 382, size: 320, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1160, !1161, !1162, !1163}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1155, file: !78, line: 384, baseType: !991, size: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1155, file: !78, line: 385, baseType: !748, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1155, file: !78, line: 386, baseType: !999, size: 8, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1155, file: !78, line: 387, baseType: !613, size: 32, offset: 160)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1155, file: !78, line: 387, baseType: !613, size: 32, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1155, file: !78, line: 388, baseType: !613, size: 32, offset: 224)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1155, file: !78, line: 389, baseType: !613, size: 32, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !988, file: !78, line: 505, baseType: !1165, size: 320)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventProperty", file: !78, line: 58, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventProperty", file: !78, line: 392, size: 320, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1175, !1176}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1166, file: !78, line: 394, baseType: !991, size: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1166, file: !78, line: 395, baseType: !748, size: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1166, file: !78, line: 396, baseType: !999, size: 8, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !1166, file: !78, line: 397, baseType: !1172, size: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkAtom", file: !25, line: 80, baseType: !1173)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkAtom", file: !25, line: 80, flags: DIFlagFwdDecl)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1166, file: !78, line: 398, baseType: !567, size: 32, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1166, file: !78, line: 399, baseType: !558, size: 32, offset: 288)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !988, file: !78, line: 506, baseType: !1178, size: 448)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventSelection", file: !78, line: 59, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventSelection", file: !78, line: 402, size: 448, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1179, file: !78, line: 404, baseType: !991, size: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1179, file: !78, line: 405, baseType: !748, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1179, file: !78, line: 406, baseType: !999, size: 8, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !1179, file: !78, line: 407, baseType: !1172, size: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1179, file: !78, line: 408, baseType: !1172, size: 64, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !1179, file: !78, line: 409, baseType: !1172, size: 64, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1179, file: !78, line: 410, baseType: !567, size: 32, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !1179, file: !78, line: 411, baseType: !1189, size: 32, offset: 416)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkNativeWindow", file: !25, line: 97, baseType: !567)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "owner_change", scope: !988, file: !78, line: 507, baseType: !1191, size: 384)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventOwnerChange", file: !78, line: 60, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventOwnerChange", file: !78, line: 414, size: 384, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1198, !1200, !1201, !1202}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1192, file: !78, line: 416, baseType: !991, size: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1192, file: !78, line: 417, baseType: !748, size: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1192, file: !78, line: 418, baseType: !999, size: 8, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1192, file: !78, line: 419, baseType: !1189, size: 32, offset: 160)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !1192, file: !78, line: 420, baseType: !1199, size: 32, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkOwnerChange", file: !78, line: 264, baseType: !188)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !1192, file: !78, line: 421, baseType: !1172, size: 64, offset: 256)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1192, file: !78, line: 422, baseType: !567, size: 32, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "selection_time", scope: !1192, file: !78, line: 423, baseType: !567, size: 32, offset: 352)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "proximity", scope: !988, file: !78, line: 508, baseType: !1204, size: 256)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventProximity", file: !78, line: 61, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventProximity", file: !78, line: 429, size: 256, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1210, !1211}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1205, file: !78, line: 431, baseType: !991, size: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1205, file: !78, line: 432, baseType: !748, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1205, file: !78, line: 433, baseType: !999, size: 8, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1205, file: !78, line: 434, baseType: !567, size: 32, offset: 160)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !1205, file: !78, line: 435, baseType: !1047, size: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !988, file: !78, line: 509, baseType: !1213, size: 640)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventClient", file: !78, line: 62, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventClient", file: !78, line: 438, size: 640, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219, !1220, !1222}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1214, file: !78, line: 440, baseType: !991, size: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1214, file: !78, line: 441, baseType: !748, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1214, file: !78, line: 442, baseType: !999, size: 8, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !1214, file: !78, line: 443, baseType: !1172, size: 64, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "data_format", scope: !1214, file: !78, line: 444, baseType: !1221, size: 16, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "gushort", file: !559, line: 53, baseType: !570)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1214, file: !78, line: 449, baseType: !1223, size: 320, offset: 320)
!1223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1214, file: !78, line: 445, size: 320, elements: !1224)
!1224 = !{!1225, !1229, !1233}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1223, file: !78, line: 446, baseType: !1226, size: 160)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 160, elements: !1227)
!1227 = !{!1228}
!1228 = !DISubrange(count: 20)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !1223, file: !78, line: 447, baseType: !1230, size: 160)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 160, elements: !1231)
!1231 = !{!1232}
!1232 = !DISubrange(count: 10)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1223, file: !78, line: 448, baseType: !1234, size: 320)
!1234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 320, elements: !596)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "dnd", scope: !988, file: !78, line: 510, baseType: !1236, size: 320)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventDND", file: !78, line: 63, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventDND", file: !78, line: 481, size: 320, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1268, !1269, !1271}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1237, file: !78, line: 482, baseType: !991, size: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1237, file: !78, line: 483, baseType: !748, size: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1237, file: !78, line: 484, baseType: !999, size: 8, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1237, file: !78, line: 485, baseType: !1243, size: 64, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDragContext", file: !194, line: 38, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDragContext", file: !194, line: 75, size: 640, elements: !1246)
!1246 = !{!1247, !1248, !1250, !1251, !1252, !1253, !1262, !1264, !1265, !1266, !1267}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1245, file: !194, line: 76, baseType: !585, size: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !1245, file: !194, line: 80, baseType: !1249, size: 32, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDragProtocol", file: !194, line: 60, baseType: !193)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "is_source", scope: !1245, file: !194, line: 82, baseType: !893, size: 32, offset: 224)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "source_window", scope: !1245, file: !194, line: 84, baseType: !748, size: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "dest_window", scope: !1245, file: !194, line: 85, baseType: !748, size: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "targets", scope: !1245, file: !194, line: 87, baseType: !1254, size: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !1256, line: 37, baseType: !1257)
!1256 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/sahil/vim/src")
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !1256, line: 39, size: 192, elements: !1258)
!1258 = !{!1259, !1260, !1261}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1257, file: !1256, line: 41, baseType: !660, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1257, file: !1256, line: 42, baseType: !1254, size: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1257, file: !1256, line: 43, baseType: !1254, size: 64, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "actions", scope: !1245, file: !194, line: 88, baseType: !1263, size: 32, offset: 448)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDragAction", file: !194, line: 48, baseType: !203)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "suggested_action", scope: !1245, file: !194, line: 89, baseType: !1263, size: 32, offset: 480)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1245, file: !194, line: 90, baseType: !1263, size: 32, offset: 512)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !1245, file: !194, line: 92, baseType: !567, size: 32, offset: 544)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "windowing_data", scope: !1245, file: !194, line: 96, baseType: !660, size: 64, offset: 576)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1237, file: !78, line: 487, baseType: !567, size: 32, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1237, file: !78, line: 488, baseType: !1270, size: 16, offset: 288)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "gshort", file: !559, line: 47, baseType: !1045)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1237, file: !78, line: 488, baseType: !1270, size: 16, offset: 304)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "window_state", scope: !988, file: !78, line: 511, baseType: !1273, size: 256)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventWindowState", file: !78, line: 64, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventWindowState", file: !78, line: 461, size: 256, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1281}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1274, file: !78, line: 463, baseType: !991, size: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1274, file: !78, line: 464, baseType: !748, size: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1274, file: !78, line: 465, baseType: !999, size: 8, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "changed_mask", scope: !1274, file: !78, line: 466, baseType: !1280, size: 32, offset: 160)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkWindowState", file: !78, line: 250, baseType: !211)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "new_window_state", scope: !1274, file: !78, line: 467, baseType: !1280, size: 32, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "setting", scope: !988, file: !78, line: 512, baseType: !1283, size: 256)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventSetting", file: !78, line: 65, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventSetting", file: !78, line: 452, size: 256, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1291}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1284, file: !78, line: 454, baseType: !991, size: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1284, file: !78, line: 455, baseType: !748, size: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1284, file: !78, line: 456, baseType: !999, size: 8, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1284, file: !78, line: 457, baseType: !1290, size: 32, offset: 160)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkSettingAction", file: !78, line: 257, baseType: !220)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1284, file: !78, line: 458, baseType: !1292, size: 64, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "grab_broken", scope: !988, file: !78, line: 513, baseType: !1294, size: 320)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventGrabBroken", file: !78, line: 66, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventGrabBroken", file: !78, line: 470, size: 320, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300, !1301, !1302}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1295, file: !78, line: 471, baseType: !991, size: 32)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1295, file: !78, line: 472, baseType: !748, size: 64, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1295, file: !78, line: 473, baseType: !999, size: 8, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !1295, file: !78, line: 474, baseType: !893, size: 32, offset: 160)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !1295, file: !78, line: 475, baseType: !893, size: 32, offset: 192)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "grab_window", scope: !1295, file: !78, line: 476, baseType: !748, size: 64, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "button_press_event", scope: !775, file: !226, line: 677, baseType: !1304, size: 64, offset: 2752)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!893, !531, !1307}
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "button_release_event", scope: !775, file: !226, line: 679, baseType: !1304, size: 64, offset: 2816)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_event", scope: !775, file: !226, line: 681, baseType: !1310, size: 64, offset: 2880)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!893, !531, !1313}
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "motion_notify_event", scope: !775, file: !226, line: 683, baseType: !1315, size: 64, offset: 2944)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!893, !531, !1318}
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "delete_event", scope: !775, file: !226, line: 685, baseType: !1320, size: 64, offset: 3008)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!893, !531, !1323}
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_event", scope: !775, file: !226, line: 687, baseType: !1320, size: 64, offset: 3072)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "expose_event", scope: !775, file: !226, line: 689, baseType: !1326, size: 64, offset: 3136)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!893, !531, !1329}
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "key_press_event", scope: !775, file: !226, line: 691, baseType: !1331, size: 64, offset: 3200)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!893, !531, !1334}
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "key_release_event", scope: !775, file: !226, line: 693, baseType: !1331, size: 64, offset: 3264)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "enter_notify_event", scope: !775, file: !226, line: 695, baseType: !1337, size: 64, offset: 3328)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!893, !531, !1340}
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "leave_notify_event", scope: !775, file: !226, line: 697, baseType: !1337, size: 64, offset: 3392)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "configure_event", scope: !775, file: !226, line: 699, baseType: !1343, size: 64, offset: 3456)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!893, !531, !1346}
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "focus_in_event", scope: !775, file: !226, line: 701, baseType: !1348, size: 64, offset: 3520)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!893, !531, !1351}
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "focus_out_event", scope: !775, file: !226, line: 703, baseType: !1348, size: 64, offset: 3584)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "map_event", scope: !775, file: !226, line: 705, baseType: !1320, size: 64, offset: 3648)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "unmap_event", scope: !775, file: !226, line: 707, baseType: !1320, size: 64, offset: 3712)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "property_notify_event", scope: !775, file: !226, line: 709, baseType: !1356, size: 64, offset: 3776)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!893, !531, !1359}
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "selection_clear_event", scope: !775, file: !226, line: 711, baseType: !1361, size: 64, offset: 3840)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!893, !531, !1364}
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "selection_request_event", scope: !775, file: !226, line: 713, baseType: !1361, size: 64, offset: 3904)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "selection_notify_event", scope: !775, file: !226, line: 715, baseType: !1361, size: 64, offset: 3968)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "proximity_in_event", scope: !775, file: !226, line: 717, baseType: !1368, size: 64, offset: 4032)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{!893, !531, !1371}
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "proximity_out_event", scope: !775, file: !226, line: 719, baseType: !1368, size: 64, offset: 4096)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_notify_event", scope: !775, file: !226, line: 721, baseType: !1374, size: 64, offset: 4160)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!893, !531, !1377}
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "client_event", scope: !775, file: !226, line: 723, baseType: !1379, size: 64, offset: 4224)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{!893, !531, !1382}
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "no_expose_event", scope: !775, file: !226, line: 725, baseType: !1320, size: 64, offset: 4288)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "window_state_event", scope: !775, file: !226, line: 727, baseType: !1385, size: 64, offset: 4352)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!893, !531, !1388}
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "selection_get", scope: !775, file: !226, line: 731, baseType: !1390, size: 64, offset: 4416)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{null, !531, !1393, !558, !558}
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkSelectionData", file: !226, line: 479, baseType: !1395)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkSelectionData", file: !1396, line: 58, size: 448, elements: !1397)
!1396 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkselection.h", directory: "/home/sahil/vim/src")
!1397 = !{!1398, !1399, !1400, !1401, !1402, !1404, !1405}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !1395, file: !1396, line: 60, baseType: !1172, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1395, file: !1396, line: 61, baseType: !1172, size: 64, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1395, file: !1396, line: 62, baseType: !1172, size: 64, offset: 128)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1395, file: !1396, line: 63, baseType: !613, size: 32, offset: 192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1395, file: !1396, line: 64, baseType: !1403, size: 64, offset: 256)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1395, file: !1396, line: 65, baseType: !613, size: 32, offset: 320)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1395, file: !1396, line: 66, baseType: !1406, size: 64, offset: 384)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDisplay", file: !25, line: 115, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDisplay", file: !1409, line: 73, size: 1728, elements: !1410)
!1409 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkdisplay.h", directory: "/home/sahil/vim/src")
!1410 = !{!1411, !1412, !1413, !1414, !1416, !1418, !1420, !1421, !1422, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1477, !1488}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1408, file: !1409, line: 75, baseType: !585, size: 192)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "queued_events", scope: !1408, file: !1409, line: 78, baseType: !1254, size: 64, offset: 192)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "queued_tail", scope: !1408, file: !1409, line: 79, baseType: !1254, size: 64, offset: 256)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "button_click_time", scope: !1408, file: !1409, line: 84, baseType: !1415, size: 64, offset: 320)
!1415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 64, elements: !843)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "button_window", scope: !1408, file: !1409, line: 85, baseType: !1417, size: 128, offset: 384)
!1417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 128, elements: !843)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "button_number", scope: !1408, file: !1409, line: 86, baseType: !1419, size: 64, offset: 512)
!1419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 64, elements: !843)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "double_click_time", scope: !1408, file: !1409, line: 88, baseType: !558, size: 32, offset: 576)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "core_pointer", scope: !1408, file: !1409, line: 89, baseType: !1047, size: 64, offset: 640)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_hooks", scope: !1408, file: !1409, line: 91, baseType: !1423, size: 64, offset: 704)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1425)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDisplayPointerHooks", file: !1409, line: 37, baseType: !1426)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDisplayPointerHooks", file: !1409, line: 124, size: 192, elements: !1427)
!1427 = !{!1428, !1454, !1458}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "get_pointer", scope: !1426, file: !1409, line: 126, baseType: !1429, size: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{null, !1406, !1432, !1452, !1452, !1453}
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkScreen", file: !25, line: 116, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkScreen", file: !1436, line: 46, size: 6528, elements: !1437)
!1436 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkscreen.h", directory: "/home/sahil/vim/src")
!1437 = !{!1438, !1439, !1440, !1444, !1445, !1446, !1451}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1435, file: !1436, line: 48, baseType: !585, size: 192)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !1435, file: !1436, line: 50, baseType: !558, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
