; ModuleID = 'gui_gtk_x11.c'
source_filename = "gui_gtk_x11.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cmdline_option_T = type { i8*, i32 }
%struct.Gui = type { i32, i32, i32, i32, i32, i32, i32, %struct.window_S*, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, %struct.GuiScrollbar, [3 x i32], i32, i32, i32, i32, i32, i32, %struct._PangoFontDescription*, i32, %struct._PangoFontDescription*, i64, i64, i64, i64, i32, %struct._GdkCursor*, i8*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GdkColor*, %struct._GdkColor*, %struct._GdkColor*, %struct._GdkGC*, %struct._PangoContext*, %struct._PangoFont*, %struct._PangoGlyphString*, %struct._GtkWidget*, %struct._GtkAccelGroup*, %struct._GtkWidget*, i8*, i32, i8*, i8* }

!765 = !{!766, !767, !768, !769}
!766 = !DIEnumerator(name: "PANGO_COVERAGE_NONE", value: 0)
!767 = !DIEnumerator(name: "PANGO_COVERAGE_FALLBACK", value: 1)
!768 = !DIEnumerator(name: "PANGO_COVERAGE_APPROXIMATE", value: 2)
!769 = !DIEnumerator(name: "PANGO_COVERAGE_EXACT", value: 3)
!770 = !{!771, !774, !775, !778, !780, !772, !784, !1056, !1013, !1057, !1069, !1070, !822, !923, !1071, !1073, !1080, !1190, !878, !1219, !1222, !899, !823, !1223, !829, !1238, !1243, !1112, !1244, !1255, !1276, !1285, !1286, !1072, !828, !1288, !1310, !1311, !838, !825, !1312, !836, !1358, !1361, !1362, !1185, !1365, !1369, !1373, !1833, !1834, !1835, !1992, !1268, !2084, !877, !2134, !1164, !2283, !2284, !2286, !2287}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !777, line: 46, baseType: !773)
!777 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/sahil/vim/src")
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !782, line: 324, baseType: !783)
!782 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!783 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkNotebook", file: !786, line: 55, baseType: !787)
!786 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtknotebook.h", directory: "/home/sahil/vim/src")
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkNotebook", file: !786, line: 61, size: 1408, elements: !788)
!788 = !{!789, !1020, !1024, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !787, file: !786, line: 63, baseType: !790, size: 896)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkContainer", file: !791, line: 51, baseType: !792)
!791 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkcontainer.h", directory: "/home/sahil/vim/src")
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkContainer", file: !791, line: 54, size: 896, elements: !793)
!793 = !{!794, !1014, !1015, !1016, !1017, !1018, !1019}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "widget", scope: !792, file: !791, line: 56, baseType: !795, size: 768)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWidget", file: !796, line: 69, baseType: !797)
!796 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkstyle.h", directory: "/home/sahil/vim/src")
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWidget", file: !798, line: 530, size: 768, elements: !799)
!798 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkwidget.h", directory: "/home/sahil/vim/src")
!799 = !{!800, !837, !840, !842, !843, !844, !994, !1000, !1009, !1012}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !797, file: !798, line: 538, baseType: !801, size: 256)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkObject", file: !802, line: 49, baseType: !803)
!802 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtktypeutils.h", directory: "/home/sahil/vim/src")
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkObject", file: !804, line: 107, size: 256, elements: !805)
!804 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkobject.h", directory: "/home/sahil/vim/src")
!805 = !{!806, !835}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !803, file: !804, line: 109, baseType: !807, size: 192)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInitiallyUnowned", file: !808, line: 189, baseType: !809)
!808 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gobject.h", directory: "/home/sahil/vim/src")
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GObject", file: !808, line: 245, size: 192, elements: !810)
!810 = !{!811, !826, !830}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "g_type_instance", scope: !809, file: !808, line: 247, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeInstance", file: !813, line: 393, baseType: !814)
!813 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gtype.h", directory: "/home/sahil/vim/src")
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeInstance", file: !813, line: 418, size: 64, elements: !815)
!815 = !{!816}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "g_class", scope: !814, file: !813, line: 421, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeClass", file: !813, line: 391, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeClass", file: !813, line: 408, size: 64, elements: !820)
!820 = !{!821}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !819, file: !813, line: 411, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "GType", file: !813, line: 384, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !824, line: 78, baseType: !825)
!824 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/sahil/vim/src")
!825 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !809, file: !808, line: 250, baseType: !827, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !777, line: 55, baseType: !829)
!829 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !809, file: !808, line: 251, baseType: !831, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !833, line: 36, baseType: !834)
!833 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/sahil/vim/src")
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !833, line: 36, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !803, file: !804, line: 116, baseType: !836, size: 32, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !824, line: 52, baseType: !829)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "private_flags", scope: !797, file: !798, line: 545, baseType: !838, size: 16, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint16", file: !824, line: 44, baseType: !839)
!839 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !797, file: !798, line: 550, baseType: !841, size: 8, offset: 272)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint8", file: !824, line: 41, baseType: !783)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "saved_state", scope: !797, file: !798, line: 558, baseType: !841, size: 8, offset: 280)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !797, file: !798, line: 566, baseType: !775, size: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !797, file: !798, line: 575, baseType: !845, size: 64, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkStyle", file: !796, line: 54, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkStyle", file: !796, line: 73, size: 7872, elements: !848)
!848 = !{!849, !851, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !876, !879, !880, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !941, !942, !943, !944, !953, !954, !991, !992, !993}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !847, file: !796, line: 75, baseType: !850, size: 192)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "GObject", file: !808, line: 187, baseType: !809)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fg", scope: !847, file: !796, line: 79, baseType: !852, size: 480, offset: 192)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 480, elements: !861)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkColor", file: !15, line: 102, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkColor", file: !855, line: 46, size: 96, elements: !856)
!855 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkcolor.h", directory: "/home/sahil/vim/src")
!856 = !{!857, !858, !859, !860}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !854, file: !855, line: 48, baseType: !836, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !854, file: !855, line: 49, baseType: !838, size: 16, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !854, file: !855, line: 50, baseType: !838, size: 16, offset: 48)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !854, file: !855, line: 51, baseType: !838, size: 16, offset: 64)
!861 = !{!862}
!862 = !DISubrange(count: 5)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !847, file: !796, line: 80, baseType: !852, size: 480, offset: 672)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "light", scope: !847, file: !796, line: 81, baseType: !852, size: 480, offset: 1152)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "dark", scope: !847, file: !796, line: 82, baseType: !852, size: 480, offset: 1632)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !847, file: !796, line: 83, baseType: !852, size: 480, offset: 2112)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !847, file: !796, line: 84, baseType: !852, size: 480, offset: 2592)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !847, file: !796, line: 85, baseType: !852, size: 480, offset: 3072)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "text_aa", scope: !847, file: !796, line: 86, baseType: !852, size: 480, offset: 3552)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !847, file: !796, line: 88, baseType: !853, size: 96, offset: 4032)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !847, file: !796, line: 89, baseType: !853, size: 96, offset: 4128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "font_desc", scope: !847, file: !796, line: 90, baseType: !873, size: 64, offset: 4224)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoFontDescription", file: !273, line: 41, baseType: !875)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoFontDescription", file: !273, line: 41, flags: DIFlagFwdDecl)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "xthickness", scope: !847, file: !796, line: 92, baseType: !877, size: 32, offset: 4288)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !777, line: 49, baseType: !878)
!878 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ythickness", scope: !847, file: !796, line: 93, baseType: !877, size: 32, offset: 4320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fg_gc", scope: !847, file: !796, line: 95, baseType: !881, size: 320, offset: 4352)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 320, elements: !861)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkGC", file: !15, line: 106, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkGC", file: !315, line: 189, size: 384, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !884, file: !315, line: 191, baseType: !850, size: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "clip_x_origin", scope: !884, file: !315, line: 193, baseType: !877, size: 32, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "clip_y_origin", scope: !884, file: !315, line: 194, baseType: !877, size: 32, offset: 224)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ts_x_origin", scope: !884, file: !315, line: 195, baseType: !877, size: 32, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ts_y_origin", scope: !884, file: !315, line: 196, baseType: !877, size: 32, offset: 288)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !884, file: !315, line: 198, baseType: !892, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkColormap", file: !15, line: 103, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkColormap", file: !855, line: 68, size: 448, elements: !895)
!895 = !{!896, !897, !898, !900, !922}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !894, file: !855, line: 71, baseType: !850, size: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !894, file: !855, line: 74, baseType: !877, size: 32, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !894, file: !855, line: 75, baseType: !899, size: 64, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !894, file: !855, line: 78, baseType: !901, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisual", file: !15, line: 109, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkVisual", file: !6, line: 77, size: 640, elements: !904)
!904 = !{!905, !906, !908, !909, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !903, file: !6, line: 79, baseType: !850, size: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !903, file: !6, line: 81, baseType: !907, size: 32, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisualType", file: !6, line: 63, baseType: !5)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !903, file: !6, line: 82, baseType: !877, size: 32, offset: 224)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !903, file: !6, line: 83, baseType: !910, size: 32, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkByteOrder", file: !15, line: 122, baseType: !14)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "colormap_size", scope: !903, file: !6, line: 84, baseType: !877, size: 32, offset: 288)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !903, file: !6, line: 85, baseType: !877, size: 32, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !903, file: !6, line: 87, baseType: !836, size: 32, offset: 352)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "red_shift", scope: !903, file: !6, line: 88, baseType: !877, size: 32, offset: 384)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "red_prec", scope: !903, file: !6, line: 89, baseType: !877, size: 32, offset: 416)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !903, file: !6, line: 91, baseType: !836, size: 32, offset: 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "green_shift", scope: !903, file: !6, line: 92, baseType: !877, size: 32, offset: 480)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "green_prec", scope: !903, file: !6, line: 93, baseType: !877, size: 32, offset: 512)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !903, file: !6, line: 95, baseType: !836, size: 32, offset: 544)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "blue_shift", scope: !903, file: !6, line: 96, baseType: !877, size: 32, offset: 576)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "blue_prec", scope: !903, file: !6, line: 97, baseType: !877, size: 32, offset: 608)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "windowing_data", scope: !894, file: !855, line: 80, baseType: !923, size: 64, offset: 384)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !777, line: 103, baseType: !774)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bg_gc", scope: !847, file: !796, line: 96, baseType: !881, size: 320, offset: 4672)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "light_gc", scope: !847, file: !796, line: 97, baseType: !881, size: 320, offset: 4992)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "dark_gc", scope: !847, file: !796, line: 98, baseType: !881, size: 320, offset: 5312)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "mid_gc", scope: !847, file: !796, line: 99, baseType: !881, size: 320, offset: 5632)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "text_gc", scope: !847, file: !796, line: 100, baseType: !881, size: 320, offset: 5952)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "base_gc", scope: !847, file: !796, line: 101, baseType: !881, size: 320, offset: 6272)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "text_aa_gc", scope: !847, file: !796, line: 102, baseType: !881, size: 320, offset: 6592)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "black_gc", scope: !847, file: !796, line: 103, baseType: !882, size: 64, offset: 6912)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "white_gc", scope: !847, file: !796, line: 104, baseType: !882, size: 64, offset: 6976)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "bg_pixmap", scope: !847, file: !796, line: 106, baseType: !934, size: 320, offset: 7040)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 320, elements: !861)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkPixmap", file: !15, line: 113, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDrawable", file: !938, line: 53, size: 192, elements: !939)
!938 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkdrawable.h", directory: "/home/sahil/vim/src")
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !937, file: !938, line: 55, baseType: !850, size: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "attach_count", scope: !847, file: !796, line: 110, baseType: !877, size: 32, offset: 7360)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !847, file: !796, line: 112, baseType: !877, size: 32, offset: 7392)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !847, file: !796, line: 113, baseType: !892, size: 64, offset: 7424)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "private_font", scope: !847, file: !796, line: 114, baseType: !945, size: 64, offset: 7488)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkFont", file: !15, line: 105, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkFont", file: !20, line: 49, size: 96, elements: !948)
!948 = !{!949, !951, !952}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !947, file: !20, line: 51, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkFontType", file: !20, line: 47, baseType: !19)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !947, file: !20, line: 52, baseType: !877, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !947, file: !20, line: 53, baseType: !877, size: 32, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "private_font_desc", scope: !847, file: !796, line: 115, baseType: !873, size: 64, offset: 7552)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "rc_style", scope: !847, file: !796, line: 118, baseType: !955, size: 64, offset: 7616)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRcStyle", file: !796, line: 57, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkRcStyle", file: !25, line: 60, size: 3072, elements: !958)
!958 = !{!959, !960, !961, !963, !964, !967, !968, !969, !970, !971, !972, !973, !981, !989, !990}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !957, file: !25, line: 62, baseType: !850, size: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !957, file: !25, line: 66, baseType: !775, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "bg_pixmap_name", scope: !957, file: !25, line: 67, baseType: !962, size: 320, offset: 256)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 320, elements: !861)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "font_desc", scope: !957, file: !25, line: 68, baseType: !873, size: 64, offset: 576)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "color_flags", scope: !957, file: !25, line: 70, baseType: !965, size: 160, offset: 640)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 160, elements: !861)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRcFlags", file: !25, line: 58, baseType: !24)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "fg", scope: !957, file: !25, line: 71, baseType: !852, size: 480, offset: 800)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !957, file: !25, line: 72, baseType: !852, size: 480, offset: 1280)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !957, file: !25, line: 73, baseType: !852, size: 480, offset: 1760)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !957, file: !25, line: 74, baseType: !852, size: 480, offset: 2240)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "xthickness", scope: !957, file: !25, line: 76, baseType: !877, size: 32, offset: 2720)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ythickness", scope: !957, file: !25, line: 77, baseType: !877, size: 32, offset: 2752)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "rc_properties", scope: !957, file: !25, line: 80, baseType: !974, size: 64, offset: 2816)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !976, line: 37, baseType: !977)
!976 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/sahil/vim/src")
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !976, line: 41, size: 128, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !977, file: !976, line: 43, baseType: !775, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !977, file: !976, line: 44, baseType: !828, size: 32, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "rc_style_lists", scope: !957, file: !25, line: 83, baseType: !982, size: 64, offset: 2880)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !984, line: 37, baseType: !985)
!984 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/sahil/vim/src")
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !984, line: 39, size: 128, elements: !986)
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !985, file: !984, line: 41, baseType: !923, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !985, file: !984, line: 42, baseType: !982, size: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "icon_factories", scope: !957, file: !25, line: 85, baseType: !982, size: 64, offset: 2944)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "engine_specified", scope: !957, file: !25, line: 87, baseType: !828, size: 1, offset: 3008, flags: DIFlagBitField, extraData: i64 3008)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "styles", scope: !847, file: !796, line: 120, baseType: !982, size: 64, offset: 7680)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "property_cache", scope: !847, file: !796, line: 121, baseType: !974, size: 64, offset: 7744)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "icon_factories", scope: !847, file: !796, line: 122, baseType: !982, size: 64, offset: 7808)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "requisition", scope: !797, file: !798, line: 579, baseType: !995, size: 64, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRequisition", file: !798, line: 478, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkRequisition", file: !798, line: 519, size: 64, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !996, file: !798, line: 521, baseType: !877, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !996, file: !798, line: 522, baseType: !877, size: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "allocation", scope: !797, file: !798, line: 583, baseType: !1001, size: 128, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkAllocation", file: !798, line: 498, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkRectangle", file: !15, line: 69, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkRectangle", file: !15, line: 200, size: 128, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1003, file: !15, line: 202, baseType: !877, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1003, file: !15, line: 203, baseType: !877, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1003, file: !15, line: 204, baseType: !877, size: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1003, file: !15, line: 205, baseType: !877, size: 32, offset: 96)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !797, file: !798, line: 589, baseType: !1010, size: 64, offset: 640)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkWindow", file: !15, line: 114, baseType: !937)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !797, file: !798, line: 593, baseType: !1013, size: 64, offset: 704)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "focus_child", scope: !792, file: !791, line: 58, baseType: !1013, size: 64, offset: 768)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !792, file: !791, line: 60, baseType: !828, size: 16, offset: 832, flags: DIFlagBitField, extraData: i64 832)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "need_resize", scope: !792, file: !791, line: 63, baseType: !828, size: 1, offset: 848, flags: DIFlagBitField, extraData: i64 832)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "resize_mode", scope: !792, file: !791, line: 64, baseType: !828, size: 2, offset: 849, flags: DIFlagBitField, extraData: i64 832)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "reallocate_redraws", scope: !792, file: !791, line: 65, baseType: !828, size: 1, offset: 851, flags: DIFlagBitField, extraData: i64 832)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "has_focus_chain", scope: !792, file: !791, line: 66, baseType: !828, size: 1, offset: 852, flags: DIFlagBitField, extraData: i64 832)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "cur_page", scope: !787, file: !786, line: 66, baseType: !1021, size: 64, offset: 896)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkNotebookPage", file: !786, line: 58, baseType: !1023)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkNotebookPage", file: !786, line: 58, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !787, file: !786, line: 70, baseType: !1025, size: 64, offset: 960)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !1027, line: 37, baseType: !1028)
!1027 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/sahil/vim/src")
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !1027, line: 39, size: 192, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1028, file: !1027, line: 41, baseType: !923, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1028, file: !1027, line: 42, baseType: !1025, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1028, file: !1027, line: 43, baseType: !1025, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "first_tab", scope: !787, file: !786, line: 71, baseType: !1025, size: 64, offset: 1024)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "focus_tab", scope: !787, file: !786, line: 72, baseType: !1025, size: 64, offset: 1088)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "menu", scope: !787, file: !786, line: 74, baseType: !1013, size: 64, offset: 1152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "event_window", scope: !787, file: !786, line: 75, baseType: !1010, size: 64, offset: 1216)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !787, file: !786, line: 77, baseType: !836, size: 32, offset: 1280)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "tab_hborder", scope: !787, file: !786, line: 79, baseType: !838, size: 16, offset: 1312)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "tab_vborder", scope: !787, file: !786, line: 80, baseType: !838, size: 16, offset: 1328)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "show_tabs", scope: !787, file: !786, line: 82, baseType: !828, size: 1, offset: 1344, flags: DIFlagBitField, extraData: i64 1344)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "homogeneous", scope: !787, file: !786, line: 83, baseType: !828, size: 1, offset: 1345, flags: DIFlagBitField, extraData: i64 1344)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "show_border", scope: !787, file: !786, line: 84, baseType: !828, size: 1, offset: 1346, flags: DIFlagBitField, extraData: i64 1344)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "tab_pos", scope: !787, file: !786, line: 85, baseType: !828, size: 2, offset: 1347, flags: DIFlagBitField, extraData: i64 1344)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "scrollable", scope: !787, file: !786, line: 86, baseType: !828, size: 1, offset: 1349, flags: DIFlagBitField, extraData: i64 1344)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "in_child", scope: !787, file: !786, line: 87, baseType: !828, size: 3, offset: 1350, flags: DIFlagBitField, extraData: i64 1344)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "click_child", scope: !787, file: !786, line: 88, baseType: !828, size: 3, offset: 1353, flags: DIFlagBitField, extraData: i64 1344)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !787, file: !786, line: 89, baseType: !828, size: 2, offset: 1356, flags: DIFlagBitField, extraData: i64 1344)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "need_timer", scope: !787, file: !786, line: 90, baseType: !828, size: 1, offset: 1358, flags: DIFlagBitField, extraData: i64 1344)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "child_has_focus", scope: !787, file: !786, line: 91, baseType: !828, size: 1, offset: 1359, flags: DIFlagBitField, extraData: i64 1344)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "have_visible_child", scope: !787, file: !786, line: 92, baseType: !828, size: 1, offset: 1360, flags: DIFlagBitField, extraData: i64 1344)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "focus_out", scope: !787, file: !786, line: 93, baseType: !828, size: 1, offset: 1361, flags: DIFlagBitField, extraData: i64 1344)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "has_before_previous", scope: !787, file: !786, line: 95, baseType: !828, size: 1, offset: 1362, flags: DIFlagBitField, extraData: i64 1344)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "has_before_next", scope: !787, file: !786, line: 96, baseType: !828, size: 1, offset: 1363, flags: DIFlagBitField, extraData: i64 1344)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "has_after_previous", scope: !787, file: !786, line: 97, baseType: !828, size: 1, offset: 1364, flags: DIFlagBitField, extraData: i64 1344)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "has_after_next", scope: !787, file: !786, line: 98, baseType: !828, size: 1, offset: 1365, flags: DIFlagBitField, extraData: i64 1344)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkMisc", file: !1059, line: 48, baseType: !1060)
!1059 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkmisc.h", directory: "/home/sahil/vim/src")
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkMisc", file: !1059, line: 51, size: 896, elements: !1061)
!1061 = !{!1062, !1063, !1066, !1067, !1068}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "widget", scope: !1060, file: !1059, line: 53, baseType: !795, size: 768)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "xalign", scope: !1060, file: !1059, line: 55, baseType: !1064, size: 32, offset: 768)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfloat", file: !777, line: 57, baseType: !1065)
!1065 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "yalign", scope: !1060, file: !1059, line: 56, baseType: !1064, size: 32, offset: 800)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "xpad", scope: !1060, file: !1059, line: 58, baseType: !838, size: 16, offset: 832)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ypad", scope: !1060, file: !1059, line: 59, baseType: !838, size: 16, offset: 848)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !777, line: 48, baseType: !1072)
!1072 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkBin", file: !1075, line: 48, baseType: !1076)
!1075 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkbin.h", directory: "/home/sahil/vim/src")
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkBin", file: !1075, line: 51, size: 960, elements: !1077)
!1077 = !{!1078, !1079}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !1076, file: !1075, line: 53, baseType: !790, size: 896)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !1076, file: !1075, line: 55, baseType: !1013, size: 64, offset: 896)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkLabel", file: !1082, line: 49, baseType: !1083)
!1082 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtklabel.h", directory: "/home/sahil/vim/src")
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkLabel", file: !1082, line: 54, size: 1472, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1104, !1105, !1110, !1111, !1186}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !1083, file: !1082, line: 56, baseType: !1058, size: 896)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1083, file: !1082, line: 59, baseType: !775, size: 64, offset: 896)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "jtype", scope: !1083, file: !1082, line: 60, baseType: !828, size: 2, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !1083, file: !1082, line: 61, baseType: !828, size: 1, offset: 962, flags: DIFlagBitField, extraData: i64 960)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "use_underline", scope: !1083, file: !1082, line: 62, baseType: !828, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "use_markup", scope: !1083, file: !1082, line: 63, baseType: !828, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ellipsize", scope: !1083, file: !1082, line: 64, baseType: !828, size: 3, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "single_line_mode", scope: !1083, file: !1082, line: 65, baseType: !828, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "have_transform", scope: !1083, file: !1082, line: 66, baseType: !828, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "in_click", scope: !1083, file: !1082, line: 67, baseType: !828, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_mode", scope: !1083, file: !1082, line: 68, baseType: !828, size: 3, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_set", scope: !1083, file: !1082, line: 69, baseType: !828, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "track_links", scope: !1083, file: !1082, line: 70, baseType: !828, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_keyval", scope: !1083, file: !1082, line: 72, baseType: !828, size: 32, offset: 992)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1083, file: !1082, line: 74, baseType: !775, size: 64, offset: 1024)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !1083, file: !1082, line: 75, baseType: !1101, size: 64, offset: 1088)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAttrList", file: !241, line: 119, baseType: !1103)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoAttrList", file: !241, line: 119, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "effective_attrs", scope: !1083, file: !1082, line: 76, baseType: !1101, size: 64, offset: 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !1083, file: !1082, line: 78, baseType: !1106, size: 64, offset: 1216)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoLayout", file: !1108, line: 32, baseType: !1109)
!1108 = !DIFile(filename: "/usr/include/pango-1.0/pango/pango-layout.h", directory: "/home/sahil/vim/src")
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoLayout", file: !1108, line: 32, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_widget", scope: !1083, file: !1082, line: 80, baseType: !1013, size: 64, offset: 1280)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_window", scope: !1083, file: !1082, line: 81, baseType: !1112, size: 64, offset: 1344)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWindow", file: !798, line: 485, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWindow", file: !1115, line: 54, size: 1920, elements: !1116)
!1115 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkwindow.h", directory: "/home/sahil/vim/src")
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1129, !1130, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1165}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "bin", scope: !1114, file: !1115, line: 56, baseType: !1074, size: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !1114, file: !1115, line: 58, baseType: !775, size: 64, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "wmclass_name", scope: !1114, file: !1115, line: 59, baseType: !775, size: 64, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "wmclass_class", scope: !1114, file: !1115, line: 60, baseType: !775, size: 64, offset: 1088)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "wm_role", scope: !1114, file: !1115, line: 61, baseType: !775, size: 64, offset: 1152)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "focus_widget", scope: !1114, file: !1115, line: 63, baseType: !1013, size: 64, offset: 1216)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "default_widget", scope: !1114, file: !1115, line: 64, baseType: !1013, size: 64, offset: 1280)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "transient_parent", scope: !1114, file: !1115, line: 65, baseType: !1112, size: 64, offset: 1344)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "geometry_info", scope: !1114, file: !1115, line: 66, baseType: !1126, size: 64, offset: 1408)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWindowGeometryInfo", file: !1115, line: 50, baseType: !1128)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWindowGeometryInfo", file: !1115, line: 50, flags: DIFlagFwdDecl)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !1114, file: !1115, line: 67, baseType: !1010, size: 64, offset: 1472)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1114, file: !1115, line: 68, baseType: !1131, size: 64, offset: 1536)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWindowGroup", file: !1115, line: 51, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWindowGroup", file: !1115, line: 154, size: 256, elements: !1134)
!1134 = !{!1135, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1133, file: !1115, line: 156, baseType: !850, size: 192)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "grabs", scope: !1133, file: !1115, line: 158, baseType: !982, size: 64, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "configure_request_count", scope: !1114, file: !1115, line: 70, baseType: !838, size: 16, offset: 1600)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "allow_shrink", scope: !1114, file: !1115, line: 71, baseType: !828, size: 1, offset: 1616, flags: DIFlagBitField, extraData: i64 1616)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "allow_grow", scope: !1114, file: !1115, line: 72, baseType: !828, size: 1, offset: 1617, flags: DIFlagBitField, extraData: i64 1616)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "configure_notify_received", scope: !1114, file: !1115, line: 73, baseType: !828, size: 1, offset: 1618, flags: DIFlagBitField, extraData: i64 1616)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "need_default_position", scope: !1114, file: !1115, line: 80, baseType: !828, size: 1, offset: 1619, flags: DIFlagBitField, extraData: i64 1616)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "need_default_size", scope: !1114, file: !1115, line: 81, baseType: !828, size: 1, offset: 1620, flags: DIFlagBitField, extraData: i64 1616)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !1114, file: !1115, line: 82, baseType: !828, size: 3, offset: 1621, flags: DIFlagBitField, extraData: i64 1616)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1114, file: !1115, line: 83, baseType: !828, size: 4, offset: 1624, flags: DIFlagBitField, extraData: i64 1616)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "has_user_ref_count", scope: !1114, file: !1115, line: 84, baseType: !828, size: 1, offset: 1628, flags: DIFlagBitField, extraData: i64 1616)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "has_focus", scope: !1114, file: !1115, line: 85, baseType: !828, size: 1, offset: 1629, flags: DIFlagBitField, extraData: i64 1616)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !1114, file: !1115, line: 87, baseType: !828, size: 1, offset: 1630, flags: DIFlagBitField, extraData: i64 1616)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_with_parent", scope: !1114, file: !1115, line: 88, baseType: !828, size: 1, offset: 1631, flags: DIFlagBitField, extraData: i64 1616)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "has_frame", scope: !1114, file: !1115, line: 90, baseType: !828, size: 1, offset: 1632, flags: DIFlagBitField, extraData: i64 1616)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "iconify_initially", scope: !1114, file: !1115, line: 93, baseType: !828, size: 1, offset: 1633, flags: DIFlagBitField, extraData: i64 1616)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "stick_initially", scope: !1114, file: !1115, line: 94, baseType: !828, size: 1, offset: 1634, flags: DIFlagBitField, extraData: i64 1616)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "maximize_initially", scope: !1114, file: !1115, line: 95, baseType: !828, size: 1, offset: 1635, flags: DIFlagBitField, extraData: i64 1616)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "decorated", scope: !1114, file: !1115, line: 96, baseType: !828, size: 1, offset: 1636, flags: DIFlagBitField, extraData: i64 1616)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "type_hint", scope: !1114, file: !1115, line: 98, baseType: !828, size: 3, offset: 1637, flags: DIFlagBitField, extraData: i64 1616)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !1114, file: !1115, line: 101, baseType: !828, size: 5, offset: 1640, flags: DIFlagBitField, extraData: i64 1616)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "is_active", scope: !1114, file: !1115, line: 103, baseType: !828, size: 1, offset: 1645, flags: DIFlagBitField, extraData: i64 1616)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "has_toplevel_focus", scope: !1114, file: !1115, line: 104, baseType: !828, size: 1, offset: 1646, flags: DIFlagBitField, extraData: i64 1616)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "frame_left", scope: !1114, file: !1115, line: 106, baseType: !828, size: 32, offset: 1664)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "frame_top", scope: !1114, file: !1115, line: 107, baseType: !828, size: 32, offset: 1696)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "frame_right", scope: !1114, file: !1115, line: 108, baseType: !828, size: 32, offset: 1728)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bottom", scope: !1114, file: !1115, line: 109, baseType: !828, size: 32, offset: 1760)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "keys_changed_handler", scope: !1114, file: !1115, line: 111, baseType: !828, size: 32, offset: 1792)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_modifier", scope: !1114, file: !1115, line: 113, baseType: !1164, size: 32, offset: 1824)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkModifierType", file: !15, line: 153, baseType: !88)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1114, file: !1115, line: 114, baseType: !1166, size: 64, offset: 1856)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkScreen", file: !15, line: 116, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkScreen", file: !1169, line: 46, size: 6528, elements: !1170)
!1169 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkscreen.h", directory: "/home/sahil/vim/src")
!1170 = !{!1171, !1172, !1173, !1177, !1178, !1179, !1184}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1168, file: !1169, line: 48, baseType: !850, size: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !1168, file: !1169, line: 50, baseType: !828, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "normal_gcs", scope: !1168, file: !1169, line: 52, baseType: !1174, size: 2048, offset: 256)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 2048, elements: !1175)
!1175 = !{!1176}
!1176 = !DISubrange(count: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "exposure_gcs", scope: !1168, file: !1169, line: 53, baseType: !1174, size: 2048, offset: 2304)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow_gcs", scope: !1168, file: !1169, line: 54, baseType: !1174, size: 2048, offset: 4352)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "font_options", scope: !1168, file: !1169, line: 56, baseType: !1180, size: 64, offset: 6400)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "cairo_font_options_t", file: !1182, line: 1385, baseType: !1183)
!1182 = !DIFile(filename: "/usr/include/cairo/cairo.h", directory: "/home/sahil/vim/src")
!1183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cairo_font_options", file: !1182, line: 1385, flags: DIFlagFwdDecl)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !1168, file: !1169, line: 57, baseType: !1185, size: 64, offset: 6464)
!1185 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "select_info", scope: !1083, file: !1082, line: 83, baseType: !1187, size: 64, offset: 1408)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkLabelSelectionInfo", file: !1082, line: 52, baseType: !1189)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkLabelSelectionInfo", file: !1082, line: 52, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkTooltips", file: !1192, line: 46, baseType: !1193)
!1192 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtktooltips.h", directory: "/home/sahil/vim/src")
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkTooltips", file: !1192, line: 58, size: 768, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1207, !1208, !1209, !1210, !1211, !1212, !1213}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1193, file: !1192, line: 60, baseType: !801, size: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "tip_window", scope: !1193, file: !1192, line: 63, baseType: !1013, size: 64, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "tip_label", scope: !1193, file: !1192, line: 64, baseType: !1013, size: 64, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "active_tips_data", scope: !1193, file: !1192, line: 65, baseType: !1199, size: 64, offset: 384)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkTooltipsData", file: !1192, line: 48, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkTooltipsData", file: !1192, line: 50, size: 256, elements: !1202)
!1202 = !{!1203, !1204, !1205, !1206}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "tooltips", scope: !1201, file: !1192, line: 52, baseType: !1190, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "widget", scope: !1201, file: !1192, line: 53, baseType: !1013, size: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "tip_text", scope: !1201, file: !1192, line: 54, baseType: !775, size: 64, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "tip_private", scope: !1201, file: !1192, line: 55, baseType: !775, size: 64, offset: 192)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "tips_data_list", scope: !1193, file: !1192, line: 66, baseType: !1025, size: 64, offset: 448)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1193, file: !1192, line: 68, baseType: !828, size: 30, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !1193, file: !1192, line: 69, baseType: !828, size: 1, offset: 542, flags: DIFlagBitField, extraData: i64 512)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "have_grab", scope: !1193, file: !1192, line: 70, baseType: !828, size: 1, offset: 543, flags: DIFlagBitField, extraData: i64 512)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "use_sticky_delay", scope: !1193, file: !1192, line: 71, baseType: !828, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 512)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "timer_tag", scope: !1193, file: !1192, line: 72, baseType: !877, size: 32, offset: 576)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "last_popdown", scope: !1193, file: !1192, line: 73, baseType: !1214, size: 128, offset: 640)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !777, line: 545, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !777, line: 547, size: 128, elements: !1216)
!1216 = !{!1217, !1218}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1215, file: !777, line: 549, baseType: !1071, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1215, file: !777, line: 550, baseType: !1071, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkAtom", file: !15, line: 80, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkAtom", file: !15, line: 80, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !777, line: 54, baseType: !825)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkPlug", file: !1225, line: 48, baseType: !1226)
!1225 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkplug.h", directory: "/home/sahil/vim/src")
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkPlug", file: !1225, line: 52, size: 2240, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1232, !1237}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1226, file: !1225, line: 54, baseType: !1113, size: 1920)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "socket_window", scope: !1226, file: !1225, line: 56, baseType: !1010, size: 64, offset: 1920)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "modality_window", scope: !1226, file: !1225, line: 57, baseType: !1013, size: 64, offset: 1984)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "modality_group", scope: !1226, file: !1225, line: 58, baseType: !1131, size: 64, offset: 2048)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "grabbed_keys", scope: !1226, file: !1225, line: 59, baseType: !1233, size: 64, offset: 2112)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !1235, line: 37, baseType: !1236)
!1235 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/sahil/vim/src")
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !1235, line: 37, flags: DIFlagFwdDecl)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "same_app", scope: !1226, file: !1225, line: 61, baseType: !828, size: 1, offset: 2176, flags: DIFlagBitField, extraData: i64 2176)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCallback", file: !1239, line: 86, baseType: !1240)
!1239 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gclosure.h", directory: "/home/sahil/vim/src")
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{null}
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "GConnectFlags", file: !189, line: 159, baseType: !188)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkBox", file: !1246, line: 49, baseType: !1247)
!1246 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkbox.h", directory: "/home/sahil/vim/src")
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkBox", file: !1246, line: 52, size: 1024, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1254}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !1247, file: !1246, line: 54, baseType: !790, size: 896)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1247, file: !1246, line: 57, baseType: !1025, size: 64, offset: 896)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "spacing", scope: !1247, file: !1246, line: 58, baseType: !1252, size: 16, offset: 960)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint16", file: !824, line: 43, baseType: !1253)
!1253 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "homogeneous", scope: !1247, file: !1246, line: 59, baseType: !828, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkToolbar", file: !1257, line: 89, baseType: !1258)
!1257 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtktoolbar.h", directory: "/home/sahil/vim/src")
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkToolbar", file: !1257, line: 93, size: 1408, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1265, !1267, !1269, !1270, !1271, !1272, !1273, !1274, !1275}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !1258, file: !1257, line: 95, baseType: !790, size: 896)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "num_children", scope: !1258, file: !1257, line: 98, baseType: !877, size: 32, offset: 896)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1258, file: !1257, line: 99, baseType: !1025, size: 64, offset: 960)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !1258, file: !1257, line: 100, baseType: !1264, size: 32, offset: 1024)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkOrientation", file: !149, line: 266, baseType: !193)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1258, file: !1257, line: 101, baseType: !1266, size: 32, offset: 1056)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkToolbarStyle", file: !149, line: 431, baseType: !197)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "icon_size", scope: !1258, file: !1257, line: 102, baseType: !1268, size: 32, offset: 1088)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkIconSize", file: !149, line: 151, baseType: !203)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "tooltips", scope: !1258, file: !1257, line: 105, baseType: !1190, size: 64, offset: 1152)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "button_maxw", scope: !1258, file: !1257, line: 111, baseType: !877, size: 32, offset: 1216)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "button_maxh", scope: !1258, file: !1257, line: 112, baseType: !877, size: 32, offset: 1248)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "_gtk_reserved1", scope: !1258, file: !1257, line: 114, baseType: !828, size: 32, offset: 1280)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "_gtk_reserved2", scope: !1258, file: !1257, line: 115, baseType: !828, size: 32, offset: 1312)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "style_set", scope: !1258, file: !1257, line: 117, baseType: !828, size: 1, offset: 1344, flags: DIFlagBitField, extraData: i64 1344)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "icon_size_set", scope: !1258, file: !1257, line: 118, baseType: !828, size: 1, offset: 1345, flags: DIFlagBitField, extraData: i64 1344)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkForm", file: !1278, line: 38, baseType: !1279)
!1278 = !DIFile(filename: "./gui_gtk_f.h", directory: "/home/sahil/vim/src")
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkForm", file: !1278, line: 41, size: 1088, elements: !1280)
!1280 = !{!1281, !1282, !1283, !1284}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !1279, file: !1278, line: 43, baseType: !790, size: 896)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1279, file: !1278, line: 45, baseType: !1025, size: 64, offset: 896)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "bin_window", scope: !1279, file: !1278, line: 46, baseType: !1010, size: 64, offset: 960)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_count", scope: !1279, file: !1278, line: 47, baseType: !877, size: 32, offset: 1024)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "guicolor_T", file: !1287, line: 198, baseType: !1072)
!1287 = !DIFile(filename: "./gui.h", directory: "/home/sahil/vim/src")
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkFontSelectionDialog", file: !1290, line: 64, baseType: !1291)
!1290 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkfontsel.h", directory: "/home/sahil/vim/src")
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkFontSelectionDialog", file: !1290, line: 103, size: 2560, elements: !1292)
!1292 = !{!1293, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1291, file: !1290, line: 105, baseType: !1294, size: 2112)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkDialog", file: !227, line: 94, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkDialog", file: !227, line: 97, size: 2112, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1295, file: !227, line: 99, baseType: !1113, size: 1920)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "vbox", scope: !1295, file: !227, line: 102, baseType: !1013, size: 64, offset: 1920)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "action_area", scope: !1295, file: !227, line: 103, baseType: !1013, size: 64, offset: 1984)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "separator", scope: !1295, file: !227, line: 106, baseType: !1013, size: 64, offset: 2048)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "fontsel", scope: !1291, file: !1290, line: 108, baseType: !1013, size: 64, offset: 2112)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "main_vbox", scope: !1291, file: !1290, line: 110, baseType: !1013, size: 64, offset: 2176)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "action_area", scope: !1291, file: !1290, line: 111, baseType: !1013, size: 64, offset: 2240)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ok_button", scope: !1291, file: !1290, line: 114, baseType: !1013, size: 64, offset: 2304)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "apply_button", scope: !1291, file: !1290, line: 115, baseType: !1013, size: 64, offset: 2368)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_button", scope: !1291, file: !1290, line: 116, baseType: !1013, size: 64, offset: 2432)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "dialog_width", scope: !1291, file: !1290, line: 123, baseType: !877, size: 32, offset: 2496)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "auto_resize", scope: !1291, file: !1290, line: 124, baseType: !1309, size: 32, offset: 2528)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !777, line: 50, baseType: !877)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuiFont", file: !1287, line: 208, baseType: !873)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoItem", file: !1314, line: 31, baseType: !1315)
!1314 = !DIFile(filename: "/usr/include/pango-1.0/pango/pango-item.h", directory: "/home/sahil/vim/src")
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoItem", file: !1314, line: 103, size: 512, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1315, file: !1314, line: 105, baseType: !877, size: 32)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1315, file: !1314, line: 106, baseType: !877, size: 32, offset: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "num_chars", scope: !1315, file: !1314, line: 107, baseType: !877, size: 32, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "analysis", scope: !1315, file: !1314, line: 108, baseType: !1321, size: 384, offset: 128)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAnalysis", file: !1314, line: 30, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoAnalysis", file: !1314, line: 78, size: 384, elements: !1323)
!1323 = !{!1324, !1336, !1342, !1348, !1349, !1350, !1351, !1352, !1357}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "shape_engine", scope: !1322, file: !1314, line: 80, baseType: !1325, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoEngineShape", file: !1327, line: 35, baseType: !1328)
!1327 = !DIFile(filename: "/usr/include/pango-1.0/pango/pango-types.h", directory: "/home/sahil/vim/src")
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoEngineShape", file: !1329, line: 185, size: 192, elements: !1330)
!1329 = !DIFile(filename: "/usr/include/pango-1.0/pango/pango-engine.h", directory: "/home/sahil/vim/src")
!1330 = !{!1331}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1328, file: !1329, line: 187, baseType: !1332, size: 192)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoEngine", file: !1329, line: 52, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoEngine", file: !1329, line: 63, size: 192, elements: !1334)
!1334 = !{!1335}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1333, file: !1329, line: 66, baseType: !850, size: 192)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "lang_engine", scope: !1322, file: !1314, line: 81, baseType: !1337, size: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoEngineLang", file: !1327, line: 34, baseType: !1339)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoEngineLang", file: !1329, line: 116, size: 192, elements: !1340)
!1340 = !{!1341}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1339, file: !1329, line: 119, baseType: !1332, size: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1322, file: !1314, line: 82, baseType: !1343, size: 64, offset: 128)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoFont", file: !1327, line: 37, baseType: !1345)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoFont", file: !273, line: 582, size: 192, elements: !1346)
!1346 = !{!1347}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1345, file: !273, line: 584, baseType: !850, size: 192)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1322, file: !1314, line: 84, baseType: !841, size: 8, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !1322, file: !1314, line: 85, baseType: !841, size: 8, offset: 200)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1322, file: !1314, line: 86, baseType: !841, size: 8, offset: 208)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !1322, file: !1314, line: 88, baseType: !841, size: 8, offset: 216)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1322, file: !1314, line: 89, baseType: !1353, size: 64, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoLanguage", file: !1355, line: 32, baseType: !1356)
!1355 = !DIFile(filename: "/usr/include/pango-1.0/pango/pango-language.h", directory: "/home/sahil/vim/src")
!1356 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoLanguage", file: !1355, line: 32, flags: DIFlagFwdDecl)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "extra_attrs", scope: !1322, file: !1314, line: 91, baseType: !982, size: 64, offset: 320)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !1359, line: 96, baseType: !1360)
!1359 = !DIFile(filename: "/usr/include/X11/X.h", directory: "/home/sahil/vim/src")
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !1359, line: 66, baseType: !825)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkCursorType", file: !380, line: 125, baseType: !379)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkPixbuf", file: !470, line: 157, baseType: !1364)
!1364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkPixbuf", file: !470, line: 157, flags: DIFlagFwdDecl)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !604, line: 173, baseType: !1366)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!1309, !923}
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !777, line: 114, baseType: !1370)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{null, !923, !923}
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "XEvent", file: !1375, line: 1009, baseType: !1376)
!1375 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "/home/sahil/vim/src")
!1376 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_XEvent", file: !1375, line: 973, size: 1536, elements: !1377)
!1377 = !{!1378, !1379, !1391, !1411, !1430, !1449, !1470, !1481, !1495, !1512, !1523, !1533, !1549, !1559, !1570, !1581, !1591, !1605, !1622, !1634, !1645, !1663, !1674, !1685, !1698, !1709, !1723, !1736, !1749, !1773, !1785, !1796, !1807, !1817, !1829}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1376, file: !1375, line: 974, baseType: !878, size: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "xany", scope: !1376, file: !1375, line: 975, baseType: !1380, size: 320)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "XAnyEvent", file: !1375, line: 940, baseType: !1381)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 934, size: 320, elements: !1382)
!1382 = !{!1383, !1384, !1385, !1386, !1390}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1381, file: !1375, line: 935, baseType: !878, size: 32)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1381, file: !1375, line: 936, baseType: !825, size: 64, offset: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1381, file: !1375, line: 937, baseType: !878, size: 32, offset: 128)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1381, file: !1375, line: 938, baseType: !1387, size: 64, offset: 192)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !1375, line: 487, baseType: !1389)
!1389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !1375, line: 255, flags: DIFlagFwdDecl)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1381, file: !1375, line: 939, baseType: !1358, size: 64, offset: 256)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "xkey", scope: !1376, file: !1375, line: 976, baseType: !1392, size: 768)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeyEvent", file: !1375, line: 571, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 557, size: 768, elements: !1394)
!1394 = !{!1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1404, !1405, !1406, !1407, !1408, !1409, !1410}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1393, file: !1375, line: 558, baseType: !878, size: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1393, file: !1375, line: 559, baseType: !825, size: 64, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1393, file: !1375, line: 560, baseType: !878, size: 32, offset: 128)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1393, file: !1375, line: 561, baseType: !1387, size: 64, offset: 192)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1393, file: !1375, line: 562, baseType: !1358, size: 64, offset: 256)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1393, file: !1375, line: 563, baseType: !1358, size: 64, offset: 320)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1393, file: !1375, line: 564, baseType: !1358, size: 64, offset: 384)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1393, file: !1375, line: 565, baseType: !1403, size: 64, offset: 448)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", file: !1359, line: 77, baseType: !825)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1393, file: !1375, line: 566, baseType: !878, size: 32, offset: 512)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1393, file: !1375, line: 566, baseType: !878, size: 32, offset: 544)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1393, file: !1375, line: 567, baseType: !878, size: 32, offset: 576)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1393, file: !1375, line: 567, baseType: !878, size: 32, offset: 608)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1393, file: !1375, line: 568, baseType: !829, size: 32, offset: 640)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !1393, file: !1375, line: 569, baseType: !829, size: 32, offset: 672)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !1393, file: !1375, line: 570, baseType: !878, size: 32, offset: 704)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "xbutton", scope: !1376, file: !1375, line: 977, baseType: !1412, size: 768)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "XButtonEvent", file: !1375, line: 589, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 575, size: 768, elements: !1414)
!1414 = !{!1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1413, file: !1375, line: 576, baseType: !878, size: 32)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1413, file: !1375, line: 577, baseType: !825, size: 64, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1413, file: !1375, line: 578, baseType: !878, size: 32, offset: 128)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1413, file: !1375, line: 579, baseType: !1387, size: 64, offset: 192)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1413, file: !1375, line: 580, baseType: !1358, size: 64, offset: 256)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1413, file: !1375, line: 581, baseType: !1358, size: 64, offset: 320)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1413, file: !1375, line: 582, baseType: !1358, size: 64, offset: 384)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1413, file: !1375, line: 583, baseType: !1403, size: 64, offset: 448)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1413, file: !1375, line: 584, baseType: !878, size: 32, offset: 512)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1413, file: !1375, line: 584, baseType: !878, size: 32, offset: 544)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1413, file: !1375, line: 585, baseType: !878, size: 32, offset: 576)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1413, file: !1375, line: 585, baseType: !878, size: 32, offset: 608)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1413, file: !1375, line: 586, baseType: !829, size: 32, offset: 640)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !1413, file: !1375, line: 587, baseType: !829, size: 32, offset: 672)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !1413, file: !1375, line: 588, baseType: !878, size: 32, offset: 704)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "xmotion", scope: !1376, file: !1375, line: 978, baseType: !1431, size: 768)
!1431 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMotionEvent", file: !1375, line: 607, baseType: !1432)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 593, size: 768, elements: !1433)
!1433 = !{!1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1432, file: !1375, line: 594, baseType: !878, size: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1432, file: !1375, line: 595, baseType: !825, size: 64, offset: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1432, file: !1375, line: 596, baseType: !878, size: 32, offset: 128)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1432, file: !1375, line: 597, baseType: !1387, size: 64, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1432, file: !1375, line: 598, baseType: !1358, size: 64, offset: 256)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1432, file: !1375, line: 599, baseType: !1358, size: 64, offset: 320)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1432, file: !1375, line: 600, baseType: !1358, size: 64, offset: 384)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1432, file: !1375, line: 601, baseType: !1403, size: 64, offset: 448)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1432, file: !1375, line: 602, baseType: !878, size: 32, offset: 512)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1432, file: !1375, line: 602, baseType: !878, size: 32, offset: 544)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1432, file: !1375, line: 603, baseType: !878, size: 32, offset: 576)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1432, file: !1375, line: 603, baseType: !878, size: 32, offset: 608)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1432, file: !1375, line: 604, baseType: !829, size: 32, offset: 640)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "is_hint", scope: !1432, file: !1375, line: 605, baseType: !773, size: 8, offset: 672)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !1432, file: !1375, line: 606, baseType: !878, size: 32, offset: 704)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "xcrossing", scope: !1376, file: !1375, line: 979, baseType: !1450, size: 832)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCrossingEvent", file: !1375, line: 630, baseType: !1451)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 610, size: 832, elements: !1452)
!1452 = !{!1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1451, file: !1375, line: 611, baseType: !878, size: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1451, file: !1375, line: 612, baseType: !825, size: 64, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1451, file: !1375, line: 613, baseType: !878, size: 32, offset: 128)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1451, file: !1375, line: 614, baseType: !1387, size: 64, offset: 192)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1451, file: !1375, line: 615, baseType: !1358, size: 64, offset: 256)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1451, file: !1375, line: 616, baseType: !1358, size: 64, offset: 320)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1451, file: !1375, line: 617, baseType: !1358, size: 64, offset: 384)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1451, file: !1375, line: 618, baseType: !1403, size: 64, offset: 448)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1451, file: !1375, line: 619, baseType: !878, size: 32, offset: 512)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1451, file: !1375, line: 619, baseType: !878, size: 32, offset: 544)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1451, file: !1375, line: 620, baseType: !878, size: 32, offset: 576)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1451, file: !1375, line: 620, baseType: !878, size: 32, offset: 608)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1451, file: !1375, line: 621, baseType: !878, size: 32, offset: 640)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !1451, file: !1375, line: 622, baseType: !878, size: 32, offset: 672)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !1451, file: !1375, line: 627, baseType: !878, size: 32, offset: 704)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "focus", scope: !1451, file: !1375, line: 628, baseType: !878, size: 32, offset: 736)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1451, file: !1375, line: 629, baseType: !829, size: 32, offset: 768)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "xfocus", scope: !1376, file: !1375, line: 980, baseType: !1471, size: 384)
!1471 = !DIDerivedType(tag: DW_TAG_typedef, name: "XFocusChangeEvent", file: !1375, line: 648, baseType: !1472)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 634, size: 384, elements: !1473)
!1473 = !{!1474, !1475, !1476, !1477, !1478, !1479, !1480}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1472, file: !1375, line: 635, baseType: !878, size: 32)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1472, file: !1375, line: 636, baseType: !825, size: 64, offset: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1472, file: !1375, line: 637, baseType: !878, size: 32, offset: 128)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1472, file: !1375, line: 638, baseType: !1387, size: 64, offset: 192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1472, file: !1375, line: 639, baseType: !1358, size: 64, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1472, file: !1375, line: 640, baseType: !878, size: 32, offset: 320)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !1472, file: !1375, line: 642, baseType: !878, size: 32, offset: 352)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "xexpose", scope: !1376, file: !1375, line: 981, baseType: !1482, size: 512)
!1482 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExposeEvent", file: !1375, line: 671, baseType: !1483)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 662, size: 512, elements: !1484)
!1484 = !{!1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1483, file: !1375, line: 663, baseType: !878, size: 32)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1483, file: !1375, line: 664, baseType: !825, size: 64, offset: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1483, file: !1375, line: 665, baseType: !878, size: 32, offset: 128)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1483, file: !1375, line: 666, baseType: !1387, size: 64, offset: 192)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1483, file: !1375, line: 667, baseType: !1358, size: 64, offset: 256)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1483, file: !1375, line: 668, baseType: !878, size: 32, offset: 320)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1483, file: !1375, line: 668, baseType: !878, size: 32, offset: 352)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1483, file: !1375, line: 669, baseType: !878, size: 32, offset: 384)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1483, file: !1375, line: 669, baseType: !878, size: 32, offset: 416)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1483, file: !1375, line: 670, baseType: !878, size: 32, offset: 448)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "xgraphicsexpose", scope: !1376, file: !1375, line: 982, baseType: !1496, size: 576)
!1496 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGraphicsExposeEvent", file: !1375, line: 684, baseType: !1497)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 673, size: 576, elements: !1498)
!1498 = !{!1499, !1500, !1501, !1502, !1503, !1505, !1506, !1507, !1508, !1509, !1510, !1511}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1497, file: !1375, line: 674, baseType: !878, size: 32)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1497, file: !1375, line: 675, baseType: !825, size: 64, offset: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1497, file: !1375, line: 676, baseType: !878, size: 32, offset: 128)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1497, file: !1375, line: 677, baseType: !1387, size: 64, offset: 192)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !1497, file: !1375, line: 678, baseType: !1504, size: 64, offset: 256)
!1504 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !1359, line: 97, baseType: !1360)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1497, file: !1375, line: 679, baseType: !878, size: 32, offset: 320)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1497, file: !1375, line: 679, baseType: !878, size: 32, offset: 352)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1497, file: !1375, line: 680, baseType: !878, size: 32, offset: 384)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1497, file: !1375, line: 680, baseType: !878, size: 32, offset: 416)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1497, file: !1375, line: 681, baseType: !878, size: 32, offset: 448)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !1497, file: !1375, line: 682, baseType: !878, size: 32, offset: 480)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !1497, file: !1375, line: 683, baseType: !878, size: 32, offset: 512)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "xnoexpose", scope: !1376, file: !1375, line: 983, baseType: !1513, size: 384)
!1513 = !DIDerivedType(tag: DW_TAG_typedef, name: "XNoExposeEvent", file: !1375, line: 694, baseType: !1514)
!1514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 686, size: 384, elements: !1515)
!1515 = !{!1516, !1517, !1518, !1519, !1520, !1521, !1522}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1514, file: !1375, line: 687, baseType: !878, size: 32)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1514, file: !1375, line: 688, baseType: !825, size: 64, offset: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1514, file: !1375, line: 689, baseType: !878, size: 32, offset: 128)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1514, file: !1375, line: 690, baseType: !1387, size: 64, offset: 192)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !1514, file: !1375, line: 691, baseType: !1504, size: 64, offset: 256)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !1514, file: !1375, line: 692, baseType: !878, size: 32, offset: 320)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !1514, file: !1375, line: 693, baseType: !878, size: 32, offset: 352)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "xvisibility", scope: !1376, file: !1375, line: 984, baseType: !1524, size: 384)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "XVisibilityEvent", file: !1375, line: 703, baseType: !1525)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 696, size: 384, elements: !1526)
!1526 = !{!1527, !1528, !1529, !1530, !1531, !1532}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1525, file: !1375, line: 697, baseType: !878, size: 32)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1525, file: !1375, line: 698, baseType: !825, size: 64, offset: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1525, file: !1375, line: 699, baseType: !878, size: 32, offset: 128)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1525, file: !1375, line: 700, baseType: !1387, size: 64, offset: 192)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1525, file: !1375, line: 701, baseType: !1358, size: 64, offset: 256)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1525, file: !1375, line: 702, baseType: !878, size: 32, offset: 320)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "xcreatewindow", scope: !1376, file: !1375, line: 985, baseType: !1534, size: 576)
!1534 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCreateWindowEvent", file: !1375, line: 716, baseType: !1535)
!1535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 705, size: 576, elements: !1536)
!1536 = !{!1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1535, file: !1375, line: 706, baseType: !878, size: 32)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1535, file: !1375, line: 707, baseType: !825, size: 64, offset: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1535, file: !1375, line: 708, baseType: !878, size: 32, offset: 128)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1535, file: !1375, line: 709, baseType: !1387, size: 64, offset: 192)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1535, file: !1375, line: 710, baseType: !1358, size: 64, offset: 256)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1535, file: !1375, line: 711, baseType: !1358, size: 64, offset: 320)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1535, file: !1375, line: 712, baseType: !878, size: 32, offset: 384)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1535, file: !1375, line: 712, baseType: !878, size: 32, offset: 416)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1535, file: !1375, line: 713, baseType: !878, size: 32, offset: 448)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1535, file: !1375, line: 713, baseType: !878, size: 32, offset: 480)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !1535, file: !1375, line: 714, baseType: !878, size: 32, offset: 512)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !1535, file: !1375, line: 715, baseType: !878, size: 32, offset: 544)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "xdestroywindow", scope: !1376, file: !1375, line: 986, baseType: !1550, size: 384)
!1550 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDestroyWindowEvent", file: !1375, line: 725, baseType: !1551)
!1551 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 718, size: 384, elements: !1552)
!1552 = !{!1553, !1554, !1555, !1556, !1557, !1558}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1551, file: !1375, line: 719, baseType: !878, size: 32)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1551, file: !1375, line: 720, baseType: !825, size: 64, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1551, file: !1375, line: 721, baseType: !878, size: 32, offset: 128)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1551, file: !1375, line: 722, baseType: !1387, size: 64, offset: 192)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1551, file: !1375, line: 723, baseType: !1358, size: 64, offset: 256)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1551, file: !1375, line: 724, baseType: !1358, size: 64, offset: 320)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "xunmap", scope: !1376, file: !1375, line: 987, baseType: !1560, size: 448)
!1560 = !DIDerivedType(tag: DW_TAG_typedef, name: "XUnmapEvent", file: !1375, line: 735, baseType: !1561)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 727, size: 448, elements: !1562)
!1562 = !{!1563, !1564, !1565, !1566, !1567, !1568, !1569}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1561, file: !1375, line: 728, baseType: !878, size: 32)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1561, file: !1375, line: 729, baseType: !825, size: 64, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1561, file: !1375, line: 730, baseType: !878, size: 32, offset: 128)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1561, file: !1375, line: 731, baseType: !1387, size: 64, offset: 192)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1561, file: !1375, line: 732, baseType: !1358, size: 64, offset: 256)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1561, file: !1375, line: 733, baseType: !1358, size: 64, offset: 320)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "from_configure", scope: !1561, file: !1375, line: 734, baseType: !878, size: 32, offset: 384)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "xmap", scope: !1376, file: !1375, line: 988, baseType: !1571, size: 448)
!1571 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapEvent", file: !1375, line: 745, baseType: !1572)
!1572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 737, size: 448, elements: !1573)
!1573 = !{!1574, !1575, !1576, !1577, !1578, !1579, !1580}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1572, file: !1375, line: 738, baseType: !878, size: 32)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1572, file: !1375, line: 739, baseType: !825, size: 64, offset: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1572, file: !1375, line: 740, baseType: !878, size: 32, offset: 128)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1572, file: !1375, line: 741, baseType: !1387, size: 64, offset: 192)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1572, file: !1375, line: 742, baseType: !1358, size: 64, offset: 256)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1572, file: !1375, line: 743, baseType: !1358, size: 64, offset: 320)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !1572, file: !1375, line: 744, baseType: !878, size: 32, offset: 384)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "xmaprequest", scope: !1376, file: !1375, line: 989, baseType: !1582, size: 384)
!1582 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapRequestEvent", file: !1375, line: 754, baseType: !1583)
!1583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1375, line: 747, size: 384, elements: !1584)
!1584 = !{!1585, !1586, !1587, !1588, !1589, !1590}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1583, file: !1375, line: 748, baseType: !878, size: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1583, file: !1375, line: 749, baseType: !825, size: 64, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1583, file: !1375, line: 750, baseType: !878, size: 32, offset: 128)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1583, file: !1375, line: 751, baseType: !1387, size: 64, offset: 192)
