; ModuleID = 'gui_xim.c'
source_filename = "gui_xim.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GtkIMContext = type { %struct._GObject }
%struct._GObject = type { %struct._GTypeInstance, i32, %struct._GData* }
%struct._GTypeInstance = type { %struct._GTypeClass* }
%struct._GTypeClass = type { i64 }
%struct._GData = type opaque
%struct.Gui = type { i32, i32, i32, i32, i32, i32, i32, %struct.window_S*, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, %struct.GuiScrollbar, [3 x i32], i32, i32, i32, i32, i32, i32, %struct._PangoFontDescription*, i32, %struct._PangoFontDescription*, i64, i64, i64, i64, i32, %struct._GdkCursor*, i8*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GdkColor*, %struct._GdkColor*, %struct._GdkColor*, %struct._GdkGC*, %struct._PangoContext*, %struct._PangoFont*, %struct._PangoGlyphString*, %struct._GtkWidget*, %struct._GtkAccelGroup*, %struct._GtkWidget*, i8*, i32, i8*, i8* }

!264 = !DIEnumerator(name: "GDK_CROSSING_GTK_GRAB", value: 3)
!265 = !DIEnumerator(name: "GDK_CROSSING_GTK_UNGRAB", value: 4)
!266 = !DIEnumerator(name: "GDK_CROSSING_STATE_CHANGED", value: 5)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 210, size: 32, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274}
!269 = !DIEnumerator(name: "GDK_NOTIFY_ANCESTOR", value: 0)
!270 = !DIEnumerator(name: "GDK_NOTIFY_VIRTUAL", value: 1)
!271 = !DIEnumerator(name: "GDK_NOTIFY_INFERIOR", value: 2)
!272 = !DIEnumerator(name: "GDK_NOTIFY_NONLINEAR", value: 3)
!273 = !DIEnumerator(name: "GDK_NOTIFY_NONLINEAR_VIRTUAL", value: 4)
!274 = !DIEnumerator(name: "GDK_NOTIFY_UNKNOWN", value: 5)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 259, size: 32, elements: !276)
!276 = !{!277, !278, !279}
!277 = !DIEnumerator(name: "GDK_OWNER_CHANGE_NEW_OWNER", value: 0)
!278 = !DIEnumerator(name: "GDK_OWNER_CHANGE_DESTROY", value: 1)
!279 = !DIEnumerator(name: "GDK_OWNER_CHANGE_CLOSE", value: 2)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !281, line: 50, size: 32, elements: !282)
!281 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkdnd.h", directory: "/home/sahil/vim/src")
!282 = !{!283, !284, !285, !286, !287, !288, !289}
!283 = !DIEnumerator(name: "GDK_DRAG_PROTO_MOTIF", value: 0)
!284 = !DIEnumerator(name: "GDK_DRAG_PROTO_XDND", value: 1)
!285 = !DIEnumerator(name: "GDK_DRAG_PROTO_ROOTWIN", value: 2)
!286 = !DIEnumerator(name: "GDK_DRAG_PROTO_NONE", value: 3)
!287 = !DIEnumerator(name: "GDK_DRAG_PROTO_WIN32_DROPFILES", value: 4)
!288 = !DIEnumerator(name: "GDK_DRAG_PROTO_OLE2", value: 5)
!289 = !DIEnumerator(name: "GDK_DRAG_PROTO_LOCAL", value: 6)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !281, line: 40, size: 32, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297}
!292 = !DIEnumerator(name: "GDK_ACTION_DEFAULT", value: 1)
!293 = !DIEnumerator(name: "GDK_ACTION_COPY", value: 2)
!294 = !DIEnumerator(name: "GDK_ACTION_MOVE", value: 4)
!295 = !DIEnumerator(name: "GDK_ACTION_LINK", value: 8)
!296 = !DIEnumerator(name: "GDK_ACTION_PRIVATE", value: 16)
!297 = !DIEnumerator(name: "GDK_ACTION_ASK", value: 32)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 241, size: 32, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305, !306}
!300 = !DIEnumerator(name: "GDK_WINDOW_STATE_WITHDRAWN", value: 1)
!301 = !DIEnumerator(name: "GDK_WINDOW_STATE_ICONIFIED", value: 2)
!302 = !DIEnumerator(name: "GDK_WINDOW_STATE_MAXIMIZED", value: 4)
!303 = !DIEnumerator(name: "GDK_WINDOW_STATE_STICKY", value: 8)
!304 = !DIEnumerator(name: "GDK_WINDOW_STATE_FULLSCREEN", value: 16)
!305 = !DIEnumerator(name: "GDK_WINDOW_STATE_ABOVE", value: 32)
!306 = !DIEnumerator(name: "GDK_WINDOW_STATE_BELOW", value: 64)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 252, size: 32, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIEnumerator(name: "GDK_SETTING_ACTION_NEW", value: 0)
!310 = !DIEnumerator(name: "GDK_SETTING_ACTION_CHANGED", value: 1)
!311 = !DIEnumerator(name: "GDK_SETTING_ACTION_DELETED", value: 2)
!312 = !{!313, !314, !318, !322, !324, !353, !340, !354, !359, !360, !361, !643, !678, !690, !691, !347, !692, !739, !757, !760}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !316, line: 324, baseType: !317)
!316 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!317 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !320, line: 46, baseType: !321)
!320 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/sahil/vim/src")
!321 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "GObject", file: !326, line: 187, baseType: !327)
!326 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gobject.h", directory: "/home/sahil/vim/src")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GObject", file: !326, line: 245, size: 192, elements: !328)
!328 = !{!329, !344, !348}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "g_type_instance", scope: !327, file: !326, line: 247, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeInstance", file: !331, line: 393, baseType: !332)
!331 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gtype.h", directory: "/home/sahil/vim/src")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeInstance", file: !331, line: 418, size: 64, elements: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "g_class", scope: !332, file: !331, line: 421, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeClass", file: !331, line: 391, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeClass", file: !331, line: 408, size: 64, elements: !338)
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !337, file: !331, line: 411, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "GType", file: !331, line: 384, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !342, line: 78, baseType: !343)
!342 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/sahil/vim/src")
!343 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !327, file: !326, line: 250, baseType: !345, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !320, line: 55, baseType: !347)
!347 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !327, file: !326, line: 251, baseType: !349, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !351, line: 36, baseType: !352)
!351 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/sahil/vim/src")
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !351, line: 36, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCallback", file: !355, line: 86, baseType: !356)
!355 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gclosure.h", directory: "/home/sahil/vim/src")
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{null}
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "GConnectFlags", file: !6, line: 159, baseType: !5)
!360 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWindow", file: !363, line: 485, baseType: !364)
!363 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkwidget.h", directory: "/home/sahil/vim/src")
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWindow", file: !365, line: 54, size: 1920, elements: !366)
!365 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkwindow.h", directory: "/home/sahil/vim/src")
!366 = !{!367, !575, !576, !577, !578, !579, !580, !581, !582, !586, !587, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !622}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bin", scope: !364, file: !365, line: 56, baseType: !368, size: 960)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkBin", file: !369, line: 48, baseType: !370)
!369 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkbin.h", directory: "/home/sahil/vim/src")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkBin", file: !369, line: 51, size: 960, elements: !371)
!371 = !{!372, !574}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !370, file: !369, line: 53, baseType: !373, size: 896)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkContainer", file: !374, line: 51, baseType: !375)
!374 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkcontainer.h", directory: "/home/sahil/vim/src")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkContainer", file: !374, line: 54, size: 896, elements: !376)
!376 = !{!377, !568, !569, !570, !571, !572, !573}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "widget", scope: !375, file: !374, line: 56, baseType: !378, size: 768)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWidget", file: !379, line: 69, baseType: !380)
!379 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkstyle.h", directory: "/home/sahil/vim/src")
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWidget", file: !363, line: 530, size: 768, elements: !381)
!381 = !{!382, !392, !395, !397, !398, !399, !548, !554, !563, !566}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !380, file: !363, line: 538, baseType: !383, size: 256)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkObject", file: !384, line: 49, baseType: !385)
!384 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtktypeutils.h", directory: "/home/sahil/vim/src")
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkObject", file: !386, line: 107, size: 256, elements: !387)
!386 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkobject.h", directory: "/home/sahil/vim/src")
!387 = !{!388, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !385, file: !386, line: 109, baseType: !389, size: 192)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInitiallyUnowned", file: !326, line: 189, baseType: !327)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !385, file: !386, line: 116, baseType: !391, size: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !342, line: 52, baseType: !347)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "private_flags", scope: !380, file: !363, line: 545, baseType: !393, size: 16, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint16", file: !342, line: 44, baseType: !394)
!394 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !380, file: !363, line: 550, baseType: !396, size: 8, offset: 272)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint8", file: !342, line: 41, baseType: !317)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "saved_state", scope: !380, file: !363, line: 558, baseType: !396, size: 8, offset: 280)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !380, file: !363, line: 566, baseType: !318, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !380, file: !363, line: 575, baseType: !400, size: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkStyle", file: !379, line: 54, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkStyle", file: !379, line: 73, size: 7872, elements: !403)
!403 = !{!404, !405, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !430, !432, !433, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !495, !496, !497, !498, !507, !508, !545, !546, !547}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !402, file: !379, line: 75, baseType: !325, size: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fg", scope: !402, file: !379, line: 79, baseType: !406, size: 480, offset: 192)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 480, elements: !415)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkColor", file: !53, line: 102, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkColor", file: !409, line: 46, size: 96, elements: !410)
!409 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkcolor.h", directory: "/home/sahil/vim/src")
!410 = !{!411, !412, !413, !414}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !408, file: !409, line: 48, baseType: !391, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !408, file: !409, line: 49, baseType: !393, size: 16, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !408, file: !409, line: 50, baseType: !393, size: 16, offset: 48)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !408, file: !409, line: 51, baseType: !393, size: 16, offset: 64)
!415 = !{!416}
!416 = !DISubrange(count: 5)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !402, file: !379, line: 80, baseType: !406, size: 480, offset: 672)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "light", scope: !402, file: !379, line: 81, baseType: !406, size: 480, offset: 1152)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dark", scope: !402, file: !379, line: 82, baseType: !406, size: 480, offset: 1632)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !402, file: !379, line: 83, baseType: !406, size: 480, offset: 2112)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !402, file: !379, line: 84, baseType: !406, size: 480, offset: 2592)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !402, file: !379, line: 85, baseType: !406, size: 480, offset: 3072)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "text_aa", scope: !402, file: !379, line: 86, baseType: !406, size: 480, offset: 3552)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !402, file: !379, line: 88, baseType: !407, size: 96, offset: 4032)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !402, file: !379, line: 89, baseType: !407, size: 96, offset: 4128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "font_desc", scope: !402, file: !379, line: 90, baseType: !427, size: 64, offset: 4224)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoFontDescription", file: !138, line: 41, baseType: !429)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoFontDescription", file: !138, line: 41, flags: DIFlagFwdDecl)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "xthickness", scope: !402, file: !379, line: 92, baseType: !431, size: 32, offset: 4288)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !320, line: 49, baseType: !360)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ythickness", scope: !402, file: !379, line: 93, baseType: !431, size: 32, offset: 4320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "fg_gc", scope: !402, file: !379, line: 95, baseType: !434, size: 320, offset: 4352)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 320, elements: !415)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkGC", file: !53, line: 106, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkGC", file: !438, line: 189, size: 384, elements: !439)
!438 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkgc.h", directory: "/home/sahil/vim/src")
!439 = !{!440, !441, !442, !443, !444, !445}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !437, file: !438, line: 191, baseType: !325, size: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "clip_x_origin", scope: !437, file: !438, line: 193, baseType: !431, size: 32, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "clip_y_origin", scope: !437, file: !438, line: 194, baseType: !431, size: 32, offset: 224)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ts_x_origin", scope: !437, file: !438, line: 195, baseType: !431, size: 32, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ts_y_origin", scope: !437, file: !438, line: 196, baseType: !431, size: 32, offset: 288)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !437, file: !438, line: 198, baseType: !446, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkColormap", file: !53, line: 103, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkColormap", file: !409, line: 68, size: 448, elements: !449)
!449 = !{!450, !451, !452, !454, !476}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !448, file: !409, line: 71, baseType: !325, size: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !448, file: !409, line: 74, baseType: !431, size: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !448, file: !409, line: 75, baseType: !453, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !448, file: !409, line: 78, baseType: !455, size: 64, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisual", file: !53, line: 109, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkVisual", file: !74, line: 77, size: 640, elements: !458)
!458 = !{!459, !460, !462, !463, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !457, file: !74, line: 79, baseType: !325, size: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !457, file: !74, line: 81, baseType: !461, size: 32, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisualType", file: !74, line: 63, baseType: !73)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !457, file: !74, line: 82, baseType: !431, size: 32, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !457, file: !74, line: 83, baseType: !464, size: 32, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkByteOrder", file: !53, line: 122, baseType: !82)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "colormap_size", scope: !457, file: !74, line: 84, baseType: !431, size: 32, offset: 288)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !457, file: !74, line: 85, baseType: !431, size: 32, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !457, file: !74, line: 87, baseType: !391, size: 32, offset: 352)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "red_shift", scope: !457, file: !74, line: 88, baseType: !431, size: 32, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "red_prec", scope: !457, file: !74, line: 89, baseType: !431, size: 32, offset: 416)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !457, file: !74, line: 91, baseType: !391, size: 32, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "green_shift", scope: !457, file: !74, line: 92, baseType: !431, size: 32, offset: 480)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "green_prec", scope: !457, file: !74, line: 93, baseType: !431, size: 32, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !457, file: !74, line: 95, baseType: !391, size: 32, offset: 544)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "blue_shift", scope: !457, file: !74, line: 96, baseType: !431, size: 32, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "blue_prec", scope: !457, file: !74, line: 97, baseType: !431, size: 32, offset: 608)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "windowing_data", scope: !448, file: !409, line: 80, baseType: !477, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !320, line: 103, baseType: !313)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "bg_gc", scope: !402, file: !379, line: 96, baseType: !434, size: 320, offset: 4672)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "light_gc", scope: !402, file: !379, line: 97, baseType: !434, size: 320, offset: 4992)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dark_gc", scope: !402, file: !379, line: 98, baseType: !434, size: 320, offset: 5312)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mid_gc", scope: !402, file: !379, line: 99, baseType: !434, size: 320, offset: 5632)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "text_gc", scope: !402, file: !379, line: 100, baseType: !434, size: 320, offset: 5952)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "base_gc", scope: !402, file: !379, line: 101, baseType: !434, size: 320, offset: 6272)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "text_aa_gc", scope: !402, file: !379, line: 102, baseType: !434, size: 320, offset: 6592)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "black_gc", scope: !402, file: !379, line: 103, baseType: !435, size: 64, offset: 6912)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "white_gc", scope: !402, file: !379, line: 104, baseType: !435, size: 64, offset: 6976)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bg_pixmap", scope: !402, file: !379, line: 106, baseType: !488, size: 320, offset: 7040)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 320, elements: !415)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkPixmap", file: !53, line: 113, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDrawable", file: !492, line: 53, size: 192, elements: !493)
!492 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkdrawable.h", directory: "/home/sahil/vim/src")
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !491, file: !492, line: 55, baseType: !325, size: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "attach_count", scope: !402, file: !379, line: 110, baseType: !431, size: 32, offset: 7360)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !402, file: !379, line: 112, baseType: !431, size: 32, offset: 7392)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !402, file: !379, line: 113, baseType: !446, size: 64, offset: 7424)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "private_font", scope: !402, file: !379, line: 114, baseType: !499, size: 64, offset: 7488)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkFont", file: !53, line: 105, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkFont", file: !87, line: 49, size: 96, elements: !502)
!502 = !{!503, !505, !506}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !501, file: !87, line: 51, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkFontType", file: !87, line: 47, baseType: !86)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !501, file: !87, line: 52, baseType: !431, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !501, file: !87, line: 53, baseType: !431, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "private_font_desc", scope: !402, file: !379, line: 115, baseType: !427, size: 64, offset: 7552)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rc_style", scope: !402, file: !379, line: 118, baseType: !509, size: 64, offset: 7616)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRcStyle", file: !379, line: 57, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkRcStyle", file: !92, line: 60, size: 3072, elements: !512)
!512 = !{!513, !514, !515, !517, !518, !521, !522, !523, !524, !525, !526, !527, !535, !543, !544}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !511, file: !92, line: 62, baseType: !325, size: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !511, file: !92, line: 66, baseType: !318, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bg_pixmap_name", scope: !511, file: !92, line: 67, baseType: !516, size: 320, offset: 256)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 320, elements: !415)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "font_desc", scope: !511, file: !92, line: 68, baseType: !427, size: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "color_flags", scope: !511, file: !92, line: 70, baseType: !519, size: 160, offset: 640)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 160, elements: !415)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRcFlags", file: !92, line: 58, baseType: !91)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fg", scope: !511, file: !92, line: 71, baseType: !406, size: 480, offset: 800)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !511, file: !92, line: 72, baseType: !406, size: 480, offset: 1280)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !511, file: !92, line: 73, baseType: !406, size: 480, offset: 1760)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !511, file: !92, line: 74, baseType: !406, size: 480, offset: 2240)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "xthickness", scope: !511, file: !92, line: 76, baseType: !431, size: 32, offset: 2720)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ythickness", scope: !511, file: !92, line: 77, baseType: !431, size: 32, offset: 2752)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rc_properties", scope: !511, file: !92, line: 80, baseType: !528, size: 64, offset: 2816)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !530, line: 37, baseType: !531)
!530 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/sahil/vim/src")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !530, line: 41, size: 128, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !531, file: !530, line: 43, baseType: !318, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !531, file: !530, line: 44, baseType: !346, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "rc_style_lists", scope: !511, file: !92, line: 83, baseType: !536, size: 64, offset: 2880)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !538, line: 37, baseType: !539)
!538 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/sahil/vim/src")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !538, line: 39, size: 128, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !539, file: !538, line: 41, baseType: !477, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !539, file: !538, line: 42, baseType: !536, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "icon_factories", scope: !511, file: !92, line: 85, baseType: !536, size: 64, offset: 2944)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "engine_specified", scope: !511, file: !92, line: 87, baseType: !346, size: 1, offset: 3008, flags: DIFlagBitField, extraData: i64 3008)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "styles", scope: !402, file: !379, line: 120, baseType: !536, size: 64, offset: 7680)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "property_cache", scope: !402, file: !379, line: 121, baseType: !528, size: 64, offset: 7744)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "icon_factories", scope: !402, file: !379, line: 122, baseType: !536, size: 64, offset: 7808)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "requisition", scope: !380, file: !363, line: 579, baseType: !549, size: 64, offset: 448)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkRequisition", file: !363, line: 478, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkRequisition", file: !363, line: 519, size: 64, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !550, file: !363, line: 521, baseType: !431, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !550, file: !363, line: 522, baseType: !431, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "allocation", scope: !380, file: !363, line: 583, baseType: !555, size: 128, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkAllocation", file: !363, line: 498, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkRectangle", file: !53, line: 69, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkRectangle", file: !53, line: 200, size: 128, elements: !558)
!558 = !{!559, !560, !561, !562}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !557, file: !53, line: 202, baseType: !431, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !557, file: !53, line: 203, baseType: !431, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !557, file: !53, line: 204, baseType: !431, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !557, file: !53, line: 205, baseType: !431, size: 32, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !380, file: !363, line: 589, baseType: !564, size: 64, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkWindow", file: !53, line: 114, baseType: !491)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !380, file: !363, line: 593, baseType: !567, size: 64, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "focus_child", scope: !375, file: !374, line: 58, baseType: !567, size: 64, offset: 768)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !375, file: !374, line: 60, baseType: !346, size: 16, offset: 832, flags: DIFlagBitField, extraData: i64 832)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "need_resize", scope: !375, file: !374, line: 63, baseType: !346, size: 1, offset: 848, flags: DIFlagBitField, extraData: i64 832)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "resize_mode", scope: !375, file: !374, line: 64, baseType: !346, size: 2, offset: 849, flags: DIFlagBitField, extraData: i64 832)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reallocate_redraws", scope: !375, file: !374, line: 65, baseType: !346, size: 1, offset: 851, flags: DIFlagBitField, extraData: i64 832)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "has_focus_chain", scope: !375, file: !374, line: 66, baseType: !346, size: 1, offset: 852, flags: DIFlagBitField, extraData: i64 832)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !370, file: !369, line: 55, baseType: !567, size: 64, offset: 896)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !364, file: !365, line: 58, baseType: !318, size: 64, offset: 960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "wmclass_name", scope: !364, file: !365, line: 59, baseType: !318, size: 64, offset: 1024)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "wmclass_class", scope: !364, file: !365, line: 60, baseType: !318, size: 64, offset: 1088)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "wm_role", scope: !364, file: !365, line: 61, baseType: !318, size: 64, offset: 1152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "focus_widget", scope: !364, file: !365, line: 63, baseType: !567, size: 64, offset: 1216)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "default_widget", scope: !364, file: !365, line: 64, baseType: !567, size: 64, offset: 1280)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "transient_parent", scope: !364, file: !365, line: 65, baseType: !361, size: 64, offset: 1344)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "geometry_info", scope: !364, file: !365, line: 66, baseType: !583, size: 64, offset: 1408)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWindowGeometryInfo", file: !365, line: 50, baseType: !585)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWindowGeometryInfo", file: !365, line: 50, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !364, file: !365, line: 67, baseType: !564, size: 64, offset: 1472)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !364, file: !365, line: 68, baseType: !588, size: 64, offset: 1536)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkWindowGroup", file: !365, line: 51, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkWindowGroup", file: !365, line: 154, size: 256, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !590, file: !365, line: 156, baseType: !325, size: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "grabs", scope: !590, file: !365, line: 158, baseType: !536, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "configure_request_count", scope: !364, file: !365, line: 70, baseType: !393, size: 16, offset: 1600)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "allow_shrink", scope: !364, file: !365, line: 71, baseType: !346, size: 1, offset: 1616, flags: DIFlagBitField, extraData: i64 1616)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "allow_grow", scope: !364, file: !365, line: 72, baseType: !346, size: 1, offset: 1617, flags: DIFlagBitField, extraData: i64 1616)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "configure_notify_received", scope: !364, file: !365, line: 73, baseType: !346, size: 1, offset: 1618, flags: DIFlagBitField, extraData: i64 1616)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "need_default_position", scope: !364, file: !365, line: 80, baseType: !346, size: 1, offset: 1619, flags: DIFlagBitField, extraData: i64 1616)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "need_default_size", scope: !364, file: !365, line: 81, baseType: !346, size: 1, offset: 1620, flags: DIFlagBitField, extraData: i64 1616)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !364, file: !365, line: 82, baseType: !346, size: 3, offset: 1621, flags: DIFlagBitField, extraData: i64 1616)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !365, line: 83, baseType: !346, size: 4, offset: 1624, flags: DIFlagBitField, extraData: i64 1616)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "has_user_ref_count", scope: !364, file: !365, line: 84, baseType: !346, size: 1, offset: 1628, flags: DIFlagBitField, extraData: i64 1616)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "has_focus", scope: !364, file: !365, line: 85, baseType: !346, size: 1, offset: 1629, flags: DIFlagBitField, extraData: i64 1616)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !364, file: !365, line: 87, baseType: !346, size: 1, offset: 1630, flags: DIFlagBitField, extraData: i64 1616)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_with_parent", scope: !364, file: !365, line: 88, baseType: !346, size: 1, offset: 1631, flags: DIFlagBitField, extraData: i64 1616)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "has_frame", scope: !364, file: !365, line: 90, baseType: !346, size: 1, offset: 1632, flags: DIFlagBitField, extraData: i64 1616)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "iconify_initially", scope: !364, file: !365, line: 93, baseType: !346, size: 1, offset: 1633, flags: DIFlagBitField, extraData: i64 1616)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "stick_initially", scope: !364, file: !365, line: 94, baseType: !346, size: 1, offset: 1634, flags: DIFlagBitField, extraData: i64 1616)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "maximize_initially", scope: !364, file: !365, line: 95, baseType: !346, size: 1, offset: 1635, flags: DIFlagBitField, extraData: i64 1616)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "decorated", scope: !364, file: !365, line: 96, baseType: !346, size: 1, offset: 1636, flags: DIFlagBitField, extraData: i64 1616)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "type_hint", scope: !364, file: !365, line: 98, baseType: !346, size: 3, offset: 1637, flags: DIFlagBitField, extraData: i64 1616)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !364, file: !365, line: 101, baseType: !346, size: 5, offset: 1640, flags: DIFlagBitField, extraData: i64 1616)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "is_active", scope: !364, file: !365, line: 103, baseType: !346, size: 1, offset: 1645, flags: DIFlagBitField, extraData: i64 1616)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "has_toplevel_focus", scope: !364, file: !365, line: 104, baseType: !346, size: 1, offset: 1646, flags: DIFlagBitField, extraData: i64 1616)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_left", scope: !364, file: !365, line: 106, baseType: !346, size: 32, offset: 1664)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_top", scope: !364, file: !365, line: 107, baseType: !346, size: 32, offset: 1696)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_right", scope: !364, file: !365, line: 108, baseType: !346, size: 32, offset: 1728)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bottom", scope: !364, file: !365, line: 109, baseType: !346, size: 32, offset: 1760)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "keys_changed_handler", scope: !364, file: !365, line: 111, baseType: !346, size: 32, offset: 1792)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_modifier", scope: !364, file: !365, line: 113, baseType: !621, size: 32, offset: 1824)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkModifierType", file: !53, line: 153, baseType: !52)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !364, file: !365, line: 114, baseType: !623, size: 64, offset: 1856)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkScreen", file: !53, line: 116, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkScreen", file: !626, line: 46, size: 6528, elements: !627)
!626 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkscreen.h", directory: "/home/sahil/vim/src")
!627 = !{!628, !629, !630, !634, !635, !636, !641}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !625, file: !626, line: 48, baseType: !325, size: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !625, file: !626, line: 50, baseType: !346, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "normal_gcs", scope: !625, file: !626, line: 52, baseType: !631, size: 2048, offset: 256)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 2048, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "exposure_gcs", scope: !625, file: !626, line: 53, baseType: !631, size: 2048, offset: 2304)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow_gcs", scope: !625, file: !626, line: 54, baseType: !631, size: 2048, offset: 4352)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "font_options", scope: !625, file: !626, line: 56, baseType: !637, size: 64, offset: 6400)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "cairo_font_options_t", file: !639, line: 1385, baseType: !640)
!639 = !DIFile(filename: "/usr/include/cairo/cairo.h", directory: "/home/sahil/vim/src")
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cairo_font_options", file: !639, line: 1385, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !625, file: !626, line: 57, baseType: !642, size: 64, offset: 6464)
!642 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAttrInt", file: !99, line: 80, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoAttrInt", file: !99, line: 341, size: 192, elements: !646)
!646 = !{!647, !677}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !645, file: !99, line: 343, baseType: !648, size: 128)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAttribute", file: !99, line: 75, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoAttribute", file: !99, line: 256, size: 128, elements: !650)
!650 = !{!651, !675, !676}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "klass", scope: !649, file: !99, line: 258, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAttrClass", file: !99, line: 76, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoAttrClass", file: !99, line: 298, size: 256, elements: !656)
!656 = !{!657, !659, !666, !670}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !655, file: !99, line: 301, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAttrType", file: !99, line: 192, baseType: !98)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !655, file: !99, line: 302, baseType: !660, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !655, file: !99, line: 303, baseType: !667, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !663}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !655, file: !99, line: 304, baseType: !671, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!674, !664, !664}
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !320, line: 50, baseType: !431)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "start_index", scope: !649, file: !99, line: 259, baseType: !346, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "end_index", scope: !649, file: !99, line: 260, baseType: !346, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !645, file: !99, line: 344, baseType: !360, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAttrColor", file: !99, line: 83, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoAttrColor", file: !99, line: 367, size: 192, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !680, file: !99, line: 369, baseType: !648, size: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !680, file: !99, line: 370, baseType: !684, size: 48, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoColor", file: !99, line: 32, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoColor", file: !99, line: 43, size: 48, elements: !686)
!686 = !{!687, !688, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !685, file: !99, line: 45, baseType: !393, size: 16)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !685, file: !99, line: 46, baseType: !393, size: 16, offset: 16)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !685, file: !99, line: 47, baseType: !393, size: 16, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkLabel", file: !694, line: 49, baseType: !695)
!694 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtklabel.h", directory: "/home/sahil/vim/src")
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkLabel", file: !694, line: 54, size: 1472, elements: !696)
!696 = !{!697, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !727, !728, !733, !734, !735}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !695, file: !694, line: 56, baseType: !698, size: 896)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkMisc", file: !699, line: 48, baseType: !700)
!699 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkmisc.h", directory: "/home/sahil/vim/src")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkMisc", file: !699, line: 51, size: 896, elements: !701)
!701 = !{!702, !703, !706, !707, !708}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "widget", scope: !700, file: !699, line: 53, baseType: !378, size: 768)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "xalign", scope: !700, file: !699, line: 55, baseType: !704, size: 32, offset: 768)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfloat", file: !320, line: 57, baseType: !705)
!705 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "yalign", scope: !700, file: !699, line: 56, baseType: !704, size: 32, offset: 800)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "xpad", scope: !700, file: !699, line: 58, baseType: !393, size: 16, offset: 832)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ypad", scope: !700, file: !699, line: 59, baseType: !393, size: 16, offset: 848)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !695, file: !694, line: 59, baseType: !318, size: 64, offset: 896)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "jtype", scope: !695, file: !694, line: 60, baseType: !346, size: 2, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !695, file: !694, line: 61, baseType: !346, size: 1, offset: 962, flags: DIFlagBitField, extraData: i64 960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "use_underline", scope: !695, file: !694, line: 62, baseType: !346, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "use_markup", scope: !695, file: !694, line: 63, baseType: !346, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ellipsize", scope: !695, file: !694, line: 64, baseType: !346, size: 3, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "single_line_mode", scope: !695, file: !694, line: 65, baseType: !346, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "have_transform", scope: !695, file: !694, line: 66, baseType: !346, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "in_click", scope: !695, file: !694, line: 67, baseType: !346, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_mode", scope: !695, file: !694, line: 68, baseType: !346, size: 3, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_set", scope: !695, file: !694, line: 69, baseType: !346, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "track_links", scope: !695, file: !694, line: 70, baseType: !346, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_keyval", scope: !695, file: !694, line: 72, baseType: !346, size: 32, offset: 992)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !695, file: !694, line: 74, baseType: !318, size: 64, offset: 1024)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !695, file: !694, line: 75, baseType: !724, size: 64, offset: 1088)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoAttrList", file: !99, line: 119, baseType: !726)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoAttrList", file: !99, line: 119, flags: DIFlagFwdDecl)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "effective_attrs", scope: !695, file: !694, line: 76, baseType: !724, size: 64, offset: 1152)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !695, file: !694, line: 78, baseType: !729, size: 64, offset: 1216)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoLayout", file: !731, line: 32, baseType: !732)
!731 = !DIFile(filename: "/usr/include/pango-1.0/pango/pango-layout.h", directory: "/home/sahil/vim/src")
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoLayout", file: !731, line: 32, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_widget", scope: !695, file: !694, line: 80, baseType: !567, size: 64, offset: 1280)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic_window", scope: !695, file: !694, line: 81, baseType: !361, size: 64, offset: 1344)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "select_info", scope: !695, file: !694, line: 83, baseType: !736, size: 64, offset: 1408)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "GtkLabelSelectionInfo", file: !694, line: 52, baseType: !738)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GtkLabelSelectionInfo", file: !694, line: 52, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventKey", file: !11, line: 54, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventKey", file: !11, line: 342, size: 448, elements: !742)
!742 = !{!743, !745, !746, !749, !750, !751, !752, !753, !754, !755, !756}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !741, file: !11, line: 344, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventType", file: !11, line: 156, baseType: !10)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !741, file: !11, line: 345, baseType: !564, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !741, file: !11, line: 346, baseType: !747, size: 8, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint8", file: !342, line: 40, baseType: !748)
!748 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !741, file: !11, line: 347, baseType: !391, size: 32, offset: 160)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !741, file: !11, line: 348, baseType: !346, size: 32, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "keyval", scope: !741, file: !11, line: 349, baseType: !346, size: 32, offset: 224)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !741, file: !11, line: 350, baseType: !431, size: 32, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !741, file: !11, line: 351, baseType: !318, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "hardware_keycode", scope: !741, file: !11, line: 352, baseType: !393, size: 16, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !741, file: !11, line: 353, baseType: !396, size: 8, offset: 400)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "is_modifier", scope: !741, file: !11, line: 354, baseType: !346, size: 1, offset: 408, flags: DIFlagBitField, extraData: i64 408)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeySym", file: !758, line: 106, baseType: !759)
!758 = !DIFile(filename: "/usr/include/X11/X.h", directory: "/home/sahil/vim/src")
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !758, line: 66, baseType: !343)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEvent", file: !11, line: 68, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GdkEvent", file: !11, line: 491, size: 704, elements: !763)
!763 = !{!764, !765, !772, !785, !792, !801, !850, !866, !882, !883, !902, !910, !921, !934, !947, !960, !969, !993, !1030, !1040, !1050}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !762, file: !11, line: 493, baseType: !744, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !762, file: !11, line: 494, baseType: !766, size: 192)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventAny", file: !11, line: 47, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventAny", file: !11, line: 266, size: 192, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !11, line: 268, baseType: !744, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !767, file: !11, line: 269, baseType: !564, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !767, file: !11, line: 270, baseType: !747, size: 8, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "expose", scope: !762, file: !11, line: 495, baseType: !773, size: 448)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventExpose", file: !11, line: 48, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventExpose", file: !11, line: 273, size: 448, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !784}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !774, file: !11, line: 275, baseType: !744, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !774, file: !11, line: 276, baseType: !564, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !774, file: !11, line: 277, baseType: !747, size: 8, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !774, file: !11, line: 278, baseType: !556, size: 128, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !774, file: !11, line: 279, baseType: !781, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkRegion", file: !53, line: 108, baseType: !783)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkRegion", file: !53, line: 108, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !774, file: !11, line: 280, baseType: !431, size: 32, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "no_expose", scope: !762, file: !11, line: 496, baseType: !786, size: 192)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventNoExpose", file: !11, line: 49, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventNoExpose", file: !11, line: 283, size: 192, elements: !788)
!788 = !{!789, !790, !791}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !787, file: !11, line: 285, baseType: !744, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !787, file: !11, line: 286, baseType: !564, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !787, file: !11, line: 287, baseType: !747, size: 8, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !762, file: !11, line: 497, baseType: !793, size: 192)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventVisibility", file: !11, line: 50, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventVisibility", file: !11, line: 290, size: 192, elements: !795)
!795 = !{!796, !797, !798, !799}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !794, file: !11, line: 292, baseType: !744, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !794, file: !11, line: 293, baseType: !564, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !794, file: !11, line: 294, baseType: !747, size: 8, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !794, file: !11, line: 295, baseType: !800, size: 32, offset: 160)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkVisibilityState", file: !11, line: 192, baseType: !226)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !762, file: !11, line: 498, baseType: !802, size: 640)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventMotion", file: !11, line: 51, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventMotion", file: !11, line: 298, size: 640, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !811, !812, !814, !815, !818, !848, !849}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !803, file: !11, line: 300, baseType: !744, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !803, file: !11, line: 301, baseType: !564, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !803, file: !11, line: 302, baseType: !747, size: 8, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !803, file: !11, line: 303, baseType: !391, size: 32, offset: 160)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !803, file: !11, line: 304, baseType: !810, size: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !320, line: 58, baseType: !642)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !803, file: !11, line: 305, baseType: !810, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "axes", scope: !803, file: !11, line: 306, baseType: !813, size: 64, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !803, file: !11, line: 307, baseType: !346, size: 32, offset: 384)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "is_hint", scope: !803, file: !11, line: 308, baseType: !816, size: 16, offset: 416)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint16", file: !342, line: 43, baseType: !817)
!817 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !803, file: !11, line: 309, baseType: !819, size: 64, offset: 448)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDevice", file: !232, line: 47, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDevice", file: !232, line: 98, size: 576, elements: !822)
!822 = !{!823, !824, !825, !827, !829, !830, !831, !840, !841}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !821, file: !232, line: 100, baseType: !325, size: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !821, file: !232, line: 103, baseType: !318, size: 64, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !821, file: !232, line: 104, baseType: !826, size: 32, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkInputSource", file: !232, line: 64, baseType: !231)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !821, file: !232, line: 105, baseType: !828, size: 32, offset: 288)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkInputMode", file: !232, line: 71, baseType: !238)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "has_cursor", scope: !821, file: !232, line: 106, baseType: !674, size: 32, offset: 320)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "num_axes", scope: !821, file: !232, line: 108, baseType: !431, size: 32, offset: 352)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "axes", scope: !821, file: !232, line: 109, baseType: !832, size: 64, offset: 384)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDeviceAxis", file: !232, line: 46, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDeviceAxis", file: !232, line: 91, size: 192, elements: !835)
!835 = !{!836, !838, !839}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !834, file: !232, line: 93, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkAxisUse", file: !232, line: 83, baseType: !243)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !834, file: !232, line: 94, baseType: !810, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !834, file: !232, line: 95, baseType: !810, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "num_keys", scope: !821, file: !232, line: 111, baseType: !431, size: 32, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !821, file: !232, line: 112, baseType: !842, size: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDeviceKey", file: !232, line: 45, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDeviceKey", file: !232, line: 85, size: 64, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "keyval", scope: !844, file: !232, line: 87, baseType: !346, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !844, file: !232, line: 88, baseType: !621, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !803, file: !11, line: 310, baseType: !810, size: 64, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !803, file: !11, line: 310, baseType: !810, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !762, file: !11, line: 499, baseType: !851, size: 640)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventButton", file: !11, line: 52, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventButton", file: !11, line: 313, size: 640, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !852, file: !11, line: 315, baseType: !744, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !852, file: !11, line: 316, baseType: !564, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !852, file: !11, line: 317, baseType: !747, size: 8, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !852, file: !11, line: 318, baseType: !391, size: 32, offset: 160)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !852, file: !11, line: 319, baseType: !810, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !852, file: !11, line: 320, baseType: !810, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "axes", scope: !852, file: !11, line: 321, baseType: !813, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !852, file: !11, line: 322, baseType: !346, size: 32, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !852, file: !11, line: 323, baseType: !346, size: 32, offset: 416)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !852, file: !11, line: 324, baseType: !819, size: 64, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !852, file: !11, line: 325, baseType: !810, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !852, file: !11, line: 325, baseType: !810, size: 64, offset: 576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !762, file: !11, line: 500, baseType: !867, size: 576)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventScroll", file: !11, line: 53, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventScroll", file: !11, line: 328, size: 576, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !879, !880, !881}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !868, file: !11, line: 330, baseType: !744, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !868, file: !11, line: 331, baseType: !564, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !868, file: !11, line: 332, baseType: !747, size: 8, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !868, file: !11, line: 333, baseType: !391, size: 32, offset: 160)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !868, file: !11, line: 334, baseType: !810, size: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !868, file: !11, line: 335, baseType: !810, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !868, file: !11, line: 336, baseType: !346, size: 32, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !868, file: !11, line: 337, baseType: !878, size: 32, offset: 352)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkScrollDirection", file: !11, line: 200, baseType: !253)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !868, file: !11, line: 338, baseType: !819, size: 64, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !868, file: !11, line: 339, baseType: !810, size: 64, offset: 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !868, file: !11, line: 339, baseType: !810, size: 64, offset: 512)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !762, file: !11, line: 501, baseType: !740, size: 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "crossing", scope: !762, file: !11, line: 502, baseType: !884, size: 704)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventCrossing", file: !11, line: 56, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventCrossing", file: !11, line: 357, size: 704, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !898, !900, !901}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !885, file: !11, line: 359, baseType: !744, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !885, file: !11, line: 360, baseType: !564, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !885, file: !11, line: 361, baseType: !747, size: 8, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !885, file: !11, line: 362, baseType: !564, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !885, file: !11, line: 363, baseType: !391, size: 32, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !885, file: !11, line: 364, baseType: !810, size: 64, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !885, file: !11, line: 365, baseType: !810, size: 64, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !885, file: !11, line: 366, baseType: !810, size: 64, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !885, file: !11, line: 367, baseType: !810, size: 64, offset: 512)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !885, file: !11, line: 368, baseType: !897, size: 32, offset: 576)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkCrossingMode", file: !11, line: 233, baseType: !259)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !885, file: !11, line: 369, baseType: !899, size: 32, offset: 608)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkNotifyType", file: !11, line: 218, baseType: !267)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "focus", scope: !885, file: !11, line: 370, baseType: !674, size: 32, offset: 640)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !885, file: !11, line: 371, baseType: !346, size: 32, offset: 672)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "focus_change", scope: !762, file: !11, line: 503, baseType: !903, size: 192)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventFocus", file: !11, line: 55, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventFocus", file: !11, line: 374, size: 192, elements: !905)
!905 = !{!906, !907, !908, !909}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !904, file: !11, line: 376, baseType: !744, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !904, file: !11, line: 377, baseType: !564, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !904, file: !11, line: 378, baseType: !747, size: 8, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !904, file: !11, line: 379, baseType: !816, size: 16, offset: 144)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !762, file: !11, line: 504, baseType: !911, size: 320)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventConfigure", file: !11, line: 57, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventConfigure", file: !11, line: 382, size: 320, elements: !913)
!913 = !{!914, !915, !916, !917, !918, !919, !920}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !912, file: !11, line: 384, baseType: !744, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !912, file: !11, line: 385, baseType: !564, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !912, file: !11, line: 386, baseType: !747, size: 8, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !912, file: !11, line: 387, baseType: !431, size: 32, offset: 160)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !912, file: !11, line: 387, baseType: !431, size: 32, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !912, file: !11, line: 388, baseType: !431, size: 32, offset: 224)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !912, file: !11, line: 389, baseType: !431, size: 32, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !762, file: !11, line: 505, baseType: !922, size: 320)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventProperty", file: !11, line: 58, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventProperty", file: !11, line: 392, size: 320, elements: !924)
!924 = !{!925, !926, !927, !928, !932, !933}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !923, file: !11, line: 394, baseType: !744, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !923, file: !11, line: 395, baseType: !564, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !923, file: !11, line: 396, baseType: !747, size: 8, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !923, file: !11, line: 397, baseType: !929, size: 64, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkAtom", file: !53, line: 80, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkAtom", file: !53, line: 80, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !923, file: !11, line: 398, baseType: !391, size: 32, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !923, file: !11, line: 399, baseType: !346, size: 32, offset: 288)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !762, file: !11, line: 506, baseType: !935, size: 448)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventSelection", file: !11, line: 59, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventSelection", file: !11, line: 402, size: 448, elements: !937)
!937 = !{!938, !939, !940, !941, !942, !943, !944, !945}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !936, file: !11, line: 404, baseType: !744, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !936, file: !11, line: 405, baseType: !564, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !936, file: !11, line: 406, baseType: !747, size: 8, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !936, file: !11, line: 407, baseType: !929, size: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !936, file: !11, line: 408, baseType: !929, size: 64, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !936, file: !11, line: 409, baseType: !929, size: 64, offset: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !936, file: !11, line: 410, baseType: !391, size: 32, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !936, file: !11, line: 411, baseType: !946, size: 32, offset: 416)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkNativeWindow", file: !53, line: 97, baseType: !391)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "owner_change", scope: !762, file: !11, line: 507, baseType: !948, size: 384)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventOwnerChange", file: !11, line: 60, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventOwnerChange", file: !11, line: 414, size: 384, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !957, !958, !959}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !949, file: !11, line: 416, baseType: !744, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !949, file: !11, line: 417, baseType: !564, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !949, file: !11, line: 418, baseType: !747, size: 8, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !949, file: !11, line: 419, baseType: !946, size: 32, offset: 160)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !949, file: !11, line: 420, baseType: !956, size: 32, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkOwnerChange", file: !11, line: 264, baseType: !275)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !949, file: !11, line: 421, baseType: !929, size: 64, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !949, file: !11, line: 422, baseType: !391, size: 32, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "selection_time", scope: !949, file: !11, line: 423, baseType: !391, size: 32, offset: 352)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "proximity", scope: !762, file: !11, line: 508, baseType: !961, size: 256)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventProximity", file: !11, line: 61, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventProximity", file: !11, line: 429, size: 256, elements: !963)
!963 = !{!964, !965, !966, !967, !968}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !962, file: !11, line: 431, baseType: !744, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !962, file: !11, line: 432, baseType: !564, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !962, file: !11, line: 433, baseType: !747, size: 8, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !962, file: !11, line: 434, baseType: !391, size: 32, offset: 160)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !962, file: !11, line: 435, baseType: !819, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !762, file: !11, line: 509, baseType: !970, size: 640)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventClient", file: !11, line: 62, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventClient", file: !11, line: 438, size: 640, elements: !972)
!972 = !{!973, !974, !975, !976, !977, !979}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !971, file: !11, line: 440, baseType: !744, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !971, file: !11, line: 441, baseType: !564, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !971, file: !11, line: 442, baseType: !747, size: 8, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !971, file: !11, line: 443, baseType: !929, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "data_format", scope: !971, file: !11, line: 444, baseType: !978, size: 16, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "gushort", file: !320, line: 53, baseType: !394)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !971, file: !11, line: 449, baseType: !980, size: 320, offset: 320)
!980 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !971, file: !11, line: 445, size: 320, elements: !981)
!981 = !{!982, !986, !990}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !980, file: !11, line: 446, baseType: !983, size: 160)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 160, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 20)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !980, file: !11, line: 447, baseType: !987, size: 160)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 160, elements: !988)
!988 = !{!989}
!989 = !DISubrange(count: 10)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !980, file: !11, line: 448, baseType: !991, size: 320)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 320, elements: !415)
!992 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "dnd", scope: !762, file: !11, line: 510, baseType: !994, size: 320)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventDND", file: !11, line: 63, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventDND", file: !11, line: 481, size: 320, elements: !996)
!996 = !{!997, !998, !999, !1000, !1026, !1027, !1029}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !995, file: !11, line: 482, baseType: !744, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !995, file: !11, line: 483, baseType: !564, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !995, file: !11, line: 484, baseType: !747, size: 8, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !995, file: !11, line: 485, baseType: !1001, size: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDragContext", file: !281, line: 38, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkDragContext", file: !281, line: 75, size: 640, elements: !1004)
!1004 = !{!1005, !1006, !1008, !1009, !1010, !1011, !1020, !1022, !1023, !1024, !1025}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "parent_instance", scope: !1003, file: !281, line: 76, baseType: !325, size: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !1003, file: !281, line: 80, baseType: !1007, size: 32, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDragProtocol", file: !281, line: 60, baseType: !280)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "is_source", scope: !1003, file: !281, line: 82, baseType: !674, size: 32, offset: 224)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "source_window", scope: !1003, file: !281, line: 84, baseType: !564, size: 64, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "dest_window", scope: !1003, file: !281, line: 85, baseType: !564, size: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "targets", scope: !1003, file: !281, line: 87, baseType: !1012, size: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !1014, line: 37, baseType: !1015)
!1014 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/sahil/vim/src")
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !1014, line: 39, size: 192, elements: !1016)
!1016 = !{!1017, !1018, !1019}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1015, file: !1014, line: 41, baseType: !477, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1015, file: !1014, line: 42, baseType: !1012, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1015, file: !1014, line: 43, baseType: !1012, size: 64, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "actions", scope: !1003, file: !281, line: 88, baseType: !1021, size: 32, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkDragAction", file: !281, line: 48, baseType: !290)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "suggested_action", scope: !1003, file: !281, line: 89, baseType: !1021, size: 32, offset: 480)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1003, file: !281, line: 90, baseType: !1021, size: 32, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !1003, file: !281, line: 92, baseType: !391, size: 32, offset: 544)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "windowing_data", scope: !1003, file: !281, line: 96, baseType: !477, size: 64, offset: 576)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !995, file: !11, line: 487, baseType: !391, size: 32, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !995, file: !11, line: 488, baseType: !1028, size: 16, offset: 288)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "gshort", file: !320, line: 47, baseType: !817)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !995, file: !11, line: 488, baseType: !1028, size: 16, offset: 304)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "window_state", scope: !762, file: !11, line: 511, baseType: !1031, size: 256)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventWindowState", file: !11, line: 64, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventWindowState", file: !11, line: 461, size: 256, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1039}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1032, file: !11, line: 463, baseType: !744, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1032, file: !11, line: 464, baseType: !564, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1032, file: !11, line: 465, baseType: !747, size: 8, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "changed_mask", scope: !1032, file: !11, line: 466, baseType: !1038, size: 32, offset: 160)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkWindowState", file: !11, line: 250, baseType: !298)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "new_window_state", scope: !1032, file: !11, line: 467, baseType: !1038, size: 32, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "setting", scope: !762, file: !11, line: 512, baseType: !1041, size: 256)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventSetting", file: !11, line: 65, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventSetting", file: !11, line: 452, size: 256, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1049}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1042, file: !11, line: 454, baseType: !744, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1042, file: !11, line: 455, baseType: !564, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1042, file: !11, line: 456, baseType: !747, size: 8, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1042, file: !11, line: 457, baseType: !1048, size: 32, offset: 160)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkSettingAction", file: !11, line: 257, baseType: !307)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1042, file: !11, line: 458, baseType: !690, size: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "grab_broken", scope: !762, file: !11, line: 513, baseType: !1051, size: 320)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "GdkEventGrabBroken", file: !11, line: 66, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GdkEventGrabBroken", file: !11, line: 470, size: 320, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1052, file: !11, line: 471, baseType: !744, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1052, file: !11, line: 472, baseType: !564, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1052, file: !11, line: 473, baseType: !747, size: 8, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !1052, file: !11, line: 474, baseType: !674, size: 32, offset: 160)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !1052, file: !11, line: 475, baseType: !674, size: 32, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "grab_window", scope: !1052, file: !11, line: 476, baseType: !564, size: 64, offset: 256)
!1060 = !{!1061, !0, !1063, !1065, !1067, !1069, !1071, !1073, !1075, !1077, !1079, !1081}
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(name: "xim_has_preediting", scope: !2, file: !3, line: 101, type: !360, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(name: "preedit_window", scope: !2, file: !3, line: 126, type: !567, isLocal: true, isDefinition: true)
!1065 = !DIGlobalVariableExpression(var: !1066, expr: !DIExpression())
!1066 = distinct !DIGlobalVariable(name: "im_preedit_cursor", scope: !2, file: !3, line: 119, type: !360, isLocal: true, isDefinition: true)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(name: "im_preedit_trailing", scope: !2, file: !3, line: 120, type: !360, isLocal: true, isDefinition: true)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(name: "im_commit_handler_id", scope: !2, file: !3, line: 122, type: !343, isLocal: true, isDefinition: true)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(name: "preedit_label", scope: !2, file: !3, line: 127, type: !567, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(name: "im_activatekey_keyval", scope: !2, file: !3, line: 123, type: !347, isLocal: true, isDefinition: true)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "im_activatekey_state", scope: !2, file: !3, line: 124, type: !347, isLocal: true, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(name: "xim_expected_char", scope: !2, file: !3, line: 409, type: !360, isLocal: true, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "xim_ignored_char", scope: !2, file: !3, line: 410, type: !360, isLocal: true, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "preedit_is_active", scope: !2, file: !3, line: 118, type: !360, isLocal: true, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1084 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1085 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1086 = !{i32 2, !"Dwarf Version", i32 4}
!1087 = !{i32 2, !"Debug Info Version", i32 3}
!1088 = !{i32 1, !"wchar_size", i32 4}
!1089 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!1090 = distinct !DISubprogram(name: "im_set_active", scope: !3, file: !3, line: 132, type: !1091, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1093)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{null, !360}
!1093 = !{!1094, !1095}
!1094 = !DILocalVariable(name: "active", arg: 1, scope: !1090, file: !3, line: 132, type: !360)
!1095 = !DILocalVariable(name: "was_active", scope: !1090, file: !3, line: 134, type: !360)
!1096 = !DILocation(line: 132, column: 19, scope: !1090)
!1097 = !DILocation(line: 1124, column: 9, scope: !1098, inlinedAt: !1103)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 1124, column: 9)
!1099 = distinct !DISubprogram(name: "im_get_status", scope: !3, file: !3, line: 1121, type: !1100, isLocal: false, isDefinition: true, scopeLine: 1122, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1102)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!360}
!1102 = !{}
!1103 = distinct !DILocation(line: 136, column: 20, scope: !1090)
!1104 = !{!1105, !1105, i64 0}
!1105 = !{!"any pointer", !1106, i64 0}
!1106 = !{!"omnipotent char", !1107, i64 0}
!1107 = !{!"Simple C/C++ TBAA"}
!1108 = !{!1106, !1106, i64 0}
!1109 = !DILocation(line: 1124, column: 9, scope: !1099, inlinedAt: !1103)
!1110 = !DILocation(line: 87, column: 9, scope: !1111, inlinedAt: !1115)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 87, column: 9)
!1112 = distinct !DISubprogram(name: "call_imstatusfunc", scope: !3, file: !3, line: 82, type: !1100, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1113)
!1113 = !{!1114}
!1114 = !DILocalVariable(name: "is_active", scope: !1112, file: !3, line: 84, type: !360)
!1115 = distinct !DILocation(line: 1125, column: 9, scope: !1098, inlinedAt: !1103)
!1116 = !{!1117, !1117, i64 0}
!1117 = !{!"int", !1106, i64 0}
!1118 = !DILocation(line: 87, column: 17, scope: !1111, inlinedAt: !1115)
!1119 = !DILocation(line: 87, column: 20, scope: !1111, inlinedAt: !1115)
!1120 = !DILocation(line: 87, column: 9, scope: !1112, inlinedAt: !1115)
!1121 = !DILocation(line: 91, column: 5, scope: !1112, inlinedAt: !1115)
!1122 = !DILocation(line: 92, column: 33, scope: !1112, inlinedAt: !1115)
!1123 = !DILocation(line: 92, column: 17, scope: !1112, inlinedAt: !1115)
!1124 = !DILocation(line: 84, column: 9, scope: !1112, inlinedAt: !1115)
!1125 = !DILocation(line: 93, column: 5, scope: !1112, inlinedAt: !1115)
!1126 = !DILocation(line: 94, column: 23, scope: !1112, inlinedAt: !1115)
!1127 = !DILocation(line: 94, column: 5, scope: !1112, inlinedAt: !1115)
!1128 = !DILocation(line: 1127, column: 12, scope: !1099, inlinedAt: !1103)
!1129 = !DILocation(line: 1127, column: 5, scope: !1099, inlinedAt: !1103)
!1130 = !DILocation(line: 136, column: 19, scope: !1090)
!1131 = !DILocation(line: 137, column: 21, scope: !1090)
!1132 = !DILocation(line: 137, column: 32, scope: !1090)
!1133 = !DILocation(line: 137, column: 31, scope: !1090)
!1134 = !DILocation(line: 137, column: 28, scope: !1090)
!1135 = !DILocation(line: 137, column: 18, scope: !1090)
!1136 = !DILocation(line: 139, column: 22, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 139, column: 9)
!1138 = !DILocation(line: 139, column: 9, scope: !1090)
!1139 = !DILocation(line: 140, column: 2, scope: !1137)
!1140 = !DILocation(line: 141, column: 1, scope: !1090)
!1141 = !DILocation(line: 1124, column: 9, scope: !1098)
!1142 = !DILocation(line: 1124, column: 9, scope: !1099)
!1143 = !DILocation(line: 87, column: 9, scope: !1111, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 1125, column: 9, scope: !1098)
!1145 = !DILocation(line: 87, column: 17, scope: !1111, inlinedAt: !1144)
!1146 = !DILocation(line: 87, column: 20, scope: !1111, inlinedAt: !1144)
!1147 = !DILocation(line: 87, column: 9, scope: !1112, inlinedAt: !1144)
!1148 = !DILocation(line: 91, column: 5, scope: !1112, inlinedAt: !1144)
!1149 = !DILocation(line: 92, column: 33, scope: !1112, inlinedAt: !1144)
!1150 = !DILocation(line: 92, column: 17, scope: !1112, inlinedAt: !1144)
!1151 = !DILocation(line: 84, column: 9, scope: !1112, inlinedAt: !1144)
!1152 = !DILocation(line: 93, column: 5, scope: !1112, inlinedAt: !1144)
!1153 = !DILocation(line: 94, column: 23, scope: !1112, inlinedAt: !1144)
!1154 = !DILocation(line: 94, column: 5, scope: !1112, inlinedAt: !1144)
!1155 = !DILocation(line: 1127, column: 12, scope: !1099)
!1156 = !DILocation(line: 1127, column: 5, scope: !1099)
!1157 = !DILocation(line: 1128, column: 1, scope: !1099)
!1158 = distinct !DISubprogram(name: "xim_reset", scope: !3, file: !3, line: 948, type: !357, isLocal: false, isDefinition: true, scopeLine: 949, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1102)
!1159 = !DILocalVariable(name: "argv", scope: !1160, file: !3, line: 73, type: !1163)
!1160 = distinct !DISubprogram(name: "call_imactivatefunc", scope: !3, file: !3, line: 71, type: !1091, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1161)
!1161 = !{!1162, !1159}
!1162 = !DILocalVariable(name: "active", arg: 1, scope: !1160, file: !3, line: 71, type: !360)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1164, size: 256, elements: !2148)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !170, line: 1432, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 1412, size: 128, elements: !1166)
!1166 = !{!1167, !1169, !1170}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !1165, file: !170, line: 1414, baseType: !1168, size: 32)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !170, line: 1391, baseType: !169)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !1165, file: !170, line: 1415, baseType: !321, size: 8, offset: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !1165, file: !170, line: 1431, baseType: !1171, size: 64, offset: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1165, file: !170, line: 1416, size: 64, elements: !1172)
!1172 = !{!1173, !1176, !1178, !1179, !1235, !1270, !1419, !2589, !2590}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !1171, file: !170, line: 1418, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !170, line: 1327, baseType: !1175)
!1175 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !1171, file: !170, line: 1420, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !170, line: 1344, baseType: !642)
