; ModuleID = 'hashtab.c'
source_filename = "hashtab.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.hashtable_S = type { i64, i64, i64, i32, i32, i32, %struct.hashitem_S*, [16 x %struct.hashitem_S] }
%struct.hashitem_S = type { i64, i8* }

@hash_removed = external global i8, align 1
@.str = private unnamed_addr constant [11 x i8] c"hash_add()\00", align 1

; Function Attrs: nounwind uwtable
define void @hash_init(%struct.hashtable_S*) local_unnamed_addr #0 !dbg !28 {
  call void @llvm.dbg.value(metadata %struct.hashtable_S* %0, metadata !47, metadata !DIExpression()), !dbg !48
  %2 = getelementptr inbounds %struct.hashtable_S, %struct.hashtable_S* %0, i64 0, i32 1
  %3 = bitcast i64* %2 to i8*
  tail call void @llvm.memset.p0i8.i64(i8* %3, i8 0, i64 296, i32 8, i1 false), !dbg !49
  %4 = getelementptr inbounds %struct.hashtable_S, %struct.hashtable_S* %0, i64 0, i32 7, i64 0, !dbg !50
  %5 = getelementptr inbounds %struct.hashtable_S, %struct.hashtable_S* %0, i64 0, i32 6, !dbg !51
  store %struct.hashitem_S* %4, %struct.hashitem_S** %5, align 8, !dbg !52, !tbaa !53
  %6 = getelementptr inbounds %struct.hashtable_S, %struct.hashtable_S* %0, i64 0, i32 0, !dbg !60
  store i64 15, i64* %6, align 8, !dbg !61, !tbaa !62
  ret void, !dbg !63
}

; Function Attrs: nounwind readnone speculatable
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: argmemonly nounwind

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 6.0.1-14 (tags/RELEASE_601/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "hashtab.c", directory: "/home/sahil/vim/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !9, !11, !14, !15}
!4 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_T", file: !10, line: 1292, baseType: !11)
!10 = !DIFile(filename: "./structs.h", directory: "/home/sahil/vim/src")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !12, line: 345, baseType: !13)
!12 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!13 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !10, line: 1265, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !10, line: 1261, size: 128, elements: !18)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !17, file: !10, line: 1263, baseType: !11, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !17, file: !10, line: 1264, baseType: !21, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !12, line: 324, baseType: !23)
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !{i32 2, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 1, !"wchar_size", i32 4}
!27 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!28 = distinct !DISubprogram(name: "hash_init", scope: !1, file: !1, line: 65, type: !29, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !46)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !10, line: 1290, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !10, line: 1277, size: 2432, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !33, file: !10, line: 1279, baseType: !11, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !33, file: !10, line: 1281, baseType: !11, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !33, file: !10, line: 1282, baseType: !11, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !33, file: !10, line: 1283, baseType: !14, size: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !33, file: !10, line: 1284, baseType: !14, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !33, file: !10, line: 1285, baseType: !14, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !33, file: !10, line: 1287, baseType: !15, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !33, file: !10, line: 1289, baseType: !43, size: 2048, offset: 384)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 16)
!46 = !{!47}
!47 = !DILocalVariable(name: "ht", arg: 1, scope: !28, file: !1, line: 65, type: !31)
!48 = !DILocation(line: 65, column: 22, scope: !28)
!49 = !DILocation(line: 68, column: 5, scope: !28)
!50 = !DILocation(line: 69, column: 20, scope: !28)
!51 = !DILocation(line: 69, column: 9, scope: !28)
!52 = !DILocation(line: 69, column: 18, scope: !28)
!53 = !{!54, !59, i64 40}
!54 = !{!"hashtable_S", !55, i64 0, !55, i64 8, !55, i64 16, !58, i64 24, !58, i64 28, !58, i64 32, !59, i64 40, !56, i64 48}
!55 = !{!"long", !56, i64 0}
!56 = !{!"omnipotent char", !57, i64 0}
!57 = !{!"Simple C/C++ TBAA"}
!58 = !{!"int", !56, i64 0}
!59 = !{!"any pointer", !56, i64 0}
!60 = !DILocation(line: 70, column: 9, scope: !28)
!61 = !DILocation(line: 70, column: 17, scope: !28)
!62 = !{!54, !55, i64 0}
!63 = !DILocation(line: 71, column: 1, scope: !28)
!64 = distinct !DISubprogram(name: "hash_clear", scope: !1, file: !1, line: 78, type: !29, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !65)
!65 = !{!66}
!66 = !DILocalVariable(name: "ht", arg: 1, scope: !64, file: !1, line: 78, type: !31)
!67 = !DILocation(line: 78, column: 23, scope: !64)
!68 = !DILocation(line: 80, column: 13, scope: !69)
!69 = distinct !DILexicalBlock(scope: !64, file: !1, line: 80, column: 9)
!70 = !DILocation(line: 80, column: 25, scope: !69)
!71 = !DILocation(line: 80, column: 22, scope: !69)
!72 = !DILocation(line: 80, column: 9, scope: !64)
!73 = !DILocation(line: 81, column: 11, scope: !69)
!74 = !DILocation(line: 81, column: 2, scope: !69)
!75 = !DILocation(line: 82, column: 1, scope: !64)
!76 = distinct !DISubprogram(name: "hash_clear_all", scope: !1, file: !1, line: 91, type: !77, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !79)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !31, !14}
!79 = !{!80, !81, !82, !83}
!80 = !DILocalVariable(name: "ht", arg: 1, scope: !76, file: !1, line: 91, type: !31)
!81 = !DILocalVariable(name: "off", arg: 2, scope: !76, file: !1, line: 91, type: !14)
!82 = !DILocalVariable(name: "todo", scope: !76, file: !1, line: 93, type: !4)
!83 = !DILocalVariable(name: "hi", scope: !76, file: !1, line: 94, type: !15)
!84 = !DILocation(line: 91, column: 27, scope: !76)
!85 = !DILocation(line: 91, column: 35, scope: !76)
!86 = !DILocation(line: 96, column: 22, scope: !76)
!87 = !{!54, !55, i64 8}
!88 = !DILocation(line: 93, column: 10, scope: !76)
!89 = !DILocation(line: 97, column: 19, scope: !90)
!90 = distinct !DILexicalBlock(scope: !76, file: !1, line: 97, column: 5)
!91 = !DILocation(line: 94, column: 17, scope: !76)
!92 = !DILocation(line: 97, column: 34, scope: !93)
!93 = distinct !DILexicalBlock(scope: !90, file: !1, line: 97, column: 5)
!94 = !DILocation(line: 97, column: 5, scope: !90)
!95 = !DILocation(line: 99, column: 7, scope: !96)
!96 = distinct !DILexicalBlock(scope: !97, file: !1, line: 99, column: 6)
!97 = distinct !DILexicalBlock(scope: !93, file: !1, line: 98, column: 5)
!98 = !{!99, !59, i64 8}
!99 = !{!"hashitem_S", !55, i64 0, !59, i64 8}
!100 = !DILocation(line: 101, column: 26, scope: !101)
!101 = distinct !DILexicalBlock(scope: !96, file: !1, line: 100, column: 2)
!102 = !DILocation(line: 101, column: 6, scope: !101)
!103 = !DILocation(line: 102, column: 6, scope: !101)
!104 = !DILocation(line: 103, column: 2, scope: !101)
!105 = !DILocation(line: 97, column: 39, scope: !93)
!106 = distinct !{!106, !94, !107}
!107 = !DILocation(line: 104, column: 5, scope: !90)
!108 = !DILocation(line: 78, column: 23, scope: !64, inlinedAt: !109)
!109 = distinct !DILocation(line: 105, column: 5, scope: !76)
