; ModuleID = 'highlight.c'
source_filename = "highlight.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.growarray = type { i32, i32, i32, i32, i8* }

!268 = !DIEnumerator(name: "GDK_VISUAL_PSEUDO_COLOR", value: 3)
!269 = !DIEnumerator(name: "GDK_VISUAL_TRUE_COLOR", value: 4)
!270 = !DIEnumerator(name: "GDK_VISUAL_DIRECT_COLOR", value: 5)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !272, line: 118, size: 32, elements: !273)
!272 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdktypes.h", directory: "/home/sahil/vim/src")
!273 = !{!274, !275}
!274 = !DIEnumerator(name: "GDK_LSB_FIRST", value: 0)
!275 = !DIEnumerator(name: "GDK_MSB_FIRST", value: 1)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !277, line: 43, size: 32, elements: !278)
!277 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkfont.h", directory: "/home/sahil/vim/src")
!278 = !{!279, !280}
!279 = !DIEnumerator(name: "GDK_FONT_FONT", value: 0)
!280 = !DIEnumerator(name: "GDK_FONT_FONTSET", value: 1)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !282, line: 52, size: 32, elements: !283)
!282 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkrc.h", directory: "/home/sahil/vim/src")
!283 = !{!284, !285, !286, !287}
!284 = !DIEnumerator(name: "GTK_RC_FG", value: 1)
!285 = !DIEnumerator(name: "GTK_RC_BG", value: 2)
!286 = !DIEnumerator(name: "GTK_RC_TEXT", value: 4)
!287 = !DIEnumerator(name: "GTK_RC_BASE", value: 8)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !207, line: 2140, size: 32, elements: !289)
!289 = !{!290, !291, !292, !293}
!290 = !DIEnumerator(name: "MODE_NL", value: 0)
!291 = !DIEnumerator(name: "MODE_RAW", value: 1)
!292 = !DIEnumerator(name: "MODE_JSON", value: 2)
!293 = !DIEnumerator(name: "MODE_JS", value: 3)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !207, line: 2148, size: 32, elements: !295)
!295 = !{!296, !297, !298, !299, !300}
!296 = !DIEnumerator(name: "JIO_PIPE", value: 0)
!297 = !DIEnumerator(name: "JIO_NULL", value: 1)
!298 = !DIEnumerator(name: "JIO_FILE", value: 2)
!299 = !DIEnumerator(name: "JIO_BUFFER", value: 3)
!300 = !DIEnumerator(name: "JIO_OUT", value: 4)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !207, line: 985, size: 32, elements: !302)
!302 = !{!303, !304, !305}
!303 = !DIEnumerator(name: "ET_USER", value: 0)
!304 = !DIEnumerator(name: "ET_ERROR", value: 1)
!305 = !DIEnumerator(name: "ET_INTERRUPT", value: 2)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1363, size: 32, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!308 = !DIEnumerator(name: "HLF_8", value: 0)
!309 = !DIEnumerator(name: "HLF_EOB", value: 1)
!310 = !DIEnumerator(name: "HLF_AT", value: 2)
!311 = !DIEnumerator(name: "HLF_D", value: 3)
!312 = !DIEnumerator(name: "HLF_E", value: 4)
!313 = !DIEnumerator(name: "HLF_H", value: 5)
!314 = !DIEnumerator(name: "HLF_I", value: 6)
!315 = !DIEnumerator(name: "HLF_L", value: 7)
!316 = !DIEnumerator(name: "HLF_M", value: 8)
!317 = !DIEnumerator(name: "HLF_CM", value: 9)
!318 = !DIEnumerator(name: "HLF_N", value: 10)
!319 = !DIEnumerator(name: "HLF_LNA", value: 11)
!320 = !DIEnumerator(name: "HLF_LNB", value: 12)
!321 = !DIEnumerator(name: "HLF_CLN", value: 13)
!322 = !DIEnumerator(name: "HLF_R", value: 14)
!323 = !DIEnumerator(name: "HLF_S", value: 15)
!324 = !DIEnumerator(name: "HLF_SNC", value: 16)
!325 = !DIEnumerator(name: "HLF_C", value: 17)
!326 = !DIEnumerator(name: "HLF_T", value: 18)
!327 = !DIEnumerator(name: "HLF_V", value: 19)
!328 = !DIEnumerator(name: "HLF_VNC", value: 20)
!329 = !DIEnumerator(name: "HLF_W", value: 21)
!330 = !DIEnumerator(name: "HLF_WM", value: 22)
!331 = !DIEnumerator(name: "HLF_FL", value: 23)
!332 = !DIEnumerator(name: "HLF_FC", value: 24)
!333 = !DIEnumerator(name: "HLF_ADD", value: 25)
!334 = !DIEnumerator(name: "HLF_CHD", value: 26)
!335 = !DIEnumerator(name: "HLF_DED", value: 27)
!336 = !DIEnumerator(name: "HLF_TXD", value: 28)
!337 = !DIEnumerator(name: "HLF_CONCEAL", value: 29)
!338 = !DIEnumerator(name: "HLF_SC", value: 30)
!339 = !DIEnumerator(name: "HLF_SPB", value: 31)
!340 = !DIEnumerator(name: "HLF_SPC", value: 32)
!341 = !DIEnumerator(name: "HLF_SPR", value: 33)
!342 = !DIEnumerator(name: "HLF_SPL", value: 34)
!343 = !DIEnumerator(name: "HLF_PNI", value: 35)
!344 = !DIEnumerator(name: "HLF_PSI", value: 36)
!345 = !DIEnumerator(name: "HLF_PSB", value: 37)
!346 = !DIEnumerator(name: "HLF_PST", value: 38)
!347 = !DIEnumerator(name: "HLF_TP", value: 39)
!348 = !DIEnumerator(name: "HLF_TPS", value: 40)
!349 = !DIEnumerator(name: "HLF_TPF", value: 41)
!350 = !DIEnumerator(name: "HLF_CUC", value: 42)
!351 = !DIEnumerator(name: "HLF_CUL", value: 43)
!352 = !DIEnumerator(name: "HLF_MC", value: 44)
!353 = !DIEnumerator(name: "HLF_QFL", value: 45)
!354 = !DIEnumerator(name: "HLF_ST", value: 46)
!355 = !DIEnumerator(name: "HLF_STNC", value: 47)
!356 = !DIEnumerator(name: "HLF_COUNT", value: 48)
!357 = !{!358, !363, !411, !412, !368, !414, !417, !386, !664, !380, !2111, !574, !2012, !382}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "hl_group_T", file: !3, line: 82, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 37, size: 1664, elements: !361)
!361 = !{!362, !366, !367, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !383, !384, !385, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !410}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sg_name", scope: !360, file: !3, line: 39, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !6, line: 324, baseType: !365)
!365 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sg_name_u", scope: !360, file: !3, line: 40, baseType: !363, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sg_cleared", scope: !360, file: !3, line: 41, baseType: !368, size: 32, offset: 128)
!368 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sg_term", scope: !360, file: !3, line: 43, baseType: !368, size: 32, offset: 160)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sg_start", scope: !360, file: !3, line: 44, baseType: !363, size: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sg_stop", scope: !360, file: !3, line: 45, baseType: !363, size: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sg_term_attr", scope: !360, file: !3, line: 46, baseType: !368, size: 32, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sg_cterm", scope: !360, file: !3, line: 48, baseType: !368, size: 32, offset: 352)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sg_cterm_bold", scope: !360, file: !3, line: 49, baseType: !368, size: 32, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sg_cterm_fg", scope: !360, file: !3, line: 50, baseType: !368, size: 32, offset: 416)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sg_cterm_bg", scope: !360, file: !3, line: 51, baseType: !368, size: 32, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sg_cterm_ul", scope: !360, file: !3, line: 52, baseType: !368, size: 32, offset: 480)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sg_cterm_attr", scope: !360, file: !3, line: 53, baseType: !368, size: 32, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sg_gui_fg", scope: !360, file: !3, line: 56, baseType: !380, size: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "guicolor_T", file: !381, line: 198, baseType: !382)
!381 = !DIFile(filename: "./gui.h", directory: "/home/sahil/vim/src")
!382 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sg_gui_bg", scope: !360, file: !3, line: 57, baseType: !380, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sg_gui_sp", scope: !360, file: !3, line: 58, baseType: !380, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sg_font", scope: !360, file: !3, line: 61, baseType: !386, size: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuiFont", file: !381, line: 208, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PangoFontDescription", file: !389, line: 41, baseType: !390)
!389 = !DIFile(filename: "/usr/include/pango-1.0/pango/pango-font.h", directory: "/home/sahil/vim/src")
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PangoFontDescription", file: !389, line: 41, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "sg_font_name", scope: !360, file: !3, line: 65, baseType: !363, size: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sg_gui_attr", scope: !360, file: !3, line: 66, baseType: !368, size: 32, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sg_gui", scope: !360, file: !3, line: 70, baseType: !368, size: 32, offset: 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sg_gui_fg_name", scope: !360, file: !3, line: 71, baseType: !363, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sg_gui_bg_name", scope: !360, file: !3, line: 72, baseType: !363, size: 64, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "sg_gui_sp_name", scope: !360, file: !3, line: 73, baseType: !363, size: 64, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sg_link", scope: !360, file: !3, line: 75, baseType: !368, size: 32, offset: 1152)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sg_deflink", scope: !360, file: !3, line: 76, baseType: !368, size: 32, offset: 1184)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sg_set", scope: !360, file: !3, line: 77, baseType: !368, size: 32, offset: 1216)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sg_deflink_sctx", scope: !360, file: !3, line: 79, baseType: !401, size: 192, offset: 1280)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !207, line: 92, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 85, size: 192, elements: !403)
!403 = !{!404, !406, !407, !409}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !402, file: !207, line: 87, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !207, line: 62, baseType: !368)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !402, file: !207, line: 88, baseType: !368, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !402, file: !207, line: 89, baseType: !408, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !6, line: 1687, baseType: !382)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !402, file: !207, line: 91, baseType: !368, size: 32, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sg_script_ctx", scope: !360, file: !3, line: 80, baseType: !401, size: 192, offset: 1472)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !415, line: 62, baseType: !416)
!415 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!416 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "estack_T", file: !207, line: 2050, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 2035, size: 448, elements: !420)
!420 = !{!421, !422, !423, !425, !2110}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "es_lnum", scope: !419, file: !207, line: 2036, baseType: !382, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "es_name", scope: !419, file: !207, line: 2037, baseType: !363, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "es_type", scope: !419, file: !207, line: 2038, baseType: !424, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "etype_T", file: !207, line: 2033, baseType: !206)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "es_info", scope: !419, file: !207, line: 2046, baseType: !426, size: 64, offset: 192)
!426 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !419, file: !207, line: 2039, size: 64, elements: !427)
!427 = !{!428, !430, !2083, !2087}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sctx", scope: !426, file: !207, line: 2040, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ufunc", scope: !426, file: !207, line: 2042, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !207, line: 1658, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 1597, size: 3072, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !441, !442, !451, !452, !467, !468, !469, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2080, !2081}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !433, file: !207, line: 1599, baseType: !368, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !433, file: !207, line: 1600, baseType: !368, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !433, file: !207, line: 1601, baseType: !368, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !433, file: !207, line: 1602, baseType: !368, size: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !433, file: !207, line: 1603, baseType: !440, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !207, line: 1591, baseType: !219)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !433, file: !207, line: 1604, baseType: !368, size: 32, offset: 160)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !433, file: !207, line: 1605, baseType: !443, size: 192, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !207, line: 55, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !207, line: 48, size: 192, elements: !445)
!445 = !{!446, !447, !448, !449, !450}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !444, file: !207, line: 50, baseType: !368, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !444, file: !207, line: 51, baseType: !368, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !444, file: !207, line: 52, baseType: !368, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !444, file: !207, line: 53, baseType: !368, size: 32, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !444, file: !207, line: 54, baseType: !411, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !433, file: !207, line: 1606, baseType: !443, size: 192, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !433, file: !207, line: 1609, baseType: !453, size: 64, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !207, line: 1394, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !207, line: 1395, size: 192, elements: !457)
!457 = !{!458, !460, !463, !464, !465, !466}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !456, file: !207, line: 1396, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !207, line: 1391, baseType: !226)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !456, file: !207, line: 1397, baseType: !461, size: 8, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !207, line: 1342, baseType: !462)
!462 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !456, file: !207, line: 1398, baseType: !413, size: 8, offset: 40)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !456, file: !207, line: 1399, baseType: !413, size: 8, offset: 48)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !456, file: !207, line: 1400, baseType: !454, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !456, file: !207, line: 1401, baseType: !453, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !433, file: !207, line: 1610, baseType: !454, size: 64, offset: 640)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !433, file: !207, line: 1611, baseType: !443, size: 192, offset: 704)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !433, file: !207, line: 1612, baseType: !470, size: 64, offset: 896)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !207, line: 1348, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !207, line: 1994, size: 832, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !488, !498, !499, !2022, !2023}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !472, file: !207, line: 1996, baseType: !368, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !472, file: !207, line: 1997, baseType: !363, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !472, file: !207, line: 1999, baseType: !431, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pt_auto", scope: !472, file: !207, line: 2001, baseType: !368, size: 32, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pt_outer", scope: !472, file: !207, line: 2005, baseType: !479, size: 256, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "outer_T", file: !207, line: 1986, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_S", file: !207, line: 1987, size: 256, elements: !481)
!481 = !{!482, !484, !485, !487}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "out_stack", scope: !480, file: !207, line: 1988, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame_idx", scope: !480, file: !207, line: 1989, baseType: !368, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "out_up", scope: !480, file: !207, line: 1990, baseType: !486, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "out_up_is_copy", scope: !480, file: !207, line: 1991, baseType: !368, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pt_funcstack", scope: !472, file: !207, line: 2007, baseType: !489, size: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "funcstack_T", file: !207, line: 1984, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcstack_S", file: !207, line: 1972, size: 320, elements: !492)
!492 = !{!493, !494, !495, !496, !497}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ga", scope: !491, file: !207, line: 1974, baseType: !443, size: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fs_var_offset", scope: !491, file: !207, line: 1978, baseType: !368, size: 32, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fs_refcount", scope: !491, file: !207, line: 1981, baseType: !368, size: 32, offset: 224)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fs_min_refcount", scope: !491, file: !207, line: 1982, baseType: !368, size: 32, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fs_copyID", scope: !491, file: !207, line: 1983, baseType: !368, size: 32, offset: 288)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argc", scope: !472, file: !207, line: 2010, baseType: !368, size: 32, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argv", scope: !472, file: !207, line: 2011, baseType: !500, size: 64, offset: 640)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !207, line: 1432, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 1412, size: 128, elements: !503)
!503 = !{!504, !505, !506}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !502, file: !207, line: 1414, baseType: !459, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !502, file: !207, line: 1415, baseType: !413, size: 8, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !502, file: !207, line: 1431, baseType: !507, size: 64, offset: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !502, file: !207, line: 1416, size: 64, elements: !508)
!508 = !{!509, !512, !515, !516, !560, !595, !596, !2013, !2014}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !507, file: !207, line: 1418, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !207, line: 1327, baseType: !511)
!511 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !507, file: !207, line: 1420, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !207, line: 1344, baseType: !514)
!514 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !507, file: !207, line: 1422, baseType: !363, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !507, file: !207, line: 1423, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !207, line: 1346, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !207, line: 1471, size: 768, elements: !520)
!520 = !{!521, !529, !536, !551, !552, !553, !554, !555, !556, !557, !558, !559}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !519, file: !207, line: 1473, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !207, line: 1446, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !207, line: 1448, size: 256, elements: !525)
!525 = !{!526, !527, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !524, file: !207, line: 1450, baseType: !522, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !524, file: !207, line: 1451, baseType: !522, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !524, file: !207, line: 1452, baseType: !501, size: 128, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !519, file: !207, line: 1474, baseType: !530, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !207, line: 1456, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !207, line: 1458, size: 128, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !532, file: !207, line: 1460, baseType: !522, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !532, file: !207, line: 1461, baseType: !530, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !519, file: !207, line: 1487, baseType: !537, size: 192, offset: 128)
!537 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !519, file: !207, line: 1475, size: 192, elements: !538)
!538 = !{!539, !545}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !537, file: !207, line: 1481, baseType: !540, size: 192)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !537, file: !207, line: 1476, size: 192, elements: !541)
!541 = !{!542, !543, !544}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !540, file: !207, line: 1478, baseType: !510, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !540, file: !207, line: 1479, baseType: !510, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !540, file: !207, line: 1480, baseType: !368, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !537, file: !207, line: 1486, baseType: !546, size: 192)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !537, file: !207, line: 1482, size: 192, elements: !547)
!547 = !{!548, !549, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !546, file: !207, line: 1483, baseType: !522, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !546, file: !207, line: 1484, baseType: !522, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !546, file: !207, line: 1485, baseType: !368, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !519, file: !207, line: 1488, baseType: !454, size: 64, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !519, file: !207, line: 1489, baseType: !517, size: 64, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !519, file: !207, line: 1490, baseType: !517, size: 64, offset: 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !519, file: !207, line: 1491, baseType: !517, size: 64, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !519, file: !207, line: 1492, baseType: !368, size: 32, offset: 576)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !519, file: !207, line: 1493, baseType: !368, size: 32, offset: 608)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !519, file: !207, line: 1494, baseType: !368, size: 32, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !519, file: !207, line: 1496, baseType: !368, size: 32, offset: 672)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !519, file: !207, line: 1497, baseType: !413, size: 8, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !507, file: !207, line: 1424, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !207, line: 1347, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !207, line: 1545, size: 2816, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !591, !592, !593, !594}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !563, file: !207, line: 1547, baseType: !413, size: 8)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !563, file: !207, line: 1548, baseType: !413, size: 8, offset: 8)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !563, file: !207, line: 1549, baseType: !368, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !563, file: !207, line: 1550, baseType: !368, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !563, file: !207, line: 1551, baseType: !570, size: 2432, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !207, line: 1290, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !207, line: 1277, size: 2432, elements: !572)
!572 = !{!573, !575, !576, !577, !578, !579, !580, !587}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !571, file: !207, line: 1279, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !6, line: 345, baseType: !416)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !571, file: !207, line: 1281, baseType: !574, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !571, file: !207, line: 1282, baseType: !574, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !571, file: !207, line: 1283, baseType: !368, size: 32, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !571, file: !207, line: 1284, baseType: !368, size: 32, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !571, file: !207, line: 1285, baseType: !368, size: 32, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !571, file: !207, line: 1287, baseType: !581, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !207, line: 1265, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !207, line: 1261, size: 128, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !583, file: !207, line: 1263, baseType: !574, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !583, file: !207, line: 1264, baseType: !363, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !571, file: !207, line: 1289, baseType: !588, size: 2048, offset: 384)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 2048, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 16)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !563, file: !207, line: 1552, baseType: !454, size: 64, offset: 2560)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !563, file: !207, line: 1553, baseType: !561, size: 64, offset: 2624)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !563, file: !207, line: 1554, baseType: !561, size: 64, offset: 2688)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !563, file: !207, line: 1555, baseType: !561, size: 64, offset: 2752)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !507, file: !207, line: 1425, baseType: !470, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !507, file: !207, line: 1427, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !207, line: 1365, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !207, line: 2072, size: 1024, elements: !600)
!600 = !{!601, !602, !603, !608, !609, !610, !612, !613, !614, !615, !622, !1913, !1914, !1915, !2011}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !599, file: !207, line: 2074, baseType: !597, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !599, file: !207, line: 2075, baseType: !597, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !599, file: !207, line: 2077, baseType: !604, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !605, line: 97, baseType: !606)
!605 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !607, line: 154, baseType: !368)
!607 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!608 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !599, file: !207, line: 2083, baseType: !363, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !599, file: !207, line: 2084, baseType: !363, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !599, file: !207, line: 2085, baseType: !611, size: 32, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !207, line: 2067, baseType: !243)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !599, file: !207, line: 2086, baseType: !363, size: 64, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !599, file: !207, line: 2088, baseType: !363, size: 64, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !599, file: !207, line: 2093, baseType: !368, size: 32, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !599, file: !207, line: 2094, baseType: !616, size: 192, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !207, line: 1360, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 1356, size: 192, elements: !618)
!618 = !{!619, !620, !621}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !617, file: !207, line: 1357, baseType: !363, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !617, file: !207, line: 1358, baseType: !470, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !617, file: !207, line: 1359, baseType: !368, size: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !599, file: !207, line: 2096, baseType: !623, size: 64, offset: 768)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !207, line: 63, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !207, line: 2629, size: 73152, elements: !626)
!626 = !{!627, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !736, !739, !740, !744, !745, !755, !756, !757, !758, !759, !760, !761, !762, !1586, !1587, !1588, !1593, !1594, !1595, !1599, !1607, !1608, !1609, !1610, !1611, !1613, !1614, !1615, !1616, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1860, !1861, !1862, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1896, !1897, !1898, !1899, !1900, !1907, !1908, !1912}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !625, file: !207, line: 2631, baseType: !628, size: 832)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !207, line: 766, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !207, line: 737, size: 832, elements: !630)
!630 = !{!631, !632, !694, !703, !704, !705, !706, !708, !709, !710, !711, !712, !713, !714, !721, !722}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !629, file: !207, line: 739, baseType: !408, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !629, file: !207, line: 741, baseType: !633, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !207, line: 459, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !207, line: 671, size: 9856, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !661, !662, !663, !665, !666, !679, !680, !681, !682, !683, !684, !685, !686, !687, !691, !692, !693}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !635, file: !207, line: 673, baseType: !363, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !635, file: !207, line: 674, baseType: !363, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !635, file: !207, line: 675, baseType: !368, size: 32, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !635, file: !207, line: 676, baseType: !368, size: 32, offset: 160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !635, file: !207, line: 677, baseType: !368, size: 32, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !635, file: !207, line: 678, baseType: !643, size: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !207, line: 458, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !207, line: 506, size: 448, elements: !646)
!646 = !{!647, !656, !657, !658, !659, !660}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !645, file: !207, line: 508, baseType: !648, size: 192)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !207, line: 469, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !207, line: 471, size: 192, elements: !650)
!650 = !{!651, !653, !654}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !649, file: !207, line: 473, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !649, file: !207, line: 474, baseType: !652, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !649, file: !207, line: 475, baseType: !655, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !207, line: 460, baseType: !382)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !645, file: !207, line: 511, baseType: !643, size: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !645, file: !207, line: 512, baseType: !643, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !645, file: !207, line: 513, baseType: !363, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !645, file: !207, line: 514, baseType: !368, size: 32, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !645, file: !207, line: 518, baseType: !413, size: 8, offset: 416)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !635, file: !207, line: 679, baseType: !643, size: 64, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !635, file: !207, line: 680, baseType: !643, size: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !635, file: !207, line: 681, baseType: !664, size: 32, offset: 448)
!664 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !635, file: !207, line: 682, baseType: !664, size: 32, offset: 480)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !635, file: !207, line: 683, baseType: !667, size: 4352, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !207, line: 489, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !207, line: 480, size: 4352, elements: !669)
!669 = !{!670, !671, !672, !674, !678}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !668, file: !207, line: 482, baseType: !574, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !668, file: !207, line: 484, baseType: !574, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !668, file: !207, line: 485, baseType: !673, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !668, file: !207, line: 487, baseType: !675, size: 4096, offset: 192)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 4096, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !668, file: !207, line: 488, baseType: !413, size: 8, offset: 4288)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !635, file: !207, line: 684, baseType: !667, size: 4352, offset: 4864)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !635, file: !207, line: 685, baseType: !655, size: 64, offset: 9216)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !635, file: !207, line: 686, baseType: !655, size: 64, offset: 9280)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !635, file: !207, line: 687, baseType: !655, size: 64, offset: 9344)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !635, file: !207, line: 688, baseType: !655, size: 64, offset: 9408)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !635, file: !207, line: 689, baseType: !664, size: 32, offset: 9472)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !635, file: !207, line: 690, baseType: !368, size: 32, offset: 9504)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !635, file: !207, line: 692, baseType: !623, size: 64, offset: 9536)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !635, file: !207, line: 693, baseType: !688, size: 64, offset: 9600)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 64, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 8)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !635, file: !207, line: 697, baseType: !363, size: 64, offset: 9664)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !635, file: !207, line: 698, baseType: !368, size: 32, offset: 9728)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !635, file: !207, line: 699, baseType: !688, size: 64, offset: 9760)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !629, file: !207, line: 743, baseType: !695, size: 64, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !207, line: 717, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !207, line: 711, size: 256, elements: !698)
!698 = !{!699, !700, !701, !702}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !697, file: !207, line: 713, baseType: !655, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !697, file: !207, line: 714, baseType: !408, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !697, file: !207, line: 715, baseType: !408, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !697, file: !207, line: 716, baseType: !368, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !629, file: !207, line: 744, baseType: !368, size: 32, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !629, file: !207, line: 745, baseType: !368, size: 32, offset: 224)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !629, file: !207, line: 751, baseType: !368, size: 32, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !629, file: !207, line: 753, baseType: !707, size: 32, offset: 288)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !6, line: 1688, baseType: !368)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !629, file: !207, line: 754, baseType: !408, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !629, file: !207, line: 755, baseType: !363, size: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !629, file: !207, line: 757, baseType: !643, size: 64, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !629, file: !207, line: 758, baseType: !408, size: 64, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !629, file: !207, line: 759, baseType: !408, size: 64, offset: 576)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !629, file: !207, line: 760, baseType: !368, size: 32, offset: 640)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !629, file: !207, line: 762, baseType: !715, size: 64, offset: 704)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !207, line: 724, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !207, line: 720, size: 128, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !717, file: !207, line: 722, baseType: !368, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !717, file: !207, line: 723, baseType: !382, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !629, file: !207, line: 763, baseType: !368, size: 32, offset: 768)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !629, file: !207, line: 764, baseType: !368, size: 32, offset: 800)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !625, file: !207, line: 2634, baseType: !623, size: 64, offset: 832)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !625, file: !207, line: 2635, baseType: !623, size: 64, offset: 896)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !625, file: !207, line: 2637, baseType: !368, size: 32, offset: 960)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !625, file: !207, line: 2639, baseType: !368, size: 32, offset: 992)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !625, file: !207, line: 2640, baseType: !368, size: 32, offset: 1024)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !625, file: !207, line: 2642, baseType: !368, size: 32, offset: 1056)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !625, file: !207, line: 2651, baseType: !363, size: 64, offset: 1088)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !625, file: !207, line: 2652, baseType: !363, size: 64, offset: 1152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !625, file: !207, line: 2654, baseType: !363, size: 64, offset: 1216)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !625, file: !207, line: 2658, baseType: !368, size: 32, offset: 1280)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !625, file: !207, line: 2659, baseType: !734, size: 64, offset: 1344)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !605, line: 59, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !607, line: 145, baseType: !416)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !625, file: !207, line: 2660, baseType: !737, size: 64, offset: 1408)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !605, line: 47, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !607, line: 148, baseType: !416)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !625, file: !207, line: 2667, baseType: !368, size: 32, offset: 1472)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !625, file: !207, line: 2668, baseType: !741, size: 72, offset: 1504)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 72, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 9)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !625, file: !207, line: 2672, baseType: !368, size: 32, offset: 1600)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !625, file: !207, line: 2674, baseType: !746, size: 320, offset: 1664)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !207, line: 1532, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !207, line: 1526, size: 320, elements: !748)
!748 = !{!749, !750, !751}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !747, file: !207, line: 1528, baseType: !501, size: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !747, file: !207, line: 1529, baseType: !364, size: 8, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !747, file: !207, line: 1530, baseType: !752, size: 136, offset: 136)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 136, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 17)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !625, file: !207, line: 2679, baseType: !510, size: 64, offset: 1984)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !625, file: !207, line: 2681, baseType: !510, size: 64, offset: 2048)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !625, file: !207, line: 2684, baseType: !368, size: 32, offset: 2112)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !625, file: !207, line: 2691, baseType: !368, size: 32, offset: 2144)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !625, file: !207, line: 2693, baseType: !408, size: 64, offset: 2176)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !625, file: !207, line: 2694, baseType: !408, size: 64, offset: 2240)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !625, file: !207, line: 2696, baseType: !382, size: 64, offset: 2304)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !625, file: !207, line: 2699, baseType: !763, size: 64, offset: 2368)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !207, line: 60, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !207, line: 325, size: 11648, elements: !766)
!766 = !{!767, !768, !769, !1581, !1582, !1583, !1584, !1585}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !765, file: !207, line: 327, baseType: !763, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !765, file: !207, line: 328, baseType: !763, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !765, file: !207, line: 329, baseType: !770, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !207, line: 59, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !207, line: 3365, size: 72064, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !943, !944, !959, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1016, !1017, !1018, !1019, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1042, !1043, !1045, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1066, !1067, !1068, !1069, !1070, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1130, !1131, !1132, !1133, !1134, !1383, !1391, !1392, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1472, !1473, !1474, !1475, !1493, !1494, !1495, !1496, !1537, !1538, !1550, !1551, !1552, !1553, !1554, !1573, !1574, !1575, !1576, !1580}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !772, file: !207, line: 3367, baseType: !368, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !772, file: !207, line: 3369, baseType: !623, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !772, file: !207, line: 3371, baseType: !770, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !772, file: !207, line: 3372, baseType: !770, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !772, file: !207, line: 3375, baseType: !779, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !207, line: 2618, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 2542, size: 9920, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !798, !799, !800, !801, !802, !870, !878, !879, !880, !881, !882, !919, !920, !921, !922, !923, !924, !926, !927, !931, !932, !933, !934, !935, !936, !937, !938, !942}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !781, file: !207, line: 2544, baseType: !570, size: 2432)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !781, file: !207, line: 2545, baseType: !570, size: 2432, offset: 2432)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !781, file: !207, line: 2546, baseType: !368, size: 32, offset: 4864)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !781, file: !207, line: 2548, baseType: !368, size: 32, offset: 4896)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !781, file: !207, line: 2550, baseType: !368, size: 32, offset: 4928)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !781, file: !207, line: 2551, baseType: !368, size: 32, offset: 4960)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !781, file: !207, line: 2552, baseType: !368, size: 32, offset: 4992)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !781, file: !207, line: 2553, baseType: !443, size: 192, offset: 5056)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !781, file: !207, line: 2554, baseType: !443, size: 192, offset: 5248)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !781, file: !207, line: 2555, baseType: !368, size: 32, offset: 5440)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !781, file: !207, line: 2556, baseType: !368, size: 32, offset: 5472)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !781, file: !207, line: 2557, baseType: !368, size: 32, offset: 5504)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !781, file: !207, line: 2559, baseType: !368, size: 32, offset: 5536)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !781, file: !207, line: 2560, baseType: !797, size: 16, offset: 5568)
!797 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !781, file: !207, line: 2561, baseType: !382, size: 64, offset: 5632)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !781, file: !207, line: 2562, baseType: !382, size: 64, offset: 5696)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !781, file: !207, line: 2563, baseType: !382, size: 64, offset: 5760)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !781, file: !207, line: 2564, baseType: !363, size: 64, offset: 5824)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !781, file: !207, line: 2565, baseType: !803, size: 64, offset: 5888)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !805, line: 56, baseType: !806)
!805 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !805, line: 49, size: 192, elements: !807)
!807 = !{!808, !866, !867, !868, !869}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !806, file: !805, line: 51, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !805, line: 42, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !805, line: 167, size: 320, elements: !812)
!812 = !{!813, !817, !821, !836, !865}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !811, file: !805, line: 169, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!803, !363, !368}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !811, file: !805, line: 170, baseType: !818, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !803}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !811, file: !805, line: 171, baseType: !822, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!368, !825, !363, !707, !368}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !805, line: 137, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !805, line: 131, size: 1408, elements: !828)
!828 = !{!829, !830, !834, !835}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !827, file: !805, line: 133, baseType: !803, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !827, file: !805, line: 134, baseType: !831, size: 640, offset: 64)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 640, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 10)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !827, file: !805, line: 135, baseType: !831, size: 640, offset: 704)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !827, file: !805, line: 136, baseType: !368, size: 32, offset: 1344)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !811, file: !805, line: 172, baseType: !837, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!382, !840, !770, !623, !408, !707, !855, !864}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !805, line: 154, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !805, line: 147, size: 2688, elements: !843)
!843 = !{!844, !845, !852, !853, !854}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !842, file: !805, line: 149, baseType: !803, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !842, file: !805, line: 150, baseType: !846, size: 1280, offset: 64)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 1280, elements: !832)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !207, line: 41, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 37, size: 128, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !848, file: !207, line: 39, baseType: !408, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !848, file: !207, line: 40, baseType: !707, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !842, file: !805, line: 151, baseType: !846, size: 1280, offset: 1344)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !842, file: !805, line: 152, baseType: !368, size: 32, offset: 2624)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !842, file: !805, line: 153, baseType: !707, size: 32, offset: 2656)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !6, line: 1786, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !858, line: 8, size: 128, elements: !859)
!858 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!859 = !{!860, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !857, file: !858, line: 10, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !607, line: 160, baseType: !382)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !857, file: !858, line: 11, baseType: !863, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !607, line: 162, baseType: !382)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !811, file: !805, line: 173, baseType: !363, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !806, file: !805, line: 52, baseType: !664, size: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !806, file: !805, line: 53, baseType: !664, size: 32, offset: 96)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !806, file: !805, line: 54, baseType: !664, size: 32, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !806, file: !805, line: 55, baseType: !368, size: 32, offset: 160)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !781, file: !207, line: 2567, baseType: !871, size: 384, offset: 5952)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !207, line: 2475, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 2470, size: 384, elements: !873)
!873 = !{!874, !875, !876, !877}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !872, file: !207, line: 2471, baseType: !856, size: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !872, file: !207, line: 2472, baseType: !856, size: 128, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !872, file: !207, line: 2473, baseType: !382, size: 64, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !872, file: !207, line: 2474, baseType: !382, size: 64, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !781, file: !207, line: 2569, baseType: !368, size: 32, offset: 6336)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !781, file: !207, line: 2570, baseType: !368, size: 32, offset: 6368)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !781, file: !207, line: 2572, baseType: !368, size: 32, offset: 6400)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !781, file: !207, line: 2575, baseType: !368, size: 32, offset: 6432)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !781, file: !207, line: 2592, baseType: !883, size: 64, offset: 6464)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !207, line: 1061, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !207, line: 1063, size: 1728, elements: !886)
!886 = !{!887, !888, !889, !911, !912, !913, !915, !918}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !885, file: !207, line: 1065, baseType: !883, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !885, file: !207, line: 1066, baseType: !408, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !885, file: !207, line: 1071, baseType: !890, size: 1344, offset: 128)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !885, file: !207, line: 1067, size: 1344, elements: !891)
!891 = !{!892, !910}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !890, file: !207, line: 1069, baseType: !893, size: 1344)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 1344, elements: !908)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !207, line: 1055, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !207, line: 1046, size: 192, elements: !896)
!896 = !{!897, !898, !899, !900, !901}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !895, file: !207, line: 1048, baseType: !368, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !895, file: !207, line: 1049, baseType: !368, size: 32, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !895, file: !207, line: 1051, baseType: !368, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !895, file: !207, line: 1052, baseType: !368, size: 32, offset: 96)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !895, file: !207, line: 1054, baseType: !902, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !805, line: 165, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !805, line: 161, size: 704, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !904, file: !805, line: 163, baseType: !797, size: 16)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !904, file: !805, line: 164, baseType: !831, size: 640, offset: 64)
!908 = !{!909}
!909 = !DISubrange(count: 7)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !890, file: !207, line: 1070, baseType: !443, size: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !885, file: !207, line: 1072, baseType: !368, size: 32, offset: 1472)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !885, file: !207, line: 1073, baseType: !368, size: 32, offset: 1504)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !885, file: !207, line: 1074, baseType: !914, size: 64, offset: 1536)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !885, file: !207, line: 1076, baseType: !916, size: 16, offset: 1600)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !6, line: 1689, baseType: !917)
!917 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !885, file: !207, line: 1077, baseType: !408, size: 64, offset: 1664)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !781, file: !207, line: 2593, baseType: !368, size: 32, offset: 6528)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !781, file: !207, line: 2594, baseType: !883, size: 64, offset: 6592)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !781, file: !207, line: 2595, baseType: !883, size: 64, offset: 6656)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !781, file: !207, line: 2596, baseType: !368, size: 32, offset: 6720)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !781, file: !207, line: 2597, baseType: !408, size: 64, offset: 6784)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !781, file: !207, line: 2598, baseType: !925, size: 16, offset: 6848)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !6, line: 325, baseType: !917)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !781, file: !207, line: 2603, baseType: !443, size: 192, offset: 6912)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !781, file: !207, line: 2604, baseType: !928, size: 2048, offset: 7104)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 2048, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !781, file: !207, line: 2605, baseType: !363, size: 64, offset: 9152)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !781, file: !207, line: 2606, baseType: !363, size: 64, offset: 9216)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !781, file: !207, line: 2607, baseType: !803, size: 64, offset: 9280)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !781, file: !207, line: 2608, baseType: !363, size: 64, offset: 9344)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !781, file: !207, line: 2609, baseType: !363, size: 64, offset: 9408)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !781, file: !207, line: 2610, baseType: !363, size: 64, offset: 9472)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !781, file: !207, line: 2611, baseType: !368, size: 32, offset: 9536)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !781, file: !207, line: 2616, baseType: !939, size: 256, offset: 9568)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 256, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !781, file: !207, line: 2617, baseType: !363, size: 64, offset: 9856)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !772, file: !207, line: 3378, baseType: !368, size: 32, offset: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !772, file: !207, line: 3381, baseType: !945, size: 64, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !207, line: 61, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !207, line: 3231, size: 512, elements: !948)
!948 = !{!949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !947, file: !207, line: 3233, baseType: !413, size: 8)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !947, file: !207, line: 3234, baseType: !368, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !947, file: !207, line: 3235, baseType: !368, size: 32, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !947, file: !207, line: 3236, baseType: !368, size: 32, offset: 96)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !947, file: !207, line: 3237, baseType: !368, size: 32, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !947, file: !207, line: 3238, baseType: !945, size: 64, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !947, file: !207, line: 3239, baseType: !945, size: 64, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !947, file: !207, line: 3241, baseType: !945, size: 64, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !947, file: !207, line: 3244, baseType: !945, size: 64, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !947, file: !207, line: 3245, baseType: !770, size: 64, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !772, file: !207, line: 3383, baseType: !960, size: 128, offset: 448)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !207, line: 31, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 26, size: 128, elements: !962)
!962 = !{!963, !964, !965}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !961, file: !207, line: 28, baseType: !408, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !961, file: !207, line: 29, baseType: !707, size: 32, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !961, file: !207, line: 30, baseType: !707, size: 32, offset: 96)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !772, file: !207, line: 3385, baseType: !707, size: 32, offset: 576)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !772, file: !207, line: 3389, baseType: !368, size: 32, offset: 608)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !772, file: !207, line: 3394, baseType: !408, size: 64, offset: 640)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !772, file: !207, line: 3400, baseType: !413, size: 8, offset: 704)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !772, file: !207, line: 3401, baseType: !408, size: 64, offset: 768)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !772, file: !207, line: 3402, baseType: !707, size: 32, offset: 832)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !772, file: !207, line: 3403, baseType: !707, size: 32, offset: 864)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !772, file: !207, line: 3404, baseType: !408, size: 64, offset: 896)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !772, file: !207, line: 3405, baseType: !707, size: 32, offset: 960)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !772, file: !207, line: 3406, baseType: !707, size: 32, offset: 992)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !772, file: !207, line: 3408, baseType: !977, size: 352, offset: 1024)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !207, line: 3358, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 3343, size: 352, elements: !979)
!979 = !{!980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !978, file: !207, line: 3345, baseType: !368, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !978, file: !207, line: 3346, baseType: !368, size: 32, offset: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !978, file: !207, line: 3347, baseType: !368, size: 32, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !978, file: !207, line: 3348, baseType: !368, size: 32, offset: 96)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !978, file: !207, line: 3349, baseType: !368, size: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !978, file: !207, line: 3350, baseType: !368, size: 32, offset: 160)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !978, file: !207, line: 3351, baseType: !368, size: 32, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !978, file: !207, line: 3352, baseType: !368, size: 32, offset: 224)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !978, file: !207, line: 3353, baseType: !368, size: 32, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !978, file: !207, line: 3354, baseType: !368, size: 32, offset: 288)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !978, file: !207, line: 3356, baseType: !368, size: 32, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !772, file: !207, line: 3414, baseType: !408, size: 64, offset: 1408)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !772, file: !207, line: 3416, baseType: !413, size: 8, offset: 1472)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !772, file: !207, line: 3419, baseType: !408, size: 64, offset: 1536)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !772, file: !207, line: 3423, baseType: !368, size: 32, offset: 1600)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !772, file: !207, line: 3424, baseType: !368, size: 32, offset: 1632)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !772, file: !207, line: 3425, baseType: !368, size: 32, offset: 1664)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !772, file: !207, line: 3427, baseType: !368, size: 32, offset: 1696)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !772, file: !207, line: 3429, baseType: !707, size: 32, offset: 1728)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !772, file: !207, line: 3432, baseType: !707, size: 32, offset: 1760)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !772, file: !207, line: 3435, baseType: !368, size: 32, offset: 1792)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !772, file: !207, line: 3437, baseType: !368, size: 32, offset: 1824)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !772, file: !207, line: 3445, baseType: !368, size: 32, offset: 1856)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !772, file: !207, line: 3446, baseType: !368, size: 32, offset: 1888)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !772, file: !207, line: 3449, baseType: !368, size: 32, offset: 1920)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !772, file: !207, line: 3450, baseType: !368, size: 32, offset: 1952)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !772, file: !207, line: 3451, baseType: !368, size: 32, offset: 1984)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !772, file: !207, line: 3452, baseType: !368, size: 32, offset: 2016)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !772, file: !207, line: 3454, baseType: !1009, size: 320, offset: 2048)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !207, line: 3330, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 3324, size: 320, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !1010, file: !207, line: 3326, baseType: !368, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !1010, file: !207, line: 3327, baseType: !368, size: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !1010, file: !207, line: 3328, baseType: !960, size: 128, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !1010, file: !207, line: 3329, baseType: !960, size: 128, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !772, file: !207, line: 3457, baseType: !368, size: 32, offset: 2368)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !772, file: !207, line: 3458, baseType: !368, size: 32, offset: 2400)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !772, file: !207, line: 3459, baseType: !363, size: 64, offset: 2432)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !772, file: !207, line: 3460, baseType: !1020, size: 32, offset: 2496)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !207, line: 2524, baseType: !249)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !772, file: !207, line: 3461, baseType: !368, size: 32, offset: 2528)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !772, file: !207, line: 3462, baseType: !368, size: 32, offset: 2560)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !772, file: !207, line: 3463, baseType: !770, size: 64, offset: 2624)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !772, file: !207, line: 3464, baseType: !368, size: 32, offset: 2688)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !772, file: !207, line: 3465, baseType: !368, size: 32, offset: 2720)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !772, file: !207, line: 3466, baseType: !368, size: 32, offset: 2752)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !772, file: !207, line: 3467, baseType: !368, size: 32, offset: 2784)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !772, file: !207, line: 3468, baseType: !368, size: 32, offset: 2816)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !772, file: !207, line: 3469, baseType: !368, size: 32, offset: 2848)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !772, file: !207, line: 3470, baseType: !368, size: 32, offset: 2880)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !772, file: !207, line: 3471, baseType: !368, size: 32, offset: 2912)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !772, file: !207, line: 3472, baseType: !368, size: 32, offset: 2944)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !772, file: !207, line: 3473, baseType: !368, size: 32, offset: 2976)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !772, file: !207, line: 3474, baseType: !368, size: 32, offset: 3008)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !772, file: !207, line: 3475, baseType: !368, size: 32, offset: 3040)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !772, file: !207, line: 3476, baseType: !363, size: 64, offset: 3072)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !772, file: !207, line: 3477, baseType: !363, size: 64, offset: 3136)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !772, file: !207, line: 3478, baseType: !1039, size: 128, offset: 3200)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 128, elements: !1040)
!1040 = !{!1041}
!1041 = !DISubrange(count: 4)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !772, file: !207, line: 3479, baseType: !1039, size: 128, offset: 3328)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !772, file: !207, line: 3480, baseType: !1044, size: 256, offset: 3456)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 256, elements: !1040)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !772, file: !207, line: 3481, baseType: !1046, size: 256, offset: 3712)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 256, elements: !689)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !772, file: !207, line: 3483, baseType: !368, size: 32, offset: 3968)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !772, file: !207, line: 3484, baseType: !368, size: 32, offset: 4000)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !772, file: !207, line: 3485, baseType: !510, size: 64, offset: 4032)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !772, file: !207, line: 3487, baseType: !510, size: 64, offset: 4096)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !772, file: !207, line: 3490, baseType: !368, size: 32, offset: 4160)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !772, file: !207, line: 3493, baseType: !408, size: 64, offset: 4224)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !772, file: !207, line: 3495, baseType: !616, size: 192, offset: 4288)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !772, file: !207, line: 3496, baseType: !616, size: 192, offset: 4480)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !772, file: !207, line: 3497, baseType: !368, size: 32, offset: 4672)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !772, file: !207, line: 3498, baseType: !368, size: 32, offset: 4704)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !772, file: !207, line: 3500, baseType: !770, size: 64, offset: 4736)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !772, file: !207, line: 3501, baseType: !408, size: 64, offset: 4800)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !772, file: !207, line: 3502, baseType: !707, size: 32, offset: 4864)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !772, file: !207, line: 3503, baseType: !707, size: 32, offset: 4896)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !772, file: !207, line: 3504, baseType: !368, size: 32, offset: 4928)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !772, file: !207, line: 3505, baseType: !368, size: 32, offset: 4960)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !772, file: !207, line: 3506, baseType: !368, size: 32, offset: 4992)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !772, file: !207, line: 3507, baseType: !1065, size: 32, offset: 5024)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !207, line: 2530, baseType: !257)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !772, file: !207, line: 3509, baseType: !517, size: 64, offset: 5056)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !772, file: !207, line: 3510, baseType: !363, size: 64, offset: 5120)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !772, file: !207, line: 3511, baseType: !368, size: 32, offset: 5184)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !772, file: !207, line: 3512, baseType: !368, size: 32, offset: 5216)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !772, file: !207, line: 3514, baseType: !1071, size: 64, offset: 5248)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !207, line: 2478, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !207, line: 2479, size: 704, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !1073, file: !207, line: 2481, baseType: !382, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !1073, file: !207, line: 2483, baseType: !1071, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !1073, file: !207, line: 2484, baseType: !1071, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !1073, file: !207, line: 2485, baseType: !856, size: 128, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !1073, file: !207, line: 2486, baseType: !413, size: 8, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !1073, file: !207, line: 2487, baseType: !413, size: 8, offset: 328)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !1073, file: !207, line: 2488, baseType: !368, size: 32, offset: 352)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !1073, file: !207, line: 2489, baseType: !382, size: 64, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !1073, file: !207, line: 2490, baseType: !616, size: 192, offset: 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !1073, file: !207, line: 2491, baseType: !368, size: 32, offset: 640)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !772, file: !207, line: 3517, baseType: !368, size: 32, offset: 5312)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !772, file: !207, line: 3534, baseType: !368, size: 32, offset: 5344)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !772, file: !207, line: 3535, baseType: !960, size: 128, offset: 5376)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !772, file: !207, line: 3537, baseType: !707, size: 32, offset: 5504)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !772, file: !207, line: 3543, baseType: !368, size: 32, offset: 5536)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !772, file: !207, line: 3545, baseType: !368, size: 32, offset: 5568)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !772, file: !207, line: 3548, baseType: !368, size: 32, offset: 5600)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !772, file: !207, line: 3550, baseType: !707, size: 32, offset: 5632)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !772, file: !207, line: 3562, baseType: !368, size: 32, offset: 5664)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !772, file: !207, line: 3562, baseType: !368, size: 32, offset: 5696)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !772, file: !207, line: 3574, baseType: !368, size: 32, offset: 5728)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !772, file: !207, line: 3575, baseType: !1097, size: 64, offset: 5760)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !207, line: 3225, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !207, line: 3216, size: 192, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !1099, file: !207, line: 3218, baseType: !408, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !1099, file: !207, line: 3219, baseType: !925, size: 16, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !1099, file: !207, line: 3220, baseType: !413, size: 8, offset: 80)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !1099, file: !207, line: 3222, baseType: !413, size: 8, offset: 88)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !1099, file: !207, line: 3223, baseType: !408, size: 64, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !772, file: !207, line: 3578, baseType: !443, size: 192, offset: 5824)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !772, file: !207, line: 3579, baseType: !413, size: 8, offset: 6016)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !772, file: !207, line: 3581, baseType: !413, size: 8, offset: 6024)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !772, file: !207, line: 3585, baseType: !368, size: 32, offset: 6048)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !772, file: !207, line: 3593, baseType: !368, size: 32, offset: 6080)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !772, file: !207, line: 3594, baseType: !368, size: 32, offset: 6112)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_top", scope: !772, file: !207, line: 3596, baseType: !408, size: 64, offset: 6144)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_bot", scope: !772, file: !207, line: 3597, baseType: !408, size: 64, offset: 6208)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_status", scope: !772, file: !207, line: 3598, baseType: !368, size: 32, offset: 6272)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_cursor", scope: !772, file: !207, line: 3602, baseType: !960, size: 128, offset: 6336)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_virtcol", scope: !772, file: !207, line: 3603, baseType: !707, size: 32, offset: 6464)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topline", scope: !772, file: !207, line: 3604, baseType: !408, size: 64, offset: 6528)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_line_count", scope: !772, file: !207, line: 3605, baseType: !408, size: 64, offset: 6592)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topfill", scope: !772, file: !207, line: 3607, baseType: !368, size: 32, offset: 6656)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_empty", scope: !772, file: !207, line: 3609, baseType: !413, size: 8, offset: 6688)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "w_alt_fnum", scope: !772, file: !207, line: 3612, baseType: !368, size: 32, offset: 6720)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "w_alist", scope: !772, file: !207, line: 3614, baseType: !1123, size: 64, offset: 6784)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "alist_T", file: !207, line: 863, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arglist", file: !207, line: 858, size: 256, elements: !1126)
!1126 = !{!1127, !1128, !1129}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "al_ga", scope: !1125, file: !207, line: 860, baseType: !443, size: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "al_refcount", scope: !1125, file: !207, line: 861, baseType: !368, size: 32, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1125, file: !207, line: 862, baseType: !368, size: 32, offset: 224)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx", scope: !772, file: !207, line: 3615, baseType: !368, size: 32, offset: 6848)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx_invalid", scope: !772, file: !207, line: 3617, baseType: !368, size: 32, offset: 6880)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "w_localdir", scope: !772, file: !207, line: 3619, baseType: !363, size: 64, offset: 6912)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "w_prevdir", scope: !772, file: !207, line: 3621, baseType: !363, size: 64, offset: 6976)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "w_winbar", scope: !772, file: !207, line: 3623, baseType: !1135, size: 64, offset: 7040)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "vimmenu_T", file: !207, line: 67, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VimMenu", file: !207, line: 3889, size: 1984, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1152, !1153, !1154, !1155, !1157, !1158, !1160, !1161, !1162, !1163, !1380, !1381, !1382}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !1137, file: !207, line: 3891, baseType: !368, size: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !1137, file: !207, line: 3892, baseType: !368, size: 32, offset: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1137, file: !207, line: 3893, baseType: !363, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "dname", scope: !1137, file: !207, line: 3894, baseType: !363, size: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "en_name", scope: !1137, file: !207, line: 3896, baseType: !363, size: 64, offset: 192)
