; ModuleID = 'if_xcmdsrv.c'
source_filename = "if_xcmdsrv.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.PendingCommand = type { i32, i32, i8*, %struct.PendingCommand* }
%struct.Gui = type { i32, i32, i32, i32, i32, i32, i32, %struct.window_S*, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, %struct.GuiScrollbar, [3 x i32], i32, i32, i32, i32, i32, i32, %struct._PangoFontDescription*, i32, %struct._PangoFontDescription*, i64, i64, i64, i64, i32, %struct._GdkCursor*, i8*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GdkColor*, %struct._GdkColor*, %struct._GdkColor*, %struct._GdkGC*, %struct._PangoContext*, %struct._PangoFont*, %struct._PangoGlyphString*, %struct._GtkWidget*, %struct._GtkAccelGroup*, %struct._GtkWidget*, i8*, i32, i8*, i8* }

!116 = !DIEnumerator(name: "EVENT_EXITPRE", value: 37)
!117 = !DIEnumerator(name: "EVENT_FILEAPPENDCMD", value: 38)
!118 = !DIEnumerator(name: "EVENT_FILEAPPENDPOST", value: 39)
!119 = !DIEnumerator(name: "EVENT_FILEAPPENDPRE", value: 40)
!120 = !DIEnumerator(name: "EVENT_FILECHANGEDRO", value: 41)
!121 = !DIEnumerator(name: "EVENT_FILECHANGEDSHELL", value: 42)
!122 = !DIEnumerator(name: "EVENT_FILECHANGEDSHELLPOST", value: 43)
!123 = !DIEnumerator(name: "EVENT_FILEREADCMD", value: 44)
!124 = !DIEnumerator(name: "EVENT_FILEREADPOST", value: 45)
!125 = !DIEnumerator(name: "EVENT_FILEREADPRE", value: 46)
!126 = !DIEnumerator(name: "EVENT_FILETYPE", value: 47)
!127 = !DIEnumerator(name: "EVENT_FILEWRITECMD", value: 48)
!128 = !DIEnumerator(name: "EVENT_FILEWRITEPOST", value: 49)
!129 = !DIEnumerator(name: "EVENT_FILEWRITEPRE", value: 50)
!130 = !DIEnumerator(name: "EVENT_FILTERREADPOST", value: 51)
!131 = !DIEnumerator(name: "EVENT_FILTERREADPRE", value: 52)
!132 = !DIEnumerator(name: "EVENT_FILTERWRITEPOST", value: 53)
!133 = !DIEnumerator(name: "EVENT_FILTERWRITEPRE", value: 54)
!134 = !DIEnumerator(name: "EVENT_FOCUSGAINED", value: 55)
!135 = !DIEnumerator(name: "EVENT_FOCUSLOST", value: 56)
!136 = !DIEnumerator(name: "EVENT_FUNCUNDEFINED", value: 57)
!137 = !DIEnumerator(name: "EVENT_GUIENTER", value: 58)
!138 = !DIEnumerator(name: "EVENT_GUIFAILED", value: 59)
!139 = !DIEnumerator(name: "EVENT_INSERTCHANGE", value: 60)
!140 = !DIEnumerator(name: "EVENT_INSERTCHARPRE", value: 61)
!141 = !DIEnumerator(name: "EVENT_INSERTENTER", value: 62)
!142 = !DIEnumerator(name: "EVENT_INSERTLEAVEPRE", value: 63)
!143 = !DIEnumerator(name: "EVENT_INSERTLEAVE", value: 64)
!144 = !DIEnumerator(name: "EVENT_MENUPOPUP", value: 65)
!145 = !DIEnumerator(name: "EVENT_OPTIONSET", value: 66)
!146 = !DIEnumerator(name: "EVENT_QUICKFIXCMDPOST", value: 67)
!147 = !DIEnumerator(name: "EVENT_QUICKFIXCMDPRE", value: 68)
!148 = !DIEnumerator(name: "EVENT_QUITPRE", value: 69)
!149 = !DIEnumerator(name: "EVENT_REMOTEREPLY", value: 70)
!150 = !DIEnumerator(name: "EVENT_SAFESTATE", value: 71)
!151 = !DIEnumerator(name: "EVENT_SAFESTATEAGAIN", value: 72)
!152 = !DIEnumerator(name: "EVENT_SESSIONLOADPOST", value: 73)
!153 = !DIEnumerator(name: "EVENT_SHELLCMDPOST", value: 74)
!154 = !DIEnumerator(name: "EVENT_SHELLFILTERPOST", value: 75)
!155 = !DIEnumerator(name: "EVENT_SIGUSR1", value: 76)
!156 = !DIEnumerator(name: "EVENT_SOURCECMD", value: 77)
!157 = !DIEnumerator(name: "EVENT_SOURCEPRE", value: 78)
!158 = !DIEnumerator(name: "EVENT_SOURCEPOST", value: 79)
!159 = !DIEnumerator(name: "EVENT_SPELLFILEMISSING", value: 80)
!160 = !DIEnumerator(name: "EVENT_STDINREADPOST", value: 81)
!161 = !DIEnumerator(name: "EVENT_STDINREADPRE", value: 82)
!162 = !DIEnumerator(name: "EVENT_SWAPEXISTS", value: 83)
!163 = !DIEnumerator(name: "EVENT_SYNTAX", value: 84)
!164 = !DIEnumerator(name: "EVENT_TABCLOSED", value: 85)
!165 = !DIEnumerator(name: "EVENT_TABENTER", value: 86)
!166 = !DIEnumerator(name: "EVENT_TABLEAVE", value: 87)
!167 = !DIEnumerator(name: "EVENT_TABNEW", value: 88)
!168 = !DIEnumerator(name: "EVENT_TERMCHANGED", value: 89)
!169 = !DIEnumerator(name: "EVENT_TERMINALOPEN", value: 90)
!170 = !DIEnumerator(name: "EVENT_TERMINALWINOPEN", value: 91)
!171 = !DIEnumerator(name: "EVENT_TERMRESPONSE", value: 92)
!172 = !DIEnumerator(name: "EVENT_TEXTCHANGED", value: 93)
!173 = !DIEnumerator(name: "EVENT_TEXTCHANGEDI", value: 94)
!174 = !DIEnumerator(name: "EVENT_TEXTCHANGEDP", value: 95)
!175 = !DIEnumerator(name: "EVENT_TEXTYANKPOST", value: 96)
!176 = !DIEnumerator(name: "EVENT_USER", value: 97)
!177 = !DIEnumerator(name: "EVENT_VIMENTER", value: 98)
!178 = !DIEnumerator(name: "EVENT_VIMLEAVE", value: 99)
!179 = !DIEnumerator(name: "EVENT_VIMLEAVEPRE", value: 100)
!180 = !DIEnumerator(name: "EVENT_VIMRESIZED", value: 101)
!181 = !DIEnumerator(name: "EVENT_WINENTER", value: 102)
!182 = !DIEnumerator(name: "EVENT_WINLEAVE", value: 103)
!183 = !DIEnumerator(name: "EVENT_WINNEW", value: 104)
!184 = !DIEnumerator(name: "EVENT_VIMSUSPEND", value: 105)
!185 = !DIEnumerator(name: "EVENT_VIMRESUME", value: 106)
!186 = !DIEnumerator(name: "NUM_EVENTS", value: 107)
!187 = !{!188, !190, !191, !192, !194, !329, !330, !333, !334, !278, !193, !320, !335, !344, !346, !347, !361, !363}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_u", file: !6, line: 326, baseType: !193)
!193 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "_XPrivDisplay", file: !195, line: 550, baseType: !196)
!195 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "/home/sahil/vim/src")
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 493, size: 2368, elements: !198)
!198 = !{!199, !213, !216, !217, !218, !219, !220, !221, !225, !226, !227, !228, !234, !235, !236, !237, !238, !239, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !263, !267, !268, !269, !270, !321, !322, !323, !324, !325, !326, !327, !328}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !197, file: !195, line: 498, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExtData", file: !195, line: 155, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XExtData", file: !195, line: 148, size: 256, elements: !203)
!203 = !{!204, !205, !207, !211}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !202, file: !195, line: 149, baseType: !190, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !195, line: 150, baseType: !206, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "free_private", scope: !202, file: !195, line: 151, baseType: !208, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!190, !206}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !202, file: !195, line: 154, baseType: !212, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPointer", file: !195, line: 80, baseType: !188)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !197, file: !195, line: 499, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XPrivate", file: !195, line: 490, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !197, file: !195, line: 500, baseType: !190, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !197, file: !195, line: 501, baseType: !190, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "proto_major_version", scope: !197, file: !195, line: 502, baseType: !190, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "proto_minor_version", scope: !197, file: !195, line: 503, baseType: !190, size: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !197, file: !195, line: 504, baseType: !188, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !197, file: !195, line: 505, baseType: !222, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !223, line: 66, baseType: !224)
!223 = !DIFile(filename: "/usr/include/X11/X.h", directory: "/home/sahil/vim/src")
!224 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "private4", scope: !197, file: !195, line: 506, baseType: !222, size: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !197, file: !195, line: 507, baseType: !222, size: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !197, file: !195, line: 508, baseType: !190, size: 32, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "resource_alloc", scope: !197, file: !195, line: 509, baseType: !229, size: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!222, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !195, line: 255, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !197, file: !195, line: 512, baseType: !190, size: 32, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_unit", scope: !197, file: !195, line: 513, baseType: !190, size: 32, offset: 672)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_pad", scope: !197, file: !195, line: 514, baseType: !190, size: 32, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_bit_order", scope: !197, file: !195, line: 515, baseType: !190, size: 32, offset: 736)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nformats", scope: !197, file: !195, line: 516, baseType: !190, size: 32, offset: 768)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pixmap_format", scope: !197, file: !195, line: 517, baseType: !240, size: 64, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScreenFormat", file: !195, line: 285, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 280, size: 192, elements: !243)
!243 = !{!244, !245, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !242, file: !195, line: 281, baseType: !200, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !242, file: !195, line: 282, baseType: !190, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !242, file: !195, line: 283, baseType: !190, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "scanline_pad", scope: !242, file: !195, line: 284, baseType: !190, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "private8", scope: !197, file: !195, line: 518, baseType: !190, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !197, file: !195, line: 519, baseType: !190, size: 32, offset: 928)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "private9", scope: !197, file: !195, line: 520, baseType: !214, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "private10", scope: !197, file: !195, line: 520, baseType: !214, size: 64, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !197, file: !195, line: 521, baseType: !190, size: 32, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "last_request_read", scope: !197, file: !195, line: 522, baseType: !224, size: 64, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !197, file: !195, line: 523, baseType: !224, size: 64, offset: 1216)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "private11", scope: !197, file: !195, line: 524, baseType: !212, size: 64, offset: 1280)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "private12", scope: !197, file: !195, line: 525, baseType: !212, size: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "private13", scope: !197, file: !195, line: 526, baseType: !212, size: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "private14", scope: !197, file: !195, line: 527, baseType: !212, size: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_size", scope: !197, file: !195, line: 528, baseType: !193, size: 32, offset: 1536)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !197, file: !195, line: 529, baseType: !261, size: 64, offset: 1600)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XrmHashBucketRec", file: !195, line: 491, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "private15", scope: !197, file: !195, line: 530, baseType: !264, size: 64, offset: 1664)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!190, !232}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "display_name", scope: !197, file: !195, line: 533, baseType: !188, size: 64, offset: 1728)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "default_screen", scope: !197, file: !195, line: 534, baseType: !190, size: 32, offset: 1792)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nscreens", scope: !197, file: !195, line: 535, baseType: !190, size: 32, offset: 1824)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "screens", scope: !197, file: !195, line: 536, baseType: !271, size: 64, offset: 1856)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "Screen", file: !195, line: 275, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 257, size: 1024, elements: !274)
!274 = !{!275, !276, !277, !279, !280, !281, !282, !283, !284, !305, !306, !307, !311, !313, !314, !315, !316, !317, !318, !319}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !273, file: !195, line: 258, baseType: !200, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !273, file: !195, line: 259, baseType: !232, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !273, file: !195, line: 260, baseType: !278, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !223, line: 96, baseType: !222)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !273, file: !195, line: 261, baseType: !190, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !273, file: !195, line: 261, baseType: !190, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "mwidth", scope: !273, file: !195, line: 262, baseType: !190, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mheight", scope: !273, file: !195, line: 262, baseType: !190, size: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ndepths", scope: !273, file: !195, line: 263, baseType: !190, size: 32, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !273, file: !195, line: 264, baseType: !285, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "Depth", file: !195, line: 247, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 243, size: 128, elements: !288)
!288 = !{!289, !290, !291}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !287, file: !195, line: 244, baseType: !190, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "nvisuals", scope: !287, file: !195, line: 245, baseType: !190, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "visuals", scope: !287, file: !195, line: 246, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visual", file: !195, line: 238, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 227, size: 448, elements: !295)
!295 = !{!296, !297, !299, !300, !301, !302, !303, !304}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !294, file: !195, line: 228, baseType: !200, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !294, file: !195, line: 229, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "VisualID", file: !223, line: 76, baseType: !224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !294, file: !195, line: 233, baseType: !190, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !294, file: !195, line: 235, baseType: !224, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !294, file: !195, line: 235, baseType: !224, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !294, file: !195, line: 235, baseType: !224, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !294, file: !195, line: 236, baseType: !190, size: 32, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "map_entries", scope: !294, file: !195, line: 237, baseType: !190, size: 32, offset: 416)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "root_depth", scope: !273, file: !195, line: 265, baseType: !190, size: 32, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "root_visual", scope: !273, file: !195, line: 266, baseType: !292, size: 64, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "default_gc", scope: !273, file: !195, line: 267, baseType: !308, size: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "GC", file: !195, line: 222, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XGC", file: !195, line: 214, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !273, file: !195, line: 268, baseType: !312, size: 64, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !223, line: 104, baseType: !222)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "white_pixel", scope: !273, file: !195, line: 269, baseType: !224, size: 64, offset: 704)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "black_pixel", scope: !273, file: !195, line: 270, baseType: !224, size: 64, offset: 768)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "max_maps", scope: !273, file: !195, line: 271, baseType: !190, size: 32, offset: 832)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "min_maps", scope: !273, file: !195, line: 271, baseType: !190, size: 32, offset: 864)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !273, file: !195, line: 272, baseType: !190, size: 32, offset: 896)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "save_unders", scope: !273, file: !195, line: 273, baseType: !190, size: 32, offset: 928)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "root_input_mask", scope: !273, file: !195, line: 274, baseType: !320, size: 64, offset: 960)
!320 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "motion_buffer", scope: !197, file: !195, line: 537, baseType: !224, size: 64, offset: 1920)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "private16", scope: !197, file: !195, line: 538, baseType: !224, size: 64, offset: 1984)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "min_keycode", scope: !197, file: !195, line: 539, baseType: !190, size: 32, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "max_keycode", scope: !197, file: !195, line: 540, baseType: !190, size: 32, offset: 2080)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "private17", scope: !197, file: !195, line: 541, baseType: !212, size: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "private18", scope: !197, file: !195, line: 542, baseType: !212, size: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "private19", scope: !197, file: !195, line: 543, baseType: !190, size: 32, offset: 2240)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "xdefaults", scope: !197, file: !195, line: 544, baseType: !188, size: 64, offset: 2304)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atom", file: !223, line: 74, baseType: !224)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !6, line: 324, baseType: !332)
!332 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !6, line: 345, baseType: !224)
!334 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PendingCommand", file: !3, line: 74, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PendingCommand", file: !3, line: 65, size: 192, elements: !338)
!338 = !{!339, !340, !341, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !337, file: !3, line: 67, baseType: !190, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !337, file: !3, line: 68, baseType: !190, size: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !337, file: !3, line: 69, baseType: !330, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "nextPtr", scope: !337, file: !3, line: 71, baseType: !343, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !345, line: 49, baseType: !320)
!345 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/sahil/vim/src")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ServerReply", file: !3, line: 162, size: 256, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !348, file: !3, line: 164, baseType: !278, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "strings", scope: !348, file: !3, line: 165, baseType: !352, size: 192, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !353, line: 55, baseType: !354)
!353 = !DIFile(filename: "./structs.h", directory: "/home/sahil/vim/src")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !353, line: 48, size: 192, elements: !355)
!355 = !{!356, !357, !358, !359, !360}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !354, file: !353, line: 50, baseType: !190, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !354, file: !353, line: 51, baseType: !190, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !354, file: !353, line: 52, baseType: !190, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !354, file: !353, line: 53, baseType: !190, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !354, file: !353, line: 54, baseType: !191, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !362, line: 62, baseType: !224)
!362 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "x_queue_T", file: !3, line: 180, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x_cmdqueue", file: !3, line: 172, size: 256, elements: !366)
!366 = !{!367, !368, !369, !371}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "propInfo", scope: !365, file: !3, line: 174, baseType: !330, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !365, file: !3, line: 175, baseType: !333, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !3, line: 176, baseType: !370, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !365, file: !3, line: 177, baseType: !370, size: 64, offset: 192)
!372 = !{!373, !400, !0, !402, !404, !406, !408, !410}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "serial", scope: !375, file: !3, line: 382, type: !190, isLocal: true, isDefinition: true)
!375 = distinct !DISubprogram(name: "serverSendToVim", scope: !3, file: !3, line: 367, type: !376, isLocal: false, isDefinition: true, scopeLine: 377, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !381)
!376 = !DISubroutineType(types: !377)
!377 = !{!190, !378, !330, !330, !380, !346, !190, !190, !190, !190}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !195, line: 487, baseType: !233)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!382 = !DILocalVariable(name: "dpy", arg: 1, scope: !375, file: !3, line: 368, type: !378)
!383 = !DILocalVariable(name: "name", arg: 2, scope: !375, file: !3, line: 369, type: !330)
!384 = !DILocalVariable(name: "cmd", arg: 3, scope: !375, file: !3, line: 370, type: !330)
!385 = !DILocalVariable(name: "result", arg: 4, scope: !375, file: !3, line: 371, type: !380)
!386 = !DILocalVariable(name: "server", arg: 5, scope: !375, file: !3, line: 372, type: !346)
!387 = !DILocalVariable(name: "asExpr", arg: 6, scope: !375, file: !3, line: 373, type: !190)
!388 = !DILocalVariable(name: "timeout", arg: 7, scope: !375, file: !3, line: 374, type: !190)
!389 = !DILocalVariable(name: "localLoop", arg: 8, scope: !375, file: !3, line: 375, type: !190)
!390 = !DILocalVariable(name: "silent", arg: 9, scope: !375, file: !3, line: 376, type: !190)
!391 = !DILocalVariable(name: "w", scope: !375, file: !3, line: 378, type: !278)
!392 = !DILocalVariable(name: "property", scope: !375, file: !3, line: 379, type: !330)
!393 = !DILocalVariable(name: "length", scope: !375, file: !3, line: 380, type: !190)
!394 = !DILocalVariable(name: "res", scope: !375, file: !3, line: 381, type: !190)
!395 = !DILocalVariable(name: "pending", scope: !375, file: !3, line: 385, type: !336)
!396 = !DILocalVariable(name: "loosename", scope: !375, file: !3, line: 386, type: !330)
!397 = !DILocalVariable(name: "pcPtr", scope: !398, file: !3, line: 490, type: !335)
!398 = distinct !DILexicalBlock(scope: !399, file: !3, line: 489, column: 5)
!399 = distinct !DILexicalBlock(scope: !375, file: !3, line: 486, column: 9)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "got_x_error", scope: !2, file: !3, line: 206, type: !190, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "pendingCommands", scope: !2, file: !3, line: 76, type: !335, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "vimProperty", scope: !2, file: !3, line: 205, type: !329, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "empty_prop", scope: !2, file: !3, line: 208, type: !330, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "serverReply", scope: !2, file: !3, line: 167, type: !352, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "head", scope: !2, file: !3, line: 183, type: !364, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!413 = !{i32 2, !"Dwarf Version", i32 4}
!414 = !{i32 2, !"Debug Info Version", i32 3}
!415 = !{i32 1, !"wchar_size", i32 4}
!416 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!417 = distinct !DISubprogram(name: "serverRegisterName", scope: !3, file: !3, line: 215, type: !418, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !420)
!418 = !DISubroutineType(types: !419)
!419 = !{!190, !378, !330}
!420 = !{!421, !422, !423, !424, !425}
!421 = !DILocalVariable(name: "dpy", arg: 1, scope: !417, file: !3, line: 216, type: !378)
!422 = !DILocalVariable(name: "name", arg: 2, scope: !417, file: !3, line: 217, type: !330)
!423 = !DILocalVariable(name: "i", scope: !417, file: !3, line: 219, type: !190)
!424 = !DILocalVariable(name: "res", scope: !417, file: !3, line: 220, type: !190)
!425 = !DILocalVariable(name: "p", scope: !417, file: !3, line: 221, type: !330)
!426 = !DILocation(line: 216, column: 14, scope: !417)
!427 = !DILocation(line: 217, column: 13, scope: !417)
!428 = !DILocation(line: 221, column: 13, scope: !417)
!429 = !DILocation(line: 223, column: 11, scope: !417)
!430 = !DILocation(line: 220, column: 10, scope: !417)
!431 = !DILocation(line: 224, column: 13, scope: !432)
!432 = distinct !DILexicalBlock(scope: !417, file: !3, line: 224, column: 9)
!433 = !DILocation(line: 224, column: 9, scope: !417)
!434 = distinct !{!434, !435, !437}
!435 = !DILocation(line: 227, column: 2, scope: !436)
!436 = distinct !DILexicalBlock(scope: !432, file: !3, line: 225, column: 5)
!437 = !DILocation(line: 245, column: 16, scope: !436)
!438 = !DILocation(line: 229, column: 14, scope: !439)
!439 = distinct !DILexicalBlock(scope: !440, file: !3, line: 229, column: 10)
!440 = distinct !DILexicalBlock(scope: !436, file: !3, line: 228, column: 2)
!441 = !DILocation(line: 219, column: 10, scope: !417)
!442 = !DILocation(line: 229, column: 24, scope: !439)
!443 = !DILocation(line: 229, column: 19, scope: !439)
!444 = !DILocation(line: 231, column: 12, scope: !445)
!445 = distinct !DILexicalBlock(scope: !439, file: !3, line: 230, column: 6)
!446 = !DILocation(line: 232, column: 14, scope: !445)
!447 = !{!448, !448, i64 0}
!448 = !{!"int", !449, i64 0}
!449 = !{!"omnipotent char", !450, i64 0}
!450 = !{!"Simple C/C++ TBAA"}
!451 = !DILocation(line: 231, column: 3, scope: !445)
!452 = !DILocation(line: 233, column: 3, scope: !445)
!453 = !DILocation(line: 235, column: 12, scope: !454)
!454 = distinct !DILexicalBlock(scope: !440, file: !3, line: 235, column: 10)
!455 = !DILocation(line: 235, column: 10, scope: !440)
!456 = !DILocation(line: 236, column: 13, scope: !454)
!457 = !DILocation(line: 236, column: 26, scope: !454)
!458 = !DILocation(line: 236, column: 7, scope: !454)
!459 = !DILocation(line: 237, column: 12, scope: !460)
!460 = distinct !DILexicalBlock(scope: !440, file: !3, line: 237, column: 10)
!461 = !DILocation(line: 237, column: 10, scope: !440)
!462 = !DILocation(line: 242, column: 40, scope: !440)
!463 = !DILocation(line: 242, column: 6, scope: !440)
!464 = !DILocation(line: 243, column: 12, scope: !440)
!465 = !DILocation(line: 244, column: 2, scope: !440)
!466 = !DILocation(line: 245, column: 13, scope: !436)
!467 = !DILocation(line: 247, column: 2, scope: !436)
!468 = !DILocation(line: 248, column: 5, scope: !436)
!469 = !DILocation(line: 250, column: 1, scope: !417)
!470 = distinct !DISubprogram(name: "DoRegisterName", scope: !3, file: !3, line: 253, type: !418, isLocal: true, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !471)
!471 = !{!472, !473, !474, !475, !491, !495, !498, !499, !500}
!472 = !DILocalVariable(name: "dpy", arg: 1, scope: !470, file: !3, line: 253, type: !378)
!473 = !DILocalVariable(name: "name", arg: 2, scope: !470, file: !3, line: 253, type: !330)
!474 = !DILocalVariable(name: "w", scope: !470, file: !3, line: 255, type: !278)
!475 = !DILocalVariable(name: "old_handler", scope: !470, file: !3, line: 256, type: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "XErrorHandler", file: !195, line: 1843, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!190, !378, !480}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "XErrorEvent", file: !195, line: 932, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 924, size: 320, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !482, file: !195, line: 925, baseType: !190, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !482, file: !195, line: 926, baseType: !378, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "resourceid", scope: !482, file: !195, line: 927, baseType: !222, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !482, file: !195, line: 928, baseType: !224, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "error_code", scope: !482, file: !195, line: 929, baseType: !332, size: 8, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "request_code", scope: !482, file: !195, line: 930, baseType: !332, size: 8, offset: 264)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !482, file: !195, line: 931, baseType: !332, size: 8, offset: 272)
!491 = !DILocalVariable(name: "propInfo", scope: !470, file: !3, line: 258, type: !492)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 960, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 120)
!495 = !DILocalVariable(name: "status", scope: !496, file: !3, line: 277, type: !190)
!496 = distinct !DILexicalBlock(scope: !497, file: !3, line: 276, column: 5)
!497 = distinct !DILexicalBlock(scope: !470, file: !3, line: 275, column: 9)
!498 = !DILocalVariable(name: "dummyInt", scope: !496, file: !3, line: 278, type: !190)
!499 = !DILocalVariable(name: "dummyUns", scope: !496, file: !3, line: 279, type: !193)
!500 = !DILocalVariable(name: "dummyWin", scope: !496, file: !3, line: 280, type: !278)
!501 = !DILocation(line: 253, column: 25, scope: !470)
!502 = !DILocation(line: 253, column: 38, scope: !470)
!503 = !DILocation(line: 258, column: 5, scope: !470)
!504 = !DILocation(line: 258, column: 12, scope: !470)
!505 = !DILocation(line: 260, column: 9, scope: !506)
!506 = distinct !DILexicalBlock(scope: !470, file: !3, line: 260, column: 9)
!507 = !{!508, !508, i64 0}
!508 = !{!"long", !449, i64 0}
!509 = !DILocation(line: 260, column: 22, scope: !506)
!510 = !DILocation(line: 260, column: 9, scope: !470)
!511 = !DILocation(line: 262, column: 6, scope: !512)
!512 = distinct !DILexicalBlock(scope: !513, file: !3, line: 262, column: 6)
!513 = distinct !DILexicalBlock(scope: !506, file: !3, line: 261, column: 5)
!514 = !DILocation(line: 262, column: 20, scope: !512)
!515 = !DILocation(line: 262, column: 6, scope: !513)
!516 = !DILocation(line: 273, column: 5, scope: !470)
!517 = !DILocation(line: 274, column: 9, scope: !470)
!518 = !DILocation(line: 255, column: 12, scope: !470)
!519 = !DILocation(line: 275, column: 11, scope: !497)
!520 = !DILocation(line: 275, column: 9, scope: !470)
!521 = !DILocation(line: 278, column: 2, scope: !496)
!522 = !DILocation(line: 279, column: 2, scope: !496)
!523 = !DILocation(line: 280, column: 2, scope: !496)
!524 = !DILocation(line: 289, column: 16, scope: !496)
!525 = !DILocation(line: 256, column: 19, scope: !470)
!526 = !DILocation(line: 278, column: 7, scope: !496)
!527 = !DILocation(line: 279, column: 15, scope: !496)
!528 = !DILocation(line: 280, column: 10, scope: !496)
!529 = !DILocation(line: 290, column: 11, scope: !496)
!530 = !DILocation(line: 277, column: 10, scope: !496)
!531 = !DILocation(line: 292, column: 8, scope: !496)
!532 = !DILocation(line: 293, column: 13, scope: !533)
!533 = distinct !DILexicalBlock(scope: !496, file: !3, line: 293, column: 6)
!534 = !DILocation(line: 293, column: 32, scope: !533)
!535 = !DILocation(line: 293, column: 29, scope: !533)
!536 = !DILocation(line: 293, column: 24, scope: !533)
!537 = !DILocation(line: 295, column: 6, scope: !538)
!538 = distinct !DILexicalBlock(scope: !533, file: !3, line: 294, column: 2)
!539 = !DILocation(line: 296, column: 6, scope: !538)
!540 = !DILocation(line: 300, column: 5, scope: !497)
!541 = !DILocation(line: 299, column: 8, scope: !496)
!542 = !DILocation(line: 301, column: 49, scope: !470)
!543 = !DILocation(line: 301, column: 42, scope: !470)
!544 = !DILocation(line: 301, column: 5, scope: !470)
!545 = !DILocation(line: 303, column: 19, scope: !470)
!546 = !DILocation(line: 305, column: 26, scope: !470)
!547 = !{!548, !549, i64 232}
!548 = !{!"", !549, i64 0, !549, i64 8, !448, i64 16, !448, i64 20, !448, i64 24, !448, i64 28, !549, i64 32, !508, i64 40, !508, i64 48, !508, i64 56, !448, i64 64, !549, i64 72, !448, i64 80, !448, i64 84, !448, i64 88, !448, i64 92, !448, i64 96, !549, i64 104, !448, i64 112, !448, i64 116, !549, i64 120, !549, i64 128, !448, i64 136, !508, i64 144, !508, i64 152, !549, i64 160, !549, i64 168, !549, i64 176, !549, i64 184, !448, i64 192, !549, i64 200, !549, i64 208, !549, i64 216, !448, i64 224, !448, i64 228, !549, i64 232, !508, i64 240, !508, i64 248, !448, i64 256, !448, i64 260, !549, i64 264, !549, i64 272, !448, i64 280, !549, i64 288}
!549 = !{!"any pointer", !449, i64 0}
!550 = !{!551, !508, i64 16}
!551 = !{!"", !549, i64 0, !549, i64 8, !508, i64 16, !448, i64 24, !448, i64 28, !448, i64 32, !448, i64 36, !448, i64 40, !549, i64 48, !448, i64 56, !549, i64 64, !549, i64 72, !508, i64 80, !508, i64 88, !508, i64 96, !448, i64 104, !448, i64 108, !448, i64 112, !448, i64 116, !508, i64 120}
!552 = !DILocation(line: 305, column: 46, scope: !470)
!553 = !DILocation(line: 306, column: 33, scope: !470)
!554 = !DILocation(line: 305, column: 5, scope: !470)
!555 = !DILocation(line: 307, column: 5, scope: !470)
!556 = !DILocation(line: 308, column: 5, scope: !470)
!557 = !DILocation(line: 309, column: 11, scope: !470)
!558 = !DILocation(line: 311, column: 9, scope: !470)
!559 = !DILocation(line: 314, column: 2, scope: !560)
!560 = distinct !DILexicalBlock(scope: !561, file: !3, line: 312, column: 5)
!561 = distinct !DILexicalBlock(scope: !470, file: !3, line: 311, column: 9)
!562 = !DILocation(line: 316, column: 15, scope: !560)
!563 = !DILocation(line: 316, column: 13, scope: !560)
!564 = !{!549, !549, i64 0}
!565 = !DILocation(line: 318, column: 17, scope: !560)
!566 = !DILocation(line: 320, column: 2, scope: !560)
!567 = !DILocation(line: 323, column: 1, scope: !470)
!568 = distinct !DISubprogram(name: "serverChangeRegisteredWindow", scope: !3, file: !3, line: 331, type: !569, isLocal: false, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !571)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !378, !278}
!571 = !{!572, !573, !574}
!572 = !DILocalVariable(name: "dpy", arg: 1, scope: !568, file: !3, line: 332, type: !378)
!573 = !DILocalVariable(name: "newwin", arg: 2, scope: !568, file: !3, line: 333, type: !278)
!574 = !DILocalVariable(name: "propInfo", scope: !568, file: !3, line: 335, type: !492)
!575 = !DILocation(line: 332, column: 14, scope: !568)
!576 = !DILocation(line: 333, column: 12, scope: !568)
!577 = !DILocation(line: 335, column: 5, scope: !568)
!578 = !DILocation(line: 335, column: 12, scope: !568)
!579 = !DILocation(line: 337, column: 16, scope: !568)
!580 = !DILocation(line: 341, column: 9, scope: !581)
!581 = distinct !DILexicalBlock(scope: !568, file: !3, line: 341, column: 9)
!582 = !DILocation(line: 341, column: 23, scope: !581)
!583 = !DILocation(line: 341, column: 9, scope: !568)
!584 = !DILocation(line: 346, column: 5, scope: !568)
!585 = !DILocation(line: 347, column: 5, scope: !568)
!586 = !DILocation(line: 348, column: 9, scope: !587)
!587 = distinct !DILexicalBlock(scope: !568, file: !3, line: 348, column: 9)
!588 = !DILocation(line: 348, column: 20, scope: !587)
!589 = !DILocation(line: 348, column: 9, scope: !568)
!590 = !DILocation(line: 351, column: 8, scope: !591)
!591 = distinct !DILexicalBlock(scope: !587, file: !3, line: 349, column: 5)
!592 = !DILocation(line: 353, column: 3, scope: !591)
!593 = !DILocation(line: 353, column: 35, scope: !591)
!594 = !DILocation(line: 352, column: 2, scope: !591)
!595 = !DILocation(line: 354, column: 23, scope: !591)
!596 = !DILocation(line: 354, column: 43, scope: !591)
!597 = !DILocation(line: 356, column: 4, scope: !591)
!598 = !DILocation(line: 354, column: 2, scope: !591)
!599 = !DILocation(line: 357, column: 5, scope: !591)
!600 = !DILocation(line: 358, column: 5, scope: !568)
!601 = !DILocation(line: 359, column: 1, scope: !568)
!602 = distinct !DISubprogram(name: "SendInit", scope: !3, file: !3, line: 841, type: !603, isLocal: true, isDefinition: true, scopeLine: 842, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !605)
!603 = !DISubroutineType(types: !604)
!604 = !{!190, !378}
!605 = !{!606, !607}
!606 = !DILocalVariable(name: "dpy", arg: 1, scope: !602, file: !3, line: 841, type: !378)
!607 = !DILocalVariable(name: "old_handler", scope: !602, file: !3, line: 843, type: !476)
!608 = !DILocation(line: 841, column: 19, scope: !602)
!609 = !DILocation(line: 849, column: 19, scope: !602)
!610 = !DILocation(line: 843, column: 19, scope: !602)
!611 = !DILocation(line: 852, column: 9, scope: !612)
!612 = distinct !DILexicalBlock(scope: !602, file: !3, line: 852, column: 9)
!613 = !DILocation(line: 852, column: 22, scope: !612)
!614 = !DILocation(line: 852, column: 9, scope: !602)
!615 = !DILocation(line: 853, column: 17, scope: !612)
!616 = !DILocation(line: 853, column: 15, scope: !612)
!617 = !DILocation(line: 853, column: 2, scope: !612)
!618 = !DILocation(line: 854, column: 9, scope: !619)
!619 = distinct !DILexicalBlock(scope: !602, file: !3, line: 854, column: 9)
!620 = !DILocation(line: 854, column: 21, scope: !619)
!621 = !DILocation(line: 854, column: 9, scope: !602)
!622 = !DILocation(line: 855, column: 16, scope: !619)
!623 = !DILocation(line: 855, column: 14, scope: !619)
!624 = !DILocation(line: 855, column: 2, scope: !619)
!625 = !DILocation(line: 856, column: 9, scope: !626)
!626 = distinct !DILexicalBlock(scope: !602, file: !3, line: 856, column: 9)
!627 = !DILocation(line: 856, column: 26, scope: !626)
!628 = !DILocation(line: 856, column: 9, scope: !602)
!629 = !DILocation(line: 857, column: 21, scope: !626)
!630 = !DILocation(line: 857, column: 19, scope: !626)
!631 = !DILocation(line: 857, column: 2, scope: !626)
!632 = !DILocation(line: 859, column: 9, scope: !633)
!633 = distinct !DILexicalBlock(scope: !602, file: !3, line: 859, column: 9)
!634 = !DILocation(line: 859, column: 20, scope: !633)
!635 = !DILocation(line: 859, column: 9, scope: !602)
!636 = !DILocation(line: 861, column: 40, scope: !637)
!637 = distinct !DILexicalBlock(scope: !633, file: !3, line: 860, column: 5)
!638 = !DILocation(line: 862, column: 5, scope: !637)
!639 = !DILocation(line: 863, column: 5, scope: !637)
!640 = !{!548, !448, i64 224}
!641 = !{!551, !508, i64 88}
!642 = !DILocation(line: 861, column: 15, scope: !637)
!643 = !DILocation(line: 861, column: 13, scope: !637)
!644 = !DILocation(line: 865, column: 2, scope: !637)
!645 = !DILocation(line: 868, column: 2, scope: !637)
!646 = !DILocation(line: 869, column: 25, scope: !637)
!647 = !DILocation(line: 869, column: 2, scope: !637)
!648 = !DILocation(line: 870, column: 2, scope: !637)
!649 = !DILocation(line: 874, column: 26, scope: !602)
!650 = !DILocation(line: 871, column: 5, scope: !637)
!651 = !DILocation(line: 874, column: 38, scope: !602)
!652 = !DILocation(line: 874, column: 5, scope: !602)
!653 = !DILocation(line: 878, column: 5, scope: !602)
!654 = !DILocation(line: 879, column: 11, scope: !602)
!655 = !DILocation(line: 881, column: 12, scope: !602)
!656 = !DILocation(line: 881, column: 5, scope: !602)
!657 = distinct !DISubprogram(name: "DeleteAnyLingerer", scope: !3, file: !3, line: 991, type: !569, isLocal: true, isDefinition: true, scopeLine: 994, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666}
!659 = !DILocalVariable(name: "dpy", arg: 1, scope: !657, file: !3, line: 992, type: !378)
!660 = !DILocalVariable(name: "win", arg: 2, scope: !657, file: !3, line: 993, type: !278)
!661 = !DILocalVariable(name: "regProp", scope: !657, file: !3, line: 995, type: !330)
!662 = !DILocalVariable(name: "entry", scope: !657, file: !3, line: 995, type: !330)
!663 = !DILocalVariable(name: "p", scope: !657, file: !3, line: 996, type: !330)
!664 = !DILocalVariable(name: "numItems", scope: !657, file: !3, line: 997, type: !333)
!665 = !DILocalVariable(name: "wwin", scope: !657, file: !3, line: 998, type: !192)
!666 = !DILocalVariable(name: "lastHalf", scope: !667, file: !3, line: 1014, type: !190)
!667 = distinct !DILexicalBlock(scope: !668, file: !3, line: 1013, column: 6)
!668 = distinct !DILexicalBlock(scope: !669, file: !3, line: 1012, column: 10)
!669 = distinct !DILexicalBlock(scope: !670, file: !3, line: 1010, column: 2)
!670 = distinct !DILexicalBlock(scope: !671, file: !3, line: 1009, column: 6)
!671 = distinct !DILexicalBlock(scope: !672, file: !3, line: 1008, column: 5)
!672 = distinct !DILexicalBlock(scope: !673, file: !3, line: 1007, column: 5)
!673 = distinct !DILexicalBlock(scope: !657, file: !3, line: 1007, column: 5)
!674 = !DILocation(line: 992, column: 14, scope: !657)
!675 = !DILocation(line: 993, column: 12, scope: !657)
!676 = !DILocation(line: 995, column: 5, scope: !657)
!677 = !DILocation(line: 995, column: 23, scope: !657)
!678 = !DILocation(line: 997, column: 5, scope: !657)
!679 = !DILocation(line: 998, column: 5, scope: !657)
!680 = !DILocation(line: 995, column: 13, scope: !657)
!681 = !DILocation(line: 997, column: 12, scope: !657)
!682 = !DILocation(line: 1003, column: 9, scope: !683)
!683 = distinct !DILexicalBlock(scope: !657, file: !3, line: 1003, column: 9)
!684 = !DILocation(line: 1003, column: 53, scope: !683)
!685 = !DILocation(line: 1003, column: 9, scope: !657)
!686 = !DILocation(line: 1007, column: 14, scope: !673)
!687 = !DILocation(line: 996, column: 13, scope: !657)
!688 = !DILocation(line: 1007, column: 47, scope: !672)
!689 = !DILocation(line: 1007, column: 45, scope: !672)
!690 = !DILocation(line: 1007, column: 5, scope: !673)
!691 = !DILocation(line: 1007, column: 34, scope: !672)
!692 = !DILocation(line: 1009, column: 6, scope: !670)
!693 = !{!449, !449, i64 0}
!694 = !DILocation(line: 1009, column: 9, scope: !670)
!695 = !DILocation(line: 1009, column: 6, scope: !671)
!696 = !DILocation(line: 998, column: 11, scope: !657)
!697 = !DILocation(line: 1011, column: 6, scope: !669)
!698 = !DILocation(line: 1012, column: 18, scope: !668)
!699 = !DILocation(line: 1012, column: 10, scope: !668)
!700 = !DILocation(line: 1012, column: 23, scope: !668)
!701 = !DILocation(line: 1012, column: 10, scope: !669)
!702 = !DILocation(line: 1029, column: 9, scope: !671)
!703 = !DILocation(line: 1018, column: 10, scope: !667)
!704 = !DILocation(line: 1018, column: 13, scope: !667)
!705 = !DILocation(line: 1018, column: 3, scope: !667)
!706 = distinct !{!706, !705, !707}
!707 = !DILocation(line: 1019, column: 8, scope: !667)
!708 = !DILocation(line: 1021, column: 14, scope: !667)
!709 = !DILocation(line: 1021, column: 30, scope: !667)
!710 = !DILocation(line: 1021, column: 28, scope: !667)
!711 = !DILocation(line: 1021, column: 23, scope: !667)
!712 = !DILocation(line: 1014, column: 7, scope: !667)
!713 = !DILocation(line: 1022, column: 16, scope: !714)
!714 = distinct !DILexicalBlock(scope: !667, file: !3, line: 1022, column: 7)
!715 = !DILocation(line: 1022, column: 7, scope: !667)
!716 = !DILocation(line: 1023, column: 7, scope: !714)
!717 = !DILocation(line: 1024, column: 23, scope: !667)
!718 = !DILocation(line: 1024, column: 21, scope: !667)
!719 = !DILocation(line: 1024, column: 32, scope: !667)
!720 = !DILocation(line: 1024, column: 12, scope: !667)
!721 = !DILocation(line: 1029, column: 12, scope: !671)
!722 = !DILocation(line: 1029, column: 2, scope: !671)
!723 = distinct !{!723, !722, !724}
!724 = !DILocation(line: 1030, column: 7, scope: !671)
!725 = !DILocation(line: 1007, column: 36, scope: !672)
!726 = distinct !{!726, !690, !727}
!727 = !DILocation(line: 1032, column: 5, scope: !673)
!728 = !DILocation(line: 1034, column: 15, scope: !729)
!729 = distinct !DILexicalBlock(scope: !657, file: !3, line: 1034, column: 9)
!730 = !DILocation(line: 1034, column: 9, scope: !657)
!731 = !DILocation(line: 1036, column: 23, scope: !732)
!732 = distinct !DILexicalBlock(scope: !729, file: !3, line: 1035, column: 5)
!733 = !DILocation(line: 1036, column: 43, scope: !732)
!734 = !DILocation(line: 1038, column: 4, scope: !732)
!735 = !DILocation(line: 1036, column: 2, scope: !732)
!736 = !DILocation(line: 1039, column: 2, scope: !732)
!737 = !DILocation(line: 1042, column: 9, scope: !738)
!738 = distinct !DILexicalBlock(scope: !657, file: !3, line: 1042, column: 9)
!739 = !DILocation(line: 1040, column: 5, scope: !732)
!740 = !DILocation(line: 1042, column: 17, scope: !738)
!741 = !DILocation(line: 1042, column: 9, scope: !657)
!742 = !DILocation(line: 1043, column: 2, scope: !738)
!743 = !DILocation(line: 1044, column: 1, scope: !657)
!744 = distinct !DISubprogram(name: "LookupName", scope: !3, file: !3, line: 897, type: !745, isLocal: true, isDefinition: true, scopeLine: 903, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !747)
!745 = !DISubroutineType(types: !746)
!746 = !{!278, !378, !330, !190, !380}
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!748 = !DILocalVariable(name: "dpy", arg: 1, scope: !744, file: !3, line: 898, type: !378)
!749 = !DILocalVariable(name: "name", arg: 2, scope: !744, file: !3, line: 899, type: !330)
!750 = !DILocalVariable(name: "delete", arg: 3, scope: !744, file: !3, line: 900, type: !190)
!751 = !DILocalVariable(name: "loose", arg: 4, scope: !744, file: !3, line: 901, type: !380)
!752 = !DILocalVariable(name: "regProp", scope: !744, file: !3, line: 904, type: !330)
!753 = !DILocalVariable(name: "entry", scope: !744, file: !3, line: 904, type: !330)
!754 = !DILocalVariable(name: "p", scope: !744, file: !3, line: 905, type: !330)
!755 = !DILocalVariable(name: "numItems", scope: !744, file: !3, line: 906, type: !333)
!756 = !DILocalVariable(name: "returnValue", scope: !744, file: !3, line: 907, type: !192)
!757 = !DILocalVariable(name: "count", scope: !758, file: !3, line: 962, type: !190)
!758 = distinct !DILexicalBlock(scope: !759, file: !3, line: 961, column: 5)
!759 = distinct !DILexicalBlock(scope: !744, file: !3, line: 960, column: 9)
!760 = !DILocation(line: 898, column: 14, scope: !744)
!761 = !DILocation(line: 899, column: 13, scope: !744)
!762 = !DILocation(line: 900, column: 10, scope: !744)
!763 = !DILocation(line: 901, column: 14, scope: !744)
!764 = !DILocation(line: 904, column: 5, scope: !744)
!765 = !DILocation(line: 906, column: 5, scope: !744)
!766 = !DILocation(line: 907, column: 5, scope: !744)
!767 = !DILocation(line: 904, column: 13, scope: !744)
!768 = !DILocation(line: 906, column: 12, scope: !744)
!769 = !DILocation(line: 912, column: 9, scope: !770)
!770 = distinct !DILexicalBlock(scope: !744, file: !3, line: 912, column: 9)
!771 = !DILocation(line: 912, column: 53, scope: !770)
!772 = !DILocation(line: 912, column: 9, scope: !744)
!773 = !DILocation(line: 907, column: 11, scope: !744)
!774 = !DILocation(line: 918, column: 17, scope: !744)
!775 = !DILocation(line: 904, column: 23, scope: !744)
!776 = !DILocation(line: 920, column: 14, scope: !777)
!777 = distinct !DILexicalBlock(scope: !744, file: !3, line: 920, column: 5)
!778 = !DILocation(line: 905, column: 13, scope: !744)
!779 = !DILocation(line: 920, column: 36, scope: !780)
!780 = distinct !DILexicalBlock(scope: !777, file: !3, line: 920, column: 5)
!781 = !DILocation(line: 920, column: 47, scope: !780)
!782 = !DILocation(line: 920, column: 45, scope: !780)
!783 = !DILocation(line: 920, column: 5, scope: !777)
!784 = !DILocation(line: 923, column: 9, scope: !785)
!785 = distinct !DILexicalBlock(scope: !780, file: !3, line: 921, column: 5)
!786 = !DILocation(line: 923, column: 12, scope: !785)
!787 = !DILocation(line: 923, column: 17, scope: !785)
!788 = !DILocation(line: 923, column: 21, scope: !785)
!789 = distinct !{!789, !790, !791}
!790 = !DILocation(line: 923, column: 2, scope: !785)
!791 = !DILocation(line: 924, column: 7, scope: !785)
!792 = !{!793, !793, i64 0}
!793 = !{!"short", !449, i64 0}
!794 = !DILocation(line: 923, column: 20, scope: !785)
!795 = !DILocation(line: 925, column: 17, scope: !796)
!796 = distinct !DILexicalBlock(scope: !785, file: !3, line: 925, column: 6)
!797 = !DILocation(line: 925, column: 38, scope: !796)
!798 = !DILocation(line: 925, column: 6, scope: !785)
!799 = !DILocation(line: 927, column: 6, scope: !800)
!800 = distinct !DILexicalBlock(scope: !796, file: !3, line: 926, column: 2)
!801 = !DILocation(line: 935, column: 26, scope: !802)
!802 = distinct !DILexicalBlock(scope: !744, file: !3, line: 935, column: 9)
!803 = !DILocation(line: 928, column: 6, scope: !800)
!804 = !DILocation(line: 930, column: 12, scope: !785)
!805 = !DILocation(line: 930, column: 2, scope: !785)
!806 = distinct !{!806, !805, !807}
!807 = !DILocation(line: 931, column: 7, scope: !785)
!808 = !DILocation(line: 930, column: 9, scope: !785)
!809 = !DILocation(line: 920, column: 34, scope: !780)
!810 = distinct !{!810, !783, !811}
!811 = !DILocation(line: 933, column: 5, scope: !777)
!812 = !DILocation(line: 935, column: 15, scope: !802)
!813 = !DILocation(line: 935, column: 23, scope: !802)
!814 = !DILocalVariable(name: "str", arg: 1, scope: !815, file: !3, line: 1520, type: !330)
!815 = distinct !DISubprogram(name: "IsSerialName", scope: !3, file: !3, line: 1520, type: !816, isLocal: true, isDefinition: true, scopeLine: 1521, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !818)
!816 = !DISubroutineType(types: !817)
!817 = !{!190, !330}
!818 = !{!814, !819}
!819 = !DILocalVariable(name: "len", scope: !815, file: !3, line: 1522, type: !190)
!820 = !DILocation(line: 1520, column: 22, scope: !815, inlinedAt: !821)
!821 = distinct !DILocation(line: 935, column: 57, scope: !802)
!822 = !DILocation(line: 1522, column: 15, scope: !815, inlinedAt: !821)
!823 = !DILocation(line: 1522, column: 9, scope: !815, inlinedAt: !821)
!824 = !DILocation(line: 1524, column: 17, scope: !815, inlinedAt: !821)
!825 = !DILocation(line: 1524, column: 21, scope: !815, inlinedAt: !821)
!826 = !DILocation(line: 1524, column: 36, scope: !815, inlinedAt: !821)
!827 = !DILocation(line: 1524, column: 24, scope: !815, inlinedAt: !821)
!828 = !DILocation(line: 935, column: 9, scope: !744)
!829 = !DILocation(line: 937, column: 11, scope: !830)
!830 = distinct !DILexicalBlock(scope: !831, file: !3, line: 937, column: 2)
!831 = distinct !DILexicalBlock(scope: !802, file: !3, line: 936, column: 5)
!832 = !DILocation(line: 937, column: 44, scope: !833)
!833 = distinct !DILexicalBlock(scope: !830, file: !3, line: 937, column: 2)
!834 = !DILocation(line: 937, column: 42, scope: !833)
!835 = !DILocation(line: 937, column: 2, scope: !830)
!836 = !DILocation(line: 940, column: 13, scope: !837)
!837 = distinct !DILexicalBlock(scope: !833, file: !3, line: 938, column: 2)
!838 = !DILocation(line: 940, column: 16, scope: !837)
!839 = !DILocation(line: 940, column: 21, scope: !837)
!840 = !DILocation(line: 940, column: 25, scope: !837)
!841 = distinct !{!841, !842, !843}
!842 = !DILocation(line: 940, column: 6, scope: !837)
!843 = !DILocation(line: 941, column: 4, scope: !837)
!844 = !DILocation(line: 940, column: 24, scope: !837)
!845 = !DILocation(line: 1520, column: 22, scope: !815, inlinedAt: !846)
!846 = distinct !DILocation(line: 942, column: 21, scope: !847)
!847 = distinct !DILexicalBlock(scope: !837, file: !3, line: 942, column: 10)
!848 = !DILocation(line: 1522, column: 15, scope: !815, inlinedAt: !846)
!849 = !DILocation(line: 1522, column: 9, scope: !815, inlinedAt: !846)
!850 = !DILocation(line: 1524, column: 17, scope: !815, inlinedAt: !846)
!851 = !DILocation(line: 1524, column: 21, scope: !815, inlinedAt: !846)
!852 = !DILocation(line: 1524, column: 36, scope: !815, inlinedAt: !846)
!853 = !DILocation(line: 1524, column: 24, scope: !815, inlinedAt: !846)
!854 = !DILocation(line: 943, column: 7, scope: !847)
!855 = !DILocation(line: 943, column: 10, scope: !847)
!856 = !DILocation(line: 943, column: 46, scope: !847)
!857 = !DILocation(line: 942, column: 10, scope: !837)
!858 = !DILocation(line: 949, column: 13, scope: !837)
!859 = !DILocation(line: 945, column: 3, scope: !860)
!860 = distinct !DILexicalBlock(scope: !847, file: !3, line: 944, column: 6)
!861 = !DILocation(line: 946, column: 12, scope: !860)
!862 = !DILocation(line: 946, column: 10, scope: !860)
!863 = !DILocation(line: 947, column: 3, scope: !860)
!864 = !DILocation(line: 949, column: 16, scope: !837)
!865 = !DILocation(line: 949, column: 6, scope: !837)
!866 = distinct !{!866, !865, !867}
!867 = !DILocation(line: 950, column: 4, scope: !837)
!868 = !DILocation(line: 937, column: 33, scope: !833)
!869 = !DILocation(line: 937, column: 31, scope: !833)
!870 = distinct !{!870, !835, !871}
!871 = !DILocation(line: 952, column: 2, scope: !830)
!872 = !DILocation(line: 960, column: 9, scope: !759)
!873 = !DILocation(line: 960, column: 19, scope: !759)
!874 = !DILocation(line: 960, column: 31, scope: !759)
!875 = !DILocation(line: 960, column: 16, scope: !759)
!876 = !DILocation(line: 964, column: 9, scope: !758)
!877 = !DILocation(line: 964, column: 12, scope: !758)
!878 = !DILocation(line: 964, column: 2, scope: !758)
!879 = distinct !{!879, !878, !880}
!880 = !DILocation(line: 965, column: 7, scope: !758)
!881 = !DILocation(line: 967, column: 10, scope: !758)
!882 = !DILocation(line: 967, column: 26, scope: !758)
!883 = !DILocation(line: 967, column: 24, scope: !758)
!884 = !DILocation(line: 967, column: 19, scope: !758)
!885 = !DILocation(line: 962, column: 6, scope: !758)
!886 = !DILocation(line: 968, column: 12, scope: !887)
!887 = distinct !DILexicalBlock(scope: !758, file: !3, line: 968, column: 6)
!888 = !DILocation(line: 968, column: 6, scope: !758)
!889 = !DILocation(line: 969, column: 6, scope: !887)
!890 = !DILocation(line: 971, column: 24, scope: !758)
!891 = !DILocation(line: 972, column: 10, scope: !758)
!892 = !DILocation(line: 970, column: 23, scope: !758)
!893 = !DILocation(line: 970, column: 43, scope: !758)
!894 = !DILocation(line: 972, column: 24, scope: !758)
!895 = !DILocation(line: 972, column: 19, scope: !758)
!896 = !DILocation(line: 972, column: 4, scope: !758)
!897 = !DILocation(line: 970, column: 2, scope: !758)
!898 = !DILocation(line: 973, column: 2, scope: !758)
!899 = !DILocation(line: 974, column: 5, scope: !758)
!900 = !DILocation(line: 976, column: 9, scope: !901)
!901 = distinct !DILexicalBlock(scope: !744, file: !3, line: 976, column: 9)
!902 = !DILocation(line: 976, column: 17, scope: !901)
!903 = !DILocation(line: 976, column: 9, scope: !744)
!904 = !DILocation(line: 977, column: 2, scope: !901)
!905 = !DILocation(line: 978, column: 20, scope: !744)
!906 = !DILocation(line: 978, column: 12, scope: !744)
!907 = !DILocation(line: 978, column: 5, scope: !744)
!908 = !DILocation(line: 979, column: 1, scope: !744)
!909 = !DILocation(line: 368, column: 14, scope: !375)
!910 = !DILocation(line: 369, column: 13, scope: !375)
!911 = !DILocation(line: 370, column: 13, scope: !375)
!912 = !DILocation(line: 371, column: 14, scope: !375)
!913 = !DILocation(line: 372, column: 13, scope: !375)
!914 = !DILocation(line: 373, column: 10, scope: !375)
!915 = !DILocation(line: 374, column: 10, scope: !375)
!916 = !DILocation(line: 375, column: 10, scope: !375)
!917 = !DILocation(line: 376, column: 10, scope: !375)
!918 = !DILocation(line: 385, column: 5, scope: !375)
!919 = !DILocation(line: 386, column: 5, scope: !375)
!920 = !DILocation(line: 386, column: 17, scope: !375)
!921 = !DILocation(line: 388, column: 16, scope: !922)
!922 = distinct !DILexicalBlock(scope: !375, file: !3, line: 388, column: 9)
!923 = !DILocation(line: 388, column: 9, scope: !375)
!924 = !DILocation(line: 389, column: 10, scope: !922)
!925 = !DILocation(line: 389, column: 2, scope: !922)
!926 = !DILocation(line: 390, column: 14, scope: !927)
!927 = distinct !DILexicalBlock(scope: !375, file: !3, line: 390, column: 9)
!928 = !DILocation(line: 390, column: 22, scope: !927)
!929 = !DILocation(line: 390, column: 25, scope: !927)
!930 = !DILocation(line: 390, column: 31, scope: !927)
!931 = !DILocation(line: 390, column: 9, scope: !375)
!932 = !DILocation(line: 391, column: 2, scope: !927)
!933 = !DILocation(line: 393, column: 9, scope: !934)
!934 = distinct !DILexicalBlock(scope: !375, file: !3, line: 393, column: 9)
!935 = !DILocation(line: 393, column: 22, scope: !934)
!936 = !DILocation(line: 393, column: 37, scope: !934)
!937 = !DILocation(line: 393, column: 30, scope: !934)
!938 = !DILocation(line: 395, column: 6, scope: !939)
!939 = distinct !DILexicalBlock(scope: !940, file: !3, line: 395, column: 6)
!940 = distinct !DILexicalBlock(scope: !934, file: !3, line: 394, column: 5)
!941 = !DILocation(line: 395, column: 20, scope: !939)
!942 = !DILocation(line: 395, column: 6, scope: !940)
!943 = !DILocation(line: 400, column: 13, scope: !944)
!944 = distinct !DILexicalBlock(scope: !375, file: !3, line: 400, column: 9)
!945 = !DILocation(line: 400, column: 21, scope: !944)
!946 = !DILocation(line: 400, column: 25, scope: !944)
!947 = !DILocation(line: 400, column: 36, scope: !944)
!948 = !DILocation(line: 400, column: 44, scope: !944)
!949 = !DILocation(line: 400, column: 47, scope: !944)
!950 = !DILocation(line: 400, column: 73, scope: !944)
!951 = !DILocation(line: 400, column: 9, scope: !375)
!952 = !DILocation(line: 401, column: 9, scope: !944)
!953 = !DILocation(line: 401, column: 2, scope: !944)
!954 = !DILocation(line: 413, column: 6, scope: !955)
!955 = distinct !DILexicalBlock(scope: !375, file: !3, line: 412, column: 5)
!956 = !DILocation(line: 378, column: 16, scope: !375)
!957 = !DILocation(line: 415, column: 6, scope: !955)
!958 = !DILocation(line: 417, column: 11, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !3, line: 417, column: 10)
!960 = distinct !DILexicalBlock(scope: !961, file: !3, line: 416, column: 2)
!961 = distinct !DILexicalBlock(scope: !955, file: !3, line: 415, column: 6)
!962 = !DILocation(line: 417, column: 10, scope: !960)
!963 = !DILocation(line: 419, column: 3, scope: !964)
!964 = distinct !DILexicalBlock(scope: !959, file: !3, line: 418, column: 6)
!965 = !DILocation(line: 421, column: 12, scope: !964)
!966 = !DILocation(line: 421, column: 3, scope: !964)
!967 = distinct !{!967, !968, !969}
!968 = !DILocation(line: 411, column: 5, scope: !375)
!969 = !DILocation(line: 426, column: 5, scope: !375)
!970 = !DILocation(line: 429, column: 7, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !3, line: 429, column: 6)
!972 = distinct !DILexicalBlock(scope: !973, file: !3, line: 428, column: 5)
!973 = distinct !DILexicalBlock(scope: !375, file: !3, line: 427, column: 9)
!974 = !DILocation(line: 429, column: 6, scope: !972)
!975 = !DILocation(line: 430, column: 12, scope: !971)
!976 = !DILocation(line: 430, column: 6, scope: !971)
!977 = !DILocation(line: 435, column: 16, scope: !978)
!978 = distinct !DILexicalBlock(scope: !375, file: !3, line: 435, column: 9)
!979 = !DILocation(line: 435, column: 9, scope: !375)
!980 = !DILocation(line: 436, column: 10, scope: !978)
!981 = !DILocation(line: 436, column: 2, scope: !978)
!982 = !DILocation(line: 443, column: 14, scope: !375)
!983 = !DILocation(line: 443, column: 29, scope: !375)
!984 = !DILocation(line: 443, column: 27, scope: !375)
!985 = !DILocation(line: 443, column: 45, scope: !375)
!986 = !DILocation(line: 443, column: 43, scope: !375)
!987 = !DILocation(line: 444, column: 22, scope: !375)
!988 = !DILocation(line: 444, column: 16, scope: !375)
!989 = !DILocation(line: 379, column: 17, scope: !375)
!990 = !DILocation(line: 447, column: 12, scope: !375)
!991 = !DILocation(line: 447, column: 44, scope: !375)
!992 = !DILocation(line: 446, column: 5, scope: !375)
!993 = !DILocation(line: 448, column: 17, scope: !994)
!994 = distinct !DILexicalBlock(scope: !375, file: !3, line: 448, column: 9)
!995 = !DILocation(line: 448, column: 14, scope: !994)
!996 = !DILocation(line: 448, column: 9, scope: !375)
!997 = !DILocation(line: 449, column: 2, scope: !994)
!998 = !DILocation(line: 451, column: 11, scope: !375)
!999 = !DILocation(line: 452, column: 30, scope: !375)
!1000 = !DILocation(line: 453, column: 17, scope: !375)
!1001 = !DILocation(line: 453, column: 10, scope: !375)
!1002 = !DILocation(line: 452, column: 5, scope: !375)
!1003 = !DILocation(line: 455, column: 15, scope: !375)
!1004 = !DILocation(line: 455, column: 45, scope: !375)
!1005 = !DILocation(line: 455, column: 12, scope: !375)
!1006 = !DILocation(line: 380, column: 14, scope: !375)
!1007 = !DILocation(line: 457, column: 39, scope: !375)
!1008 = !DILocation(line: 457, column: 70, scope: !375)
!1009 = !DILocalVariable(name: "dpy", arg: 1, scope: !1010, file: !3, line: 1487, type: !378)
!1010 = distinct !DISubprogram(name: "AppendPropCarefully", scope: !3, file: !3, line: 1486, type: !1011, isLocal: true, isDefinition: true, scopeLine: 1492, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!190, !378, !278, !329, !330, !190}
!1013 = !{!1009, !1014, !1015, !1016, !1017, !1018}
!1014 = !DILocalVariable(name: "window", arg: 2, scope: !1010, file: !3, line: 1488, type: !278)
!1015 = !DILocalVariable(name: "property", arg: 3, scope: !1010, file: !3, line: 1489, type: !329)
!1016 = !DILocalVariable(name: "value", arg: 4, scope: !1010, file: !3, line: 1490, type: !330)
!1017 = !DILocalVariable(name: "length", arg: 5, scope: !1010, file: !3, line: 1491, type: !190)
!1018 = !DILocalVariable(name: "old_handler", scope: !1010, file: !3, line: 1493, type: !476)
!1019 = !DILocation(line: 1487, column: 14, scope: !1010, inlinedAt: !1020)
!1020 = distinct !DILocation(line: 457, column: 11, scope: !375)
!1021 = !DILocation(line: 1488, column: 12, scope: !1010, inlinedAt: !1020)
!1022 = !DILocation(line: 1489, column: 10, scope: !1010, inlinedAt: !1020)
!1023 = !DILocation(line: 1490, column: 13, scope: !1010, inlinedAt: !1020)
!1024 = !DILocation(line: 1491, column: 10, scope: !1010, inlinedAt: !1020)
!1025 = !DILocation(line: 1495, column: 19, scope: !1010, inlinedAt: !1020)
!1026 = !DILocation(line: 1493, column: 19, scope: !1010, inlinedAt: !1020)
!1027 = !DILocation(line: 1497, column: 5, scope: !1010, inlinedAt: !1020)
!1028 = !DILocation(line: 1499, column: 5, scope: !1010, inlinedAt: !1020)
!1029 = !DILocation(line: 1500, column: 12, scope: !1010, inlinedAt: !1020)
!1030 = !DILocation(line: 458, column: 5, scope: !375)
!1031 = !DILocation(line: 459, column: 9, scope: !375)
!1032 = !DILocation(line: 461, column: 7, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 460, column: 5)
!1034 = distinct !DILexicalBlock(scope: !375, file: !3, line: 459, column: 9)
!1035 = !DILocation(line: 461, column: 2, scope: !1033)
!1036 = !DILocation(line: 462, column: 2, scope: !1033)
!1037 = !DILocation(line: 465, column: 9, scope: !375)
!1038 = !DILocation(line: 473, column: 22, scope: !375)
!1039 = !DILocation(line: 473, column: 13, scope: !375)
!1040 = !DILocation(line: 473, column: 20, scope: !375)
!1041 = !{!1042, !448, i64 0}
!1042 = !{!"PendingCommand", !448, i64 0, !448, i64 4, !549, i64 8, !549, i64 16}
!1043 = !DILocation(line: 474, column: 13, scope: !375)
!1044 = !DILocation(line: 474, column: 18, scope: !375)
!1045 = !{!1042, !448, i64 4}
!1046 = !DILocation(line: 475, column: 13, scope: !375)
!1047 = !DILocation(line: 475, column: 20, scope: !375)
!1048 = !{!1042, !549, i64 8}
!1049 = !DILocation(line: 476, column: 23, scope: !375)
!1050 = !DILocation(line: 476, column: 13, scope: !375)
!1051 = !DILocation(line: 476, column: 21, scope: !375)
!1052 = !{!1042, !549, i64 16}
!1053 = !DILocation(line: 477, column: 21, scope: !375)
!1054 = !DILocation(line: 480, column: 17, scope: !375)
!1055 = !DILocation(line: 480, column: 9, scope: !375)
!1056 = !DILocation(line: 479, column: 5, scope: !375)
!1057 = !DILocation(line: 486, column: 9, scope: !399)
!1058 = !DILocation(line: 486, column: 25, scope: !399)
!1059 = !DILocation(line: 486, column: 9, scope: !375)
!1060 = !DILocation(line: 487, column: 28, scope: !399)
!1061 = !DILocation(line: 487, column: 18, scope: !399)
!1062 = !DILocation(line: 487, column: 2, scope: !399)
!1063 = !DILocation(line: 490, column: 18, scope: !398)
!1064 = !DILocation(line: 492, column: 38, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 492, column: 2)
!1066 = distinct !DILexicalBlock(scope: !398, file: !3, line: 492, column: 2)
!1067 = !DILocation(line: 492, column: 2, scope: !1066)
!1068 = !DILocation(line: 493, column: 17, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 493, column: 10)
!1070 = distinct !{!1070, !1067, !1071}
!1071 = !DILocation(line: 497, column: 6, scope: !1066)
!1072 = !DILocation(line: 493, column: 25, scope: !1069)
!1073 = !DILocation(line: 493, column: 10, scope: !1065)
!1074 = !DILocation(line: 495, column: 28, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 494, column: 6)
!1076 = !DILocation(line: 495, column: 18, scope: !1075)
!1077 = !DILocation(line: 496, column: 3, scope: !1075)
!1078 = !DILocation(line: 499, column: 9, scope: !375)
!1079 = !DILocation(line: 500, column: 10, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !375, file: !3, line: 499, column: 9)
!1081 = !DILocation(line: 500, column: 2, scope: !1080)
!1082 = !DILocation(line: 502, column: 2, scope: !1080)
!1083 = !DILocation(line: 504, column: 20, scope: !375)
!1084 = !DILocation(line: 504, column: 25, scope: !375)
!1085 = !DILocation(line: 504, column: 12, scope: !375)
!1086 = !DILocation(line: 504, column: 5, scope: !375)
!1087 = !DILocation(line: 505, column: 1, scope: !375)
!1088 = distinct !DISubprogram(name: "WindowValid", scope: !3, file: !3, line: 518, type: !1089, isLocal: true, isDefinition: true, scopeLine: 519, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1091)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!190, !378, !278}
!1091 = !{!1092, !1093, !1094, !1095, !1097, !1098}
!1092 = !DILocalVariable(name: "dpy", arg: 1, scope: !1088, file: !3, line: 518, type: !378)
!1093 = !DILocalVariable(name: "w", arg: 2, scope: !1088, file: !3, line: 518, type: !278)
!1094 = !DILocalVariable(name: "old_handler", scope: !1088, file: !3, line: 520, type: !476)
!1095 = !DILocalVariable(name: "plist", scope: !1088, file: !3, line: 521, type: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!1097 = !DILocalVariable(name: "numProp", scope: !1088, file: !3, line: 522, type: !190)
!1098 = !DILocalVariable(name: "i", scope: !1088, file: !3, line: 523, type: !190)
!1099 = !DILocation(line: 518, column: 22, scope: !1088)
!1100 = !DILocation(line: 518, column: 34, scope: !1088)
!1101 = !DILocation(line: 522, column: 5, scope: !1088)
!1102 = !DILocation(line: 525, column: 19, scope: !1088)
!1103 = !DILocation(line: 520, column: 21, scope: !1088)
!1104 = !DILocation(line: 522, column: 14, scope: !1088)
!1105 = !DILocation(line: 527, column: 13, scope: !1088)
!1106 = !DILocation(line: 521, column: 15, scope: !1088)
!1107 = !DILocation(line: 528, column: 5, scope: !1088)
!1108 = !DILocation(line: 529, column: 5, scope: !1088)
!1109 = !DILocation(line: 530, column: 15, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 530, column: 9)
!1111 = !DILocation(line: 530, column: 23, scope: !1110)
!1112 = !DILocation(line: 523, column: 14, scope: !1088)
!1113 = !DILocation(line: 533, column: 21, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !3, line: 533, column: 5)
!1115 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 533, column: 5)
!1116 = !DILocation(line: 533, column: 19, scope: !1114)
!1117 = !DILocation(line: 533, column: 5, scope: !1115)
!1118 = distinct !{!1118, !1117, !1119}
!1119 = !DILocation(line: 538, column: 2, scope: !1115)
!1120 = !DILocation(line: 534, column: 6, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 534, column: 6)
!1122 = !DILocation(line: 534, column: 15, scope: !1121)
!1123 = !DILocation(line: 533, column: 31, scope: !1114)
!1124 = !DILocation(line: 534, column: 6, scope: !1114)
!1125 = !DILocation(line: 536, column: 12, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 535, column: 2)
!1127 = !DILocation(line: 536, column: 6, scope: !1126)
!1128 = !DILocation(line: 537, column: 6, scope: !1126)
!1129 = !DILocation(line: 539, column: 11, scope: !1088)
!1130 = !DILocation(line: 539, column: 5, scope: !1088)
!1131 = !DILocation(line: 540, column: 5, scope: !1088)
!1132 = !DILocation(line: 541, column: 1, scope: !1088)
!1133 = distinct !DISubprogram(name: "ServerWait", scope: !3, file: !3, line: 547, type: !1134, isLocal: true, isDefinition: true, scopeLine: 554, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1140)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !378, !278, !1136, !191, !190, !190}
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndCond", file: !3, line: 170, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!190, !191}
!1140 = !{!1141, !1142, !1143, !1144, !1145, !1146, !1147, !1152, !1153, !1602, !1610, !1617, !1619}
!1141 = !DILocalVariable(name: "dpy", arg: 1, scope: !1133, file: !3, line: 548, type: !378)
!1142 = !DILocalVariable(name: "w", arg: 2, scope: !1133, file: !3, line: 549, type: !278)
!1143 = !DILocalVariable(name: "endCond", arg: 3, scope: !1133, file: !3, line: 550, type: !1136)
!1144 = !DILocalVariable(name: "endData", arg: 4, scope: !1133, file: !3, line: 551, type: !191)
!1145 = !DILocalVariable(name: "localLoop", arg: 5, scope: !1133, file: !3, line: 552, type: !190)
!1146 = !DILocalVariable(name: "seconds", arg: 6, scope: !1133, file: !3, line: 553, type: !190)
!1147 = !DILocalVariable(name: "start", scope: !1133, file: !3, line: 555, type: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1149, line: 7, baseType: !1150)
!1149 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "/home/sahil/vim/src")
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !1151, line: 160, baseType: !320)
!1151 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!1152 = !DILocalVariable(name: "now", scope: !1133, file: !3, line: 556, type: !1148)
!1153 = !DILocalVariable(name: "event", scope: !1133, file: !3, line: 557, type: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "XEvent", file: !195, line: 1009, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_XEvent", file: !195, line: 973, size: 1536, elements: !1156)
!1156 = !{!1157, !1158, !1167, !1187, !1206, !1225, !1246, !1257, !1271, !1288, !1299, !1309, !1325, !1335, !1346, !1357, !1367, !1381, !1398, !1410, !1421, !1439, !1450, !1461, !1473, !1484, !1498, !1511, !1523, !1550, !1562, !1563, !1576, !1586, !1598}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1155, file: !195, line: 974, baseType: !190, size: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "xany", scope: !1155, file: !195, line: 975, baseType: !1159, size: 320)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "XAnyEvent", file: !195, line: 940, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 934, size: 320, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1165, !1166}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1160, file: !195, line: 935, baseType: !190, size: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1160, file: !195, line: 936, baseType: !224, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1160, file: !195, line: 937, baseType: !190, size: 32, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1160, file: !195, line: 938, baseType: !378, size: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1160, file: !195, line: 939, baseType: !278, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "xkey", scope: !1155, file: !195, line: 976, baseType: !1168, size: 768)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeyEvent", file: !195, line: 571, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 557, size: 768, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1180, !1181, !1182, !1183, !1184, !1185, !1186}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1169, file: !195, line: 558, baseType: !190, size: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1169, file: !195, line: 559, baseType: !224, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1169, file: !195, line: 560, baseType: !190, size: 32, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1169, file: !195, line: 561, baseType: !378, size: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1169, file: !195, line: 562, baseType: !278, size: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1169, file: !195, line: 563, baseType: !278, size: 64, offset: 320)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1169, file: !195, line: 564, baseType: !278, size: 64, offset: 384)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1169, file: !195, line: 565, baseType: !1179, size: 64, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", file: !223, line: 77, baseType: !224)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1169, file: !195, line: 566, baseType: !190, size: 32, offset: 512)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1169, file: !195, line: 566, baseType: !190, size: 32, offset: 544)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1169, file: !195, line: 567, baseType: !190, size: 32, offset: 576)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1169, file: !195, line: 567, baseType: !190, size: 32, offset: 608)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1169, file: !195, line: 568, baseType: !193, size: 32, offset: 640)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !1169, file: !195, line: 569, baseType: !193, size: 32, offset: 672)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !1169, file: !195, line: 570, baseType: !190, size: 32, offset: 704)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "xbutton", scope: !1155, file: !195, line: 977, baseType: !1188, size: 768)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "XButtonEvent", file: !195, line: 589, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 575, size: 768, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1189, file: !195, line: 576, baseType: !190, size: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1189, file: !195, line: 577, baseType: !224, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1189, file: !195, line: 578, baseType: !190, size: 32, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1189, file: !195, line: 579, baseType: !378, size: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1189, file: !195, line: 580, baseType: !278, size: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1189, file: !195, line: 581, baseType: !278, size: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1189, file: !195, line: 582, baseType: !278, size: 64, offset: 384)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1189, file: !195, line: 583, baseType: !1179, size: 64, offset: 448)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1189, file: !195, line: 584, baseType: !190, size: 32, offset: 512)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1189, file: !195, line: 584, baseType: !190, size: 32, offset: 544)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1189, file: !195, line: 585, baseType: !190, size: 32, offset: 576)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1189, file: !195, line: 585, baseType: !190, size: 32, offset: 608)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1189, file: !195, line: 586, baseType: !193, size: 32, offset: 640)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !1189, file: !195, line: 587, baseType: !193, size: 32, offset: 672)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !1189, file: !195, line: 588, baseType: !190, size: 32, offset: 704)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "xmotion", scope: !1155, file: !195, line: 978, baseType: !1207, size: 768)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMotionEvent", file: !195, line: 607, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 593, size: 768, elements: !1209)
!1209 = !{!1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1208, file: !195, line: 594, baseType: !190, size: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1208, file: !195, line: 595, baseType: !224, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1208, file: !195, line: 596, baseType: !190, size: 32, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1208, file: !195, line: 597, baseType: !378, size: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1208, file: !195, line: 598, baseType: !278, size: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1208, file: !195, line: 599, baseType: !278, size: 64, offset: 320)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1208, file: !195, line: 600, baseType: !278, size: 64, offset: 384)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1208, file: !195, line: 601, baseType: !1179, size: 64, offset: 448)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1208, file: !195, line: 602, baseType: !190, size: 32, offset: 512)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1208, file: !195, line: 602, baseType: !190, size: 32, offset: 544)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1208, file: !195, line: 603, baseType: !190, size: 32, offset: 576)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1208, file: !195, line: 603, baseType: !190, size: 32, offset: 608)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1208, file: !195, line: 604, baseType: !193, size: 32, offset: 640)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "is_hint", scope: !1208, file: !195, line: 605, baseType: !189, size: 8, offset: 672)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !1208, file: !195, line: 606, baseType: !190, size: 32, offset: 704)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "xcrossing", scope: !1155, file: !195, line: 979, baseType: !1226, size: 832)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCrossingEvent", file: !195, line: 630, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 610, size: 832, elements: !1228)
!1228 = !{!1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1227, file: !195, line: 611, baseType: !190, size: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1227, file: !195, line: 612, baseType: !224, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1227, file: !195, line: 613, baseType: !190, size: 32, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1227, file: !195, line: 614, baseType: !378, size: 64, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1227, file: !195, line: 615, baseType: !278, size: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1227, file: !195, line: 616, baseType: !278, size: 64, offset: 320)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !1227, file: !195, line: 617, baseType: !278, size: 64, offset: 384)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1227, file: !195, line: 618, baseType: !1179, size: 64, offset: 448)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1227, file: !195, line: 619, baseType: !190, size: 32, offset: 512)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1227, file: !195, line: 619, baseType: !190, size: 32, offset: 544)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !1227, file: !195, line: 620, baseType: !190, size: 32, offset: 576)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !1227, file: !195, line: 620, baseType: !190, size: 32, offset: 608)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1227, file: !195, line: 621, baseType: !190, size: 32, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !1227, file: !195, line: 622, baseType: !190, size: 32, offset: 672)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !1227, file: !195, line: 627, baseType: !190, size: 32, offset: 704)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "focus", scope: !1227, file: !195, line: 628, baseType: !190, size: 32, offset: 736)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1227, file: !195, line: 629, baseType: !193, size: 32, offset: 768)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "xfocus", scope: !1155, file: !195, line: 980, baseType: !1247, size: 384)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "XFocusChangeEvent", file: !195, line: 648, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 634, size: 384, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1254, !1255, !1256}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1248, file: !195, line: 635, baseType: !190, size: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1248, file: !195, line: 636, baseType: !224, size: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1248, file: !195, line: 637, baseType: !190, size: 32, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1248, file: !195, line: 638, baseType: !378, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1248, file: !195, line: 639, baseType: !278, size: 64, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1248, file: !195, line: 640, baseType: !190, size: 32, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !1248, file: !195, line: 642, baseType: !190, size: 32, offset: 352)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "xexpose", scope: !1155, file: !195, line: 981, baseType: !1258, size: 512)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExposeEvent", file: !195, line: 671, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 662, size: 512, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1259, file: !195, line: 663, baseType: !190, size: 32)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1259, file: !195, line: 664, baseType: !224, size: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1259, file: !195, line: 665, baseType: !190, size: 32, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1259, file: !195, line: 666, baseType: !378, size: 64, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1259, file: !195, line: 667, baseType: !278, size: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1259, file: !195, line: 668, baseType: !190, size: 32, offset: 320)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1259, file: !195, line: 668, baseType: !190, size: 32, offset: 352)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1259, file: !195, line: 669, baseType: !190, size: 32, offset: 384)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1259, file: !195, line: 669, baseType: !190, size: 32, offset: 416)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1259, file: !195, line: 670, baseType: !190, size: 32, offset: 448)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "xgraphicsexpose", scope: !1155, file: !195, line: 982, baseType: !1272, size: 576)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGraphicsExposeEvent", file: !195, line: 684, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 673, size: 576, elements: !1274)
!1274 = !{!1275, !1276, !1277, !1278, !1279, !1281, !1282, !1283, !1284, !1285, !1286, !1287}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1273, file: !195, line: 674, baseType: !190, size: 32)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1273, file: !195, line: 675, baseType: !224, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1273, file: !195, line: 676, baseType: !190, size: 32, offset: 128)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1273, file: !195, line: 677, baseType: !378, size: 64, offset: 192)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !1273, file: !195, line: 678, baseType: !1280, size: 64, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !223, line: 97, baseType: !222)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1273, file: !195, line: 679, baseType: !190, size: 32, offset: 320)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1273, file: !195, line: 679, baseType: !190, size: 32, offset: 352)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1273, file: !195, line: 680, baseType: !190, size: 32, offset: 384)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1273, file: !195, line: 680, baseType: !190, size: 32, offset: 416)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1273, file: !195, line: 681, baseType: !190, size: 32, offset: 448)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !1273, file: !195, line: 682, baseType: !190, size: 32, offset: 480)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !1273, file: !195, line: 683, baseType: !190, size: 32, offset: 512)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "xnoexpose", scope: !1155, file: !195, line: 983, baseType: !1289, size: 384)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "XNoExposeEvent", file: !195, line: 694, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 686, size: 384, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295, !1296, !1297, !1298}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1290, file: !195, line: 687, baseType: !190, size: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1290, file: !195, line: 688, baseType: !224, size: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1290, file: !195, line: 689, baseType: !190, size: 32, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1290, file: !195, line: 690, baseType: !378, size: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !1290, file: !195, line: 691, baseType: !1280, size: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !1290, file: !195, line: 692, baseType: !190, size: 32, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !1290, file: !195, line: 693, baseType: !190, size: 32, offset: 352)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "xvisibility", scope: !1155, file: !195, line: 984, baseType: !1300, size: 384)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "XVisibilityEvent", file: !195, line: 703, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 696, size: 384, elements: !1302)
!1302 = !{!1303, !1304, !1305, !1306, !1307, !1308}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1301, file: !195, line: 697, baseType: !190, size: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1301, file: !195, line: 698, baseType: !224, size: 64, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1301, file: !195, line: 699, baseType: !190, size: 32, offset: 128)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1301, file: !195, line: 700, baseType: !378, size: 64, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1301, file: !195, line: 701, baseType: !278, size: 64, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1301, file: !195, line: 702, baseType: !190, size: 32, offset: 320)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "xcreatewindow", scope: !1155, file: !195, line: 985, baseType: !1310, size: 576)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCreateWindowEvent", file: !195, line: 716, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 705, size: 576, elements: !1312)
!1312 = !{!1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1311, file: !195, line: 706, baseType: !190, size: 32)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1311, file: !195, line: 707, baseType: !224, size: 64, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1311, file: !195, line: 708, baseType: !190, size: 32, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1311, file: !195, line: 709, baseType: !378, size: 64, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1311, file: !195, line: 710, baseType: !278, size: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1311, file: !195, line: 711, baseType: !278, size: 64, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1311, file: !195, line: 712, baseType: !190, size: 32, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1311, file: !195, line: 712, baseType: !190, size: 32, offset: 416)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1311, file: !195, line: 713, baseType: !190, size: 32, offset: 448)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1311, file: !195, line: 713, baseType: !190, size: 32, offset: 480)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !1311, file: !195, line: 714, baseType: !190, size: 32, offset: 512)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !1311, file: !195, line: 715, baseType: !190, size: 32, offset: 544)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "xdestroywindow", scope: !1155, file: !195, line: 986, baseType: !1326, size: 384)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDestroyWindowEvent", file: !195, line: 725, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 718, size: 384, elements: !1328)
!1328 = !{!1329, !1330, !1331, !1332, !1333, !1334}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1327, file: !195, line: 719, baseType: !190, size: 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1327, file: !195, line: 720, baseType: !224, size: 64, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1327, file: !195, line: 721, baseType: !190, size: 32, offset: 128)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1327, file: !195, line: 722, baseType: !378, size: 64, offset: 192)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1327, file: !195, line: 723, baseType: !278, size: 64, offset: 256)
