; ModuleID = 'job.c'
source_filename = "job.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.listitem_S = type { %struct.listitem_S*, %struct.listitem_S*, %struct.typval_T }
%struct.typval_T = type { i32, i8, %union.anon }
%union.anon = type { i64 }
%struct.Gui = type { i32, i32, i32, i32, i32, i32, i32, %struct.window_S*, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, %struct.GuiScrollbar, [3 x i32], i32, i32, i32, i32, i32, i32, %struct._PangoFontDescription*, i32, %struct._PangoFontDescription*, i64, i64, i64, i64, i32, %struct._GdkCursor*, i8*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GtkWidget*, %struct._GdkColor*, %struct._GdkColor*, %struct._GdkColor*, %struct._GdkGC*, %struct._PangoContext*, %struct._PangoFont*, %struct._PangoGlyphString*, %struct._GtkWidget*, %struct._GtkAccelGroup*, %struct._GtkWidget*, i8*, i32, i8*, i8* }

!11 = !DIEnumerator(name: "MODE_JS", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2148, size: 32, elements: !13)
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "JIO_PIPE", value: 0)
!15 = !DIEnumerator(name: "JIO_NULL", value: 1)
!16 = !DIEnumerator(name: "JIO_FILE", value: 2)
!17 = !DIEnumerator(name: "JIO_BUFFER", value: 3)
!18 = !DIEnumerator(name: "JIO_OUT", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1374, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!21 = !DIEnumerator(name: "VAR_UNKNOWN", value: 0)
!22 = !DIEnumerator(name: "VAR_ANY", value: 1)
!23 = !DIEnumerator(name: "VAR_VOID", value: 2)
!24 = !DIEnumerator(name: "VAR_BOOL", value: 3)
!25 = !DIEnumerator(name: "VAR_SPECIAL", value: 4)
!26 = !DIEnumerator(name: "VAR_NUMBER", value: 5)
!27 = !DIEnumerator(name: "VAR_FLOAT", value: 6)
!28 = !DIEnumerator(name: "VAR_STRING", value: 7)
!29 = !DIEnumerator(name: "VAR_BLOB", value: 8)
!30 = !DIEnumerator(name: "VAR_FUNC", value: 9)
!31 = !DIEnumerator(name: "VAR_PARTIAL", value: 10)
!32 = !DIEnumerator(name: "VAR_LIST", value: 11)
!33 = !DIEnumerator(name: "VAR_DICT", value: 12)
!34 = !DIEnumerator(name: "VAR_JOB", value: 13)
!35 = !DIEnumerator(name: "VAR_CHANNEL", value: 14)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1585, size: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42}
!38 = !DIEnumerator(name: "UF_NOT_COMPILED", value: 0)
!39 = !DIEnumerator(name: "UF_TO_BE_COMPILED", value: 1)
!40 = !DIEnumerator(name: "UF_COMPILING", value: 2)
!41 = !DIEnumerator(name: "UF_COMPILED", value: 3)
!42 = !DIEnumerator(name: "UF_COMPILE_ERROR", value: 4)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2061, size: 32, elements: !44)
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "JOB_FAILED", value: 0)
!46 = !DIEnumerator(name: "JOB_STARTED", value: 1)
!47 = !DIEnumerator(name: "JOB_ENDED", value: 2)
!48 = !DIEnumerator(name: "JOB_FINISHED", value: 3)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2517, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56}
!51 = !DIEnumerator(name: "POPPOS_BOTLEFT", value: 0)
!52 = !DIEnumerator(name: "POPPOS_TOPLEFT", value: 1)
!53 = !DIEnumerator(name: "POPPOS_BOTRIGHT", value: 2)
!54 = !DIEnumerator(name: "POPPOS_TOPRIGHT", value: 3)
!55 = !DIEnumerator(name: "POPPOS_CENTER", value: 4)
!56 = !DIEnumerator(name: "POPPOS_NONE", value: 5)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2526, size: 32, elements: !58)
!58 = !{!59, !60, !61}
!59 = !DIEnumerator(name: "POPCLOSE_NONE", value: 0)
!60 = !DIEnumerator(name: "POPCLOSE_BUTTON", value: 1)
!61 = !DIEnumerator(name: "POPCLOSE_CLICK", value: 2)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 55, size: 32, elements: !64)
!63 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkvisual.h", directory: "/home/sahil/vim/src")
!64 = !{!65, !66, !67, !68, !69, !70}
!65 = !DIEnumerator(name: "GDK_VISUAL_STATIC_GRAY", value: 0)
!66 = !DIEnumerator(name: "GDK_VISUAL_GRAYSCALE", value: 1)
!67 = !DIEnumerator(name: "GDK_VISUAL_STATIC_COLOR", value: 2)
!68 = !DIEnumerator(name: "GDK_VISUAL_PSEUDO_COLOR", value: 3)
!69 = !DIEnumerator(name: "GDK_VISUAL_TRUE_COLOR", value: 4)
!70 = !DIEnumerator(name: "GDK_VISUAL_DIRECT_COLOR", value: 5)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 118, size: 32, elements: !73)
!72 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdktypes.h", directory: "/home/sahil/vim/src")
!73 = !{!74, !75}
!74 = !DIEnumerator(name: "GDK_LSB_FIRST", value: 0)
!75 = !DIEnumerator(name: "GDK_MSB_FIRST", value: 1)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 43, size: 32, elements: !78)
!77 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkfont.h", directory: "/home/sahil/vim/src")
!78 = !{!79, !80}
!79 = !DIEnumerator(name: "GDK_FONT_FONT", value: 0)
!80 = !DIEnumerator(name: "GDK_FONT_FONTSET", value: 1)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 52, size: 32, elements: !83)
!82 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkrc.h", directory: "/home/sahil/vim/src")
!83 = !{!84, !85, !86, !87}
!84 = !DIEnumerator(name: "GTK_RC_FG", value: 1)
!85 = !DIEnumerator(name: "GTK_RC_BG", value: 2)
!86 = !DIEnumerator(name: "GTK_RC_TEXT", value: 4)
!87 = !DIEnumerator(name: "GTK_RC_BASE", value: 8)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2160, size: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94}
!90 = !DIEnumerator(name: "PART_SOCK", value: 0)
!91 = !DIEnumerator(name: "PART_OUT", value: 1)
!92 = !DIEnumerator(name: "PART_ERR", value: 2)
!93 = !DIEnumerator(name: "PART_IN", value: 3)
!94 = !DIEnumerator(name: "PART_COUNT", value: 4)
!95 = !{!96, !97, !99, !100, !101, !103, !115, !1774, !378, !490}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!99 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!100 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "guicolor_T", file: !102, line: 198, baseType: !100)
!102 = !DIFile(filename: "./gui.h", directory: "/home/sahil/vim/src")
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !6, line: 1365, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !6, line: 2072, size: 1024, elements: !106)
!106 = !{!107, !108, !109, !114, !119, !120, !122, !123, !124, !125, !1769, !1770, !1771, !1772, !1773}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !105, file: !6, line: 2074, baseType: !103, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !105, file: !6, line: 2075, baseType: !103, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !105, file: !6, line: 2077, baseType: !110, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !111, line: 97, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !113, line: 154, baseType: !99)
!113 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!114 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !105, file: !6, line: 2083, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !117, line: 324, baseType: !118)
!117 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !105, file: !6, line: 2084, baseType: !115, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !105, file: !6, line: 2085, baseType: !121, size: 32, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !6, line: 2067, baseType: !43)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !105, file: !6, line: 2086, baseType: !115, size: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !105, file: !6, line: 2088, baseType: !115, size: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !105, file: !6, line: 2093, baseType: !99, size: 32, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !105, file: !6, line: 2094, baseType: !126, size: 192, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !6, line: 1360, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1356, size: 192, elements: !128)
!128 = !{!129, !130, !1768}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !127, file: !6, line: 1357, baseType: !115, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !127, file: !6, line: 1358, baseType: !131, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !6, line: 1348, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !6, line: 1994, size: 832, elements: !134)
!134 = !{!135, !136, !137, !1743, !1744, !1754, !1764, !1765, !1766, !1767}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !133, file: !6, line: 1996, baseType: !99, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !133, file: !6, line: 1997, baseType: !115, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !133, file: !6, line: 1999, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !6, line: 1658, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1597, size: 3072, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !148, !149, !158, !159, !174, !175, !176, !177, !178, !179, !180, !181, !183, !184, !185, !186, !187, !196, !197, !198, !199, !201, !202, !203, !204, !205, !206, !207, !217, !218, !219, !1740, !1741}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !140, file: !6, line: 1599, baseType: !99, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !140, file: !6, line: 1600, baseType: !99, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !140, file: !6, line: 1601, baseType: !99, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !140, file: !6, line: 1602, baseType: !99, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !140, file: !6, line: 1603, baseType: !147, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !6, line: 1591, baseType: !36)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !140, file: !6, line: 1604, baseType: !99, size: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !140, file: !6, line: 1605, baseType: !150, size: 192, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !6, line: 55, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !6, line: 48, size: 192, elements: !152)
!152 = !{!153, !154, !155, !156, !157}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !151, file: !6, line: 50, baseType: !99, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !151, file: !6, line: 51, baseType: !99, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !151, file: !6, line: 52, baseType: !99, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !151, file: !6, line: 53, baseType: !99, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !151, file: !6, line: 54, baseType: !96, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !140, file: !6, line: 1606, baseType: !150, size: 192, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !140, file: !6, line: 1609, baseType: !160, size: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !6, line: 1394, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !6, line: 1395, size: 192, elements: !164)
!164 = !{!165, !167, !170, !171, !172, !173}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !163, file: !6, line: 1396, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !6, line: 1391, baseType: !19)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !163, file: !6, line: 1397, baseType: !168, size: 8, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !6, line: 1342, baseType: !169)
!169 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !163, file: !6, line: 1398, baseType: !98, size: 8, offset: 40)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !163, file: !6, line: 1399, baseType: !98, size: 8, offset: 48)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !163, file: !6, line: 1400, baseType: !161, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !163, file: !6, line: 1401, baseType: !160, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !140, file: !6, line: 1610, baseType: !161, size: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !140, file: !6, line: 1611, baseType: !150, size: 192, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !140, file: !6, line: 1612, baseType: !131, size: 64, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !140, file: !6, line: 1615, baseType: !115, size: 64, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !140, file: !6, line: 1616, baseType: !161, size: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !140, file: !6, line: 1617, baseType: !161, size: 64, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !140, file: !6, line: 1618, baseType: !99, size: 32, offset: 1152)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !140, file: !6, line: 1619, baseType: !182, size: 64, offset: 1216)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !140, file: !6, line: 1626, baseType: !150, size: 192, offset: 1280)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !140, file: !6, line: 1628, baseType: !99, size: 32, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !140, file: !6, line: 1629, baseType: !99, size: 32, offset: 1504)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !140, file: !6, line: 1631, baseType: !99, size: 32, offset: 1536)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !140, file: !6, line: 1632, baseType: !188, size: 128, offset: 1600)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !117, line: 1786, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !190, line: 8, size: 128, elements: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!191 = !{!192, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !189, file: !190, line: 10, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !113, line: 160, baseType: !100)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !189, file: !190, line: 11, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !113, line: 162, baseType: !100)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !140, file: !6, line: 1633, baseType: !188, size: 128, offset: 1728)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !140, file: !6, line: 1634, baseType: !188, size: 128, offset: 1856)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !140, file: !6, line: 1636, baseType: !182, size: 64, offset: 1984)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !140, file: !6, line: 1637, baseType: !200, size: 64, offset: 2048)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !140, file: !6, line: 1638, baseType: !200, size: 64, offset: 2112)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !140, file: !6, line: 1639, baseType: !188, size: 128, offset: 2176)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !140, file: !6, line: 1640, baseType: !188, size: 128, offset: 2304)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !140, file: !6, line: 1641, baseType: !188, size: 128, offset: 2432)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !140, file: !6, line: 1642, baseType: !99, size: 32, offset: 2560)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !140, file: !6, line: 1643, baseType: !99, size: 32, offset: 2592)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !140, file: !6, line: 1645, baseType: !208, size: 192, offset: 2624)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !6, line: 92, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 85, size: 192, elements: !210)
!210 = !{!211, !213, !214, !216}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !209, file: !6, line: 87, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !6, line: 62, baseType: !99)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !209, file: !6, line: 88, baseType: !99, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !209, file: !6, line: 89, baseType: !215, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !117, line: 1687, baseType: !100)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !209, file: !6, line: 91, baseType: !99, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !140, file: !6, line: 1648, baseType: !99, size: 32, offset: 2816)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !140, file: !6, line: 1649, baseType: !99, size: 32, offset: 2848)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !140, file: !6, line: 1651, baseType: !220, size: 64, offset: 2880)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !6, line: 1582, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !6, line: 1682, size: 17280, elements: !223)
!223 = !{!224, !225, !226, !227, !1724, !1725, !1726, !1727, !1728, !1729, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !222, file: !6, line: 1684, baseType: !138, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !222, file: !6, line: 1685, baseType: !99, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !222, file: !6, line: 1686, baseType: !99, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !222, file: !6, line: 1691, baseType: !228, size: 4608, offset: 128)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 4608, elements: !1722)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !222, file: !6, line: 1687, size: 384, elements: !230)
!230 = !{!231, !1720}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !229, file: !6, line: 1689, baseType: !232, size: 192)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !6, line: 1519, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !6, line: 1513, size: 192, elements: !234)
!234 = !{!235, !1718, !1719}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !233, file: !6, line: 1515, baseType: !236, size: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !6, line: 1432, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1412, size: 128, elements: !238)
!238 = !{!239, !240, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !237, file: !6, line: 1414, baseType: !166, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !237, file: !6, line: 1415, baseType: !98, size: 8, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !237, file: !6, line: 1431, baseType: !242, size: 64, offset: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !237, file: !6, line: 1416, size: 64, elements: !243)
!243 = !{!244, !247, !250, !251, !295, !331, !332, !333, !1710}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !242, file: !6, line: 1418, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !6, line: 1327, baseType: !246)
!246 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !242, file: !6, line: 1420, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !6, line: 1344, baseType: !249)
!249 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !242, file: !6, line: 1422, baseType: !115, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !242, file: !6, line: 1423, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !6, line: 1346, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !6, line: 1471, size: 768, elements: !255)
!255 = !{!256, !264, !271, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !254, file: !6, line: 1473, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !6, line: 1446, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !6, line: 1448, size: 256, elements: !260)
!260 = !{!261, !262, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !259, file: !6, line: 1450, baseType: !257, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !259, file: !6, line: 1451, baseType: !257, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !259, file: !6, line: 1452, baseType: !236, size: 128, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !254, file: !6, line: 1474, baseType: !265, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !6, line: 1456, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !6, line: 1458, size: 128, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !267, file: !6, line: 1460, baseType: !257, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !267, file: !6, line: 1461, baseType: !265, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !254, file: !6, line: 1487, baseType: !272, size: 192, offset: 128)
!272 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !254, file: !6, line: 1475, size: 192, elements: !273)
!273 = !{!274, !280}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !272, file: !6, line: 1481, baseType: !275, size: 192)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !272, file: !6, line: 1476, size: 192, elements: !276)
!276 = !{!277, !278, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !275, file: !6, line: 1478, baseType: !245, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !275, file: !6, line: 1479, baseType: !245, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !275, file: !6, line: 1480, baseType: !99, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !272, file: !6, line: 1486, baseType: !281, size: 192)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !272, file: !6, line: 1482, size: 192, elements: !282)
!282 = !{!283, !284, !285}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !281, file: !6, line: 1483, baseType: !257, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !281, file: !6, line: 1484, baseType: !257, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !281, file: !6, line: 1485, baseType: !99, size: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !254, file: !6, line: 1488, baseType: !161, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !254, file: !6, line: 1489, baseType: !252, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !254, file: !6, line: 1490, baseType: !252, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !254, file: !6, line: 1491, baseType: !252, size: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !254, file: !6, line: 1492, baseType: !99, size: 32, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !254, file: !6, line: 1493, baseType: !99, size: 32, offset: 608)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !254, file: !6, line: 1494, baseType: !99, size: 32, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !254, file: !6, line: 1496, baseType: !99, size: 32, offset: 672)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !254, file: !6, line: 1497, baseType: !98, size: 8, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !242, file: !6, line: 1424, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !6, line: 1347, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !6, line: 1545, size: 2816, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !327, !328, !329, !330}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !298, file: !6, line: 1547, baseType: !98, size: 8)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !298, file: !6, line: 1548, baseType: !98, size: 8, offset: 8)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !298, file: !6, line: 1549, baseType: !99, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !298, file: !6, line: 1550, baseType: !99, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !298, file: !6, line: 1551, baseType: !305, size: 2432, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !6, line: 1290, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !6, line: 1277, size: 2432, elements: !307)
!307 = !{!308, !311, !312, !313, !314, !315, !316, !323}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !306, file: !6, line: 1279, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !117, line: 345, baseType: !310)
!310 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !306, file: !6, line: 1281, baseType: !309, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !306, file: !6, line: 1282, baseType: !309, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !306, file: !6, line: 1283, baseType: !99, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !306, file: !6, line: 1284, baseType: !99, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !306, file: !6, line: 1285, baseType: !99, size: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !306, file: !6, line: 1287, baseType: !317, size: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !6, line: 1265, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !6, line: 1261, size: 128, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !319, file: !6, line: 1263, baseType: !309, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !319, file: !6, line: 1264, baseType: !115, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !306, file: !6, line: 1289, baseType: !324, size: 2048, offset: 384)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 2048, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 16)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !298, file: !6, line: 1552, baseType: !161, size: 64, offset: 2560)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !298, file: !6, line: 1553, baseType: !296, size: 64, offset: 2624)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !298, file: !6, line: 1554, baseType: !296, size: 64, offset: 2688)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !298, file: !6, line: 1555, baseType: !296, size: 64, offset: 2752)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !242, file: !6, line: 1425, baseType: !131, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !242, file: !6, line: 1427, baseType: !103, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "v_channel", scope: !242, file: !6, line: 1428, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "channel_T", file: !6, line: 1370, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "channel_S", file: !6, line: 2225, size: 11008, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ch_next", scope: !336, file: !6, line: 2226, baseType: !334, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ch_prev", scope: !336, file: !6, line: 2227, baseType: !334, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ch_id", scope: !336, file: !6, line: 2229, baseType: !99, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ch_last_msg_id", scope: !336, file: !6, line: 2230, baseType: !99, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ch_part", scope: !336, file: !6, line: 2232, baseType: !343, size: 9728, offset: 192)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 9728, elements: !813)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "chanpart_T", file: !6, line: 2223, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2177, size: 2432, elements: !346)
!346 = !{!347, !349, !352, !354, !356, !357, !366, !376, !377, !380, !381, !382, !383, !391, !400, !401, !1684, !1685, !1686, !1687, !1688}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ch_fd", scope: !345, file: !6, line: 2178, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_T", file: !117, line: 1816, baseType: !99)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ch_inputHandler", scope: !345, file: !6, line: 2188, baseType: !350, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !351, line: 49, baseType: !99)
!351 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/sahil/vim/src")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ch_mode", scope: !345, file: !6, line: 2191, baseType: !353, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_mode_T", file: !6, line: 2146, baseType: !5)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ch_io", scope: !345, file: !6, line: 2192, baseType: !355, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_io_T", file: !6, line: 2154, baseType: !12)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ch_timeout", scope: !345, file: !6, line: 2193, baseType: !99, size: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ch_head", scope: !345, file: !6, line: 2195, baseType: !358, size: 256, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "readq_T", file: !6, line: 1366, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "readq_S", file: !6, line: 2108, size: 256, elements: !360)
!360 = !{!361, !362, !363, !365}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rq_buffer", scope: !359, file: !6, line: 2110, baseType: !115, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rq_buflen", scope: !359, file: !6, line: 2111, baseType: !309, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rq_next", scope: !359, file: !6, line: 2112, baseType: !364, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rq_prev", scope: !359, file: !6, line: 2113, baseType: !364, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ch_json_head", scope: !345, file: !6, line: 2196, baseType: !367, size: 256, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsonq_T", file: !6, line: 1368, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jsonq_S", file: !6, line: 2123, size: 256, elements: !369)
!369 = !{!370, !372, !374, !375}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "jq_value", scope: !368, file: !6, line: 2125, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "jq_next", scope: !368, file: !6, line: 2126, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "jq_prev", scope: !368, file: !6, line: 2127, baseType: !373, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "jq_no_callback", scope: !368, file: !6, line: 2128, baseType: !99, size: 32, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ch_block_ids", scope: !345, file: !6, line: 2197, baseType: !150, size: 192, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ch_wait_len", scope: !345, file: !6, line: 2203, baseType: !378, size: 64, offset: 896)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !379, line: 62, baseType: !310)
!379 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ch_deadline", scope: !345, file: !6, line: 2207, baseType: !189, size: 128, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ch_block_write", scope: !345, file: !6, line: 2209, baseType: !99, size: 32, offset: 1088)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ch_nonblocking", scope: !345, file: !6, line: 2211, baseType: !99, size: 32, offset: 1120)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ch_writeque", scope: !345, file: !6, line: 2212, baseType: !384, size: 320, offset: 1152)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "writeq_T", file: !6, line: 1367, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "writeq_S", file: !6, line: 2116, size: 320, elements: !386)
!386 = !{!387, !388, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "wq_ga", scope: !385, file: !6, line: 2118, baseType: !150, size: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "wq_next", scope: !385, file: !6, line: 2119, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "wq_prev", scope: !385, file: !6, line: 2120, baseType: !389, size: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ch_cb_head", scope: !345, file: !6, line: 2214, baseType: !392, size: 384, offset: 1472)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbq_T", file: !6, line: 1369, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbq_S", file: !6, line: 2131, size: 384, elements: !394)
!394 = !{!395, !396, !397, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cq_callback", scope: !393, file: !6, line: 2133, baseType: !126, size: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cq_seq_nr", scope: !393, file: !6, line: 2134, baseType: !99, size: 32, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cq_next", scope: !393, file: !6, line: 2135, baseType: !398, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cq_prev", scope: !393, file: !6, line: 2136, baseType: !398, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ch_callback", scope: !345, file: !6, line: 2215, baseType: !126, size: 192, offset: 1856)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ch_bufref", scope: !345, file: !6, line: 2217, baseType: !402, size: 128, offset: 2048)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufref_T", file: !6, line: 102, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 98, size: 128, elements: !404)
!404 = !{!405, !1682, !1683}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "br_buf", scope: !403, file: !6, line: 99, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !6, line: 63, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !6, line: 2629, size: 73152, elements: !409)
!409 = !{!410, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !519, !522, !523, !527, !528, !538, !539, !540, !541, !542, !543, !544, !545, !1352, !1353, !1354, !1359, !1360, !1361, !1365, !1373, !1374, !1375, !1376, !1377, !1379, !1380, !1381, !1382, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1626, !1627, !1628, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1665, !1666, !1667, !1668, !1669, !1676, !1677, !1681}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !408, file: !6, line: 2631, baseType: !411, size: 832)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !6, line: 766, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !6, line: 737, size: 832, elements: !413)
!413 = !{!414, !415, !477, !486, !487, !488, !489, !491, !492, !493, !494, !495, !496, !497, !504, !505}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !412, file: !6, line: 739, baseType: !215, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !412, file: !6, line: 741, baseType: !416, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !6, line: 459, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !6, line: 671, size: 9856, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425, !444, !445, !446, !448, !449, !462, !463, !464, !465, !466, !467, !468, !469, !470, !474, !475, !476}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !418, file: !6, line: 673, baseType: !115, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !418, file: !6, line: 674, baseType: !115, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !418, file: !6, line: 675, baseType: !99, size: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !418, file: !6, line: 676, baseType: !99, size: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !418, file: !6, line: 677, baseType: !99, size: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !418, file: !6, line: 678, baseType: !426, size: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !6, line: 458, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !6, line: 506, size: 448, elements: !429)
!429 = !{!430, !439, !440, !441, !442, !443}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !428, file: !6, line: 508, baseType: !431, size: 192)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !6, line: 469, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !6, line: 471, size: 192, elements: !433)
!433 = !{!434, !436, !437}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !432, file: !6, line: 473, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !432, file: !6, line: 474, baseType: !435, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !432, file: !6, line: 475, baseType: !438, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !6, line: 460, baseType: !100)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !428, file: !6, line: 511, baseType: !426, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !428, file: !6, line: 512, baseType: !426, size: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !428, file: !6, line: 513, baseType: !115, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !428, file: !6, line: 514, baseType: !99, size: 32, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !428, file: !6, line: 518, baseType: !98, size: 8, offset: 416)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !418, file: !6, line: 679, baseType: !426, size: 64, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !418, file: !6, line: 680, baseType: !426, size: 64, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !418, file: !6, line: 681, baseType: !447, size: 32, offset: 448)
!447 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !418, file: !6, line: 682, baseType: !447, size: 32, offset: 480)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !418, file: !6, line: 683, baseType: !450, size: 4352, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !6, line: 489, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !6, line: 480, size: 4352, elements: !452)
!452 = !{!453, !454, !455, !457, !461}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !451, file: !6, line: 482, baseType: !309, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !451, file: !6, line: 484, baseType: !309, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !451, file: !6, line: 485, baseType: !456, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !451, file: !6, line: 487, baseType: !458, size: 4096, offset: 192)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 4096, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !451, file: !6, line: 488, baseType: !98, size: 8, offset: 4288)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !418, file: !6, line: 684, baseType: !450, size: 4352, offset: 4864)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !418, file: !6, line: 685, baseType: !438, size: 64, offset: 9216)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !418, file: !6, line: 686, baseType: !438, size: 64, offset: 9280)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !418, file: !6, line: 687, baseType: !438, size: 64, offset: 9344)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !418, file: !6, line: 688, baseType: !438, size: 64, offset: 9408)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !418, file: !6, line: 689, baseType: !447, size: 32, offset: 9472)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !418, file: !6, line: 690, baseType: !99, size: 32, offset: 9504)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !418, file: !6, line: 692, baseType: !406, size: 64, offset: 9536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !418, file: !6, line: 693, baseType: !471, size: 64, offset: 9600)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 8)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !418, file: !6, line: 697, baseType: !115, size: 64, offset: 9664)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !418, file: !6, line: 698, baseType: !99, size: 32, offset: 9728)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !418, file: !6, line: 699, baseType: !471, size: 64, offset: 9760)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !412, file: !6, line: 743, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !6, line: 717, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !6, line: 711, size: 256, elements: !481)
!481 = !{!482, !483, !484, !485}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !480, file: !6, line: 713, baseType: !438, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !480, file: !6, line: 714, baseType: !215, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !480, file: !6, line: 715, baseType: !215, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !480, file: !6, line: 716, baseType: !99, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !412, file: !6, line: 744, baseType: !99, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !412, file: !6, line: 745, baseType: !99, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !412, file: !6, line: 751, baseType: !99, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !412, file: !6, line: 753, baseType: !490, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !117, line: 1688, baseType: !99)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !412, file: !6, line: 754, baseType: !215, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !412, file: !6, line: 755, baseType: !115, size: 64, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !412, file: !6, line: 757, baseType: !426, size: 64, offset: 448)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !412, file: !6, line: 758, baseType: !215, size: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !412, file: !6, line: 759, baseType: !215, size: 64, offset: 576)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !412, file: !6, line: 760, baseType: !99, size: 32, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !412, file: !6, line: 762, baseType: !498, size: 64, offset: 704)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !6, line: 724, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !6, line: 720, size: 128, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !500, file: !6, line: 722, baseType: !99, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !500, file: !6, line: 723, baseType: !100, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !412, file: !6, line: 763, baseType: !99, size: 32, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !412, file: !6, line: 764, baseType: !99, size: 32, offset: 800)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !408, file: !6, line: 2634, baseType: !406, size: 64, offset: 832)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !408, file: !6, line: 2635, baseType: !406, size: 64, offset: 896)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !408, file: !6, line: 2637, baseType: !99, size: 32, offset: 960)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !408, file: !6, line: 2639, baseType: !99, size: 32, offset: 992)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !408, file: !6, line: 2640, baseType: !99, size: 32, offset: 1024)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !408, file: !6, line: 2642, baseType: !99, size: 32, offset: 1056)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !408, file: !6, line: 2651, baseType: !115, size: 64, offset: 1088)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !408, file: !6, line: 2652, baseType: !115, size: 64, offset: 1152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !408, file: !6, line: 2654, baseType: !115, size: 64, offset: 1216)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !408, file: !6, line: 2658, baseType: !99, size: 32, offset: 1280)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !408, file: !6, line: 2659, baseType: !517, size: 64, offset: 1344)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !111, line: 59, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !113, line: 145, baseType: !310)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !408, file: !6, line: 2660, baseType: !520, size: 64, offset: 1408)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !111, line: 47, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !113, line: 148, baseType: !310)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !408, file: !6, line: 2667, baseType: !99, size: 32, offset: 1472)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !408, file: !6, line: 2668, baseType: !524, size: 72, offset: 1504)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 72, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 9)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !408, file: !6, line: 2672, baseType: !99, size: 32, offset: 1600)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !408, file: !6, line: 2674, baseType: !529, size: 320, offset: 1664)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !6, line: 1532, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !6, line: 1526, size: 320, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !530, file: !6, line: 1528, baseType: !236, size: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !530, file: !6, line: 1529, baseType: !116, size: 8, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !530, file: !6, line: 1530, baseType: !535, size: 136, offset: 136)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 136, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 17)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !408, file: !6, line: 2679, baseType: !245, size: 64, offset: 1984)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !408, file: !6, line: 2681, baseType: !245, size: 64, offset: 2048)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !408, file: !6, line: 2684, baseType: !99, size: 32, offset: 2112)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !408, file: !6, line: 2691, baseType: !99, size: 32, offset: 2144)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !408, file: !6, line: 2693, baseType: !215, size: 64, offset: 2176)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !408, file: !6, line: 2694, baseType: !215, size: 64, offset: 2240)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !408, file: !6, line: 2696, baseType: !100, size: 64, offset: 2304)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !408, file: !6, line: 2699, baseType: !546, size: 64, offset: 2368)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !6, line: 60, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !6, line: 325, size: 11648, elements: !549)
!549 = !{!550, !551, !552, !1347, !1348, !1349, !1350, !1351}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !548, file: !6, line: 327, baseType: !546, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !548, file: !6, line: 328, baseType: !546, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !548, file: !6, line: 329, baseType: !553, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !6, line: 59, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !6, line: 3365, size: 72064, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !716, !717, !732, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !789, !790, !791, !792, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !815, !816, !818, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !839, !840, !841, !842, !843, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !903, !904, !905, !906, !907, !1158, !1166, !1167, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1259, !1260, !1261, !1262, !1303, !1304, !1316, !1317, !1318, !1319, !1320, !1339, !1340, !1341, !1342, !1346}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !555, file: !6, line: 3367, baseType: !99, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !555, file: !6, line: 3369, baseType: !406, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !555, file: !6, line: 3371, baseType: !553, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !555, file: !6, line: 3372, baseType: !553, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !555, file: !6, line: 3375, baseType: !562, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !6, line: 2618, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2542, size: 9920, elements: !565)
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !581, !582, !583, !584, !585, !643, !651, !652, !653, !654, !655, !692, !693, !694, !695, !696, !697, !699, !700, !704, !705, !706, !707, !708, !709, !710, !711, !715}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !564, file: !6, line: 2544, baseType: !305, size: 2432)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !564, file: !6, line: 2545, baseType: !305, size: 2432, offset: 2432)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !564, file: !6, line: 2546, baseType: !99, size: 32, offset: 4864)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !564, file: !6, line: 2548, baseType: !99, size: 32, offset: 4896)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !564, file: !6, line: 2550, baseType: !99, size: 32, offset: 4928)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !564, file: !6, line: 2551, baseType: !99, size: 32, offset: 4960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !564, file: !6, line: 2552, baseType: !99, size: 32, offset: 4992)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !564, file: !6, line: 2553, baseType: !150, size: 192, offset: 5056)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !564, file: !6, line: 2554, baseType: !150, size: 192, offset: 5248)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !564, file: !6, line: 2555, baseType: !99, size: 32, offset: 5440)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !564, file: !6, line: 2556, baseType: !99, size: 32, offset: 5472)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !564, file: !6, line: 2557, baseType: !99, size: 32, offset: 5504)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !564, file: !6, line: 2559, baseType: !99, size: 32, offset: 5536)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !564, file: !6, line: 2560, baseType: !580, size: 16, offset: 5568)
!580 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !564, file: !6, line: 2561, baseType: !100, size: 64, offset: 5632)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !564, file: !6, line: 2562, baseType: !100, size: 64, offset: 5696)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !564, file: !6, line: 2563, baseType: !100, size: 64, offset: 5760)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !564, file: !6, line: 2564, baseType: !115, size: 64, offset: 5824)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !564, file: !6, line: 2565, baseType: !586, size: 64, offset: 5888)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !588, line: 56, baseType: !589)
!588 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !588, line: 49, size: 192, elements: !590)
!590 = !{!591, !639, !640, !641, !642}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !589, file: !588, line: 51, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !588, line: 42, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !588, line: 167, size: 320, elements: !595)
!595 = !{!596, !600, !604, !619, !638}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !594, file: !588, line: 169, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!586, !115, !99}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !594, file: !588, line: 170, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !586}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !594, file: !588, line: 171, baseType: !605, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!99, !608, !115, !490, !99}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !588, line: 137, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 131, size: 1408, elements: !611)
!611 = !{!612, !613, !617, !618}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !610, file: !588, line: 133, baseType: !586, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !610, file: !588, line: 134, baseType: !614, size: 640, offset: 64)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 640, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 10)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !610, file: !588, line: 135, baseType: !614, size: 640, offset: 704)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !610, file: !588, line: 136, baseType: !99, size: 32, offset: 1344)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !594, file: !588, line: 172, baseType: !620, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!100, !623, !553, !406, !215, !490, !200, !182}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !588, line: 154, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 147, size: 2688, elements: !626)
!626 = !{!627, !628, !635, !636, !637}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !625, file: !588, line: 149, baseType: !586, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !625, file: !588, line: 150, baseType: !629, size: 1280, offset: 64)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 1280, elements: !615)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !6, line: 41, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 37, size: 128, elements: !632)
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !631, file: !6, line: 39, baseType: !215, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !631, file: !6, line: 40, baseType: !490, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !625, file: !588, line: 151, baseType: !629, size: 1280, offset: 1344)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !625, file: !588, line: 152, baseType: !99, size: 32, offset: 2624)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !625, file: !588, line: 153, baseType: !490, size: 32, offset: 2656)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !594, file: !588, line: 173, baseType: !115, size: 64, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !589, file: !588, line: 52, baseType: !447, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !589, file: !588, line: 53, baseType: !447, size: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !589, file: !588, line: 54, baseType: !447, size: 32, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !589, file: !588, line: 55, baseType: !99, size: 32, offset: 160)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !564, file: !6, line: 2567, baseType: !644, size: 384, offset: 5952)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !6, line: 2475, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2470, size: 384, elements: !646)
!646 = !{!647, !648, !649, !650}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !645, file: !6, line: 2471, baseType: !188, size: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !645, file: !6, line: 2472, baseType: !188, size: 128, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !645, file: !6, line: 2473, baseType: !100, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !645, file: !6, line: 2474, baseType: !100, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !564, file: !6, line: 2569, baseType: !99, size: 32, offset: 6336)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !564, file: !6, line: 2570, baseType: !99, size: 32, offset: 6368)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !564, file: !6, line: 2572, baseType: !99, size: 32, offset: 6400)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !564, file: !6, line: 2575, baseType: !99, size: 32, offset: 6432)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !564, file: !6, line: 2592, baseType: !656, size: 64, offset: 6464)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !6, line: 1061, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !6, line: 1063, size: 1728, elements: !659)
!659 = !{!660, !661, !662, !684, !685, !686, !688, !691}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !658, file: !6, line: 1065, baseType: !656, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !658, file: !6, line: 1066, baseType: !215, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !658, file: !6, line: 1071, baseType: !663, size: 1344, offset: 128)
!663 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !658, file: !6, line: 1067, size: 1344, elements: !664)
!664 = !{!665, !683}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !663, file: !6, line: 1069, baseType: !666, size: 1344)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 1344, elements: !681)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !6, line: 1055, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !6, line: 1046, size: 192, elements: !669)
!669 = !{!670, !671, !672, !673, !674}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !668, file: !6, line: 1048, baseType: !99, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !668, file: !6, line: 1049, baseType: !99, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !668, file: !6, line: 1051, baseType: !99, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !668, file: !6, line: 1052, baseType: !99, size: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !668, file: !6, line: 1054, baseType: !675, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !588, line: 165, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 161, size: 704, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !677, file: !588, line: 163, baseType: !580, size: 16)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !677, file: !588, line: 164, baseType: !614, size: 640, offset: 64)
!681 = !{!682}
!682 = !DISubrange(count: 7)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !663, file: !6, line: 1070, baseType: !150, size: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !658, file: !6, line: 1072, baseType: !99, size: 32, offset: 1472)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !658, file: !6, line: 1073, baseType: !99, size: 32, offset: 1504)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !658, file: !6, line: 1074, baseType: !687, size: 64, offset: 1536)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !658, file: !6, line: 1076, baseType: !689, size: 16, offset: 1600)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !117, line: 1689, baseType: !690)
!690 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !658, file: !6, line: 1077, baseType: !215, size: 64, offset: 1664)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !564, file: !6, line: 2593, baseType: !99, size: 32, offset: 6528)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !564, file: !6, line: 2594, baseType: !656, size: 64, offset: 6592)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !564, file: !6, line: 2595, baseType: !656, size: 64, offset: 6656)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !564, file: !6, line: 2596, baseType: !99, size: 32, offset: 6720)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !564, file: !6, line: 2597, baseType: !215, size: 64, offset: 6784)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !564, file: !6, line: 2598, baseType: !698, size: 16, offset: 6848)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !117, line: 325, baseType: !690)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !564, file: !6, line: 2603, baseType: !150, size: 192, offset: 6912)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !564, file: !6, line: 2604, baseType: !701, size: 2048, offset: 7104)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 2048, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !564, file: !6, line: 2605, baseType: !115, size: 64, offset: 9152)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !564, file: !6, line: 2606, baseType: !115, size: 64, offset: 9216)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !564, file: !6, line: 2607, baseType: !586, size: 64, offset: 9280)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !564, file: !6, line: 2608, baseType: !115, size: 64, offset: 9344)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !564, file: !6, line: 2609, baseType: !115, size: 64, offset: 9408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !564, file: !6, line: 2610, baseType: !115, size: 64, offset: 9472)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !564, file: !6, line: 2611, baseType: !99, size: 32, offset: 9536)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !564, file: !6, line: 2616, baseType: !712, size: 256, offset: 9568)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 256, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !564, file: !6, line: 2617, baseType: !115, size: 64, offset: 9856)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !555, file: !6, line: 3378, baseType: !99, size: 32, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !555, file: !6, line: 3381, baseType: !718, size: 64, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !6, line: 61, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !6, line: 3231, size: 512, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !720, file: !6, line: 3233, baseType: !98, size: 8)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !720, file: !6, line: 3234, baseType: !99, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !720, file: !6, line: 3235, baseType: !99, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !720, file: !6, line: 3236, baseType: !99, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !720, file: !6, line: 3237, baseType: !99, size: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !720, file: !6, line: 3238, baseType: !718, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !720, file: !6, line: 3239, baseType: !718, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !720, file: !6, line: 3241, baseType: !718, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !720, file: !6, line: 3244, baseType: !718, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !720, file: !6, line: 3245, baseType: !553, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !555, file: !6, line: 3383, baseType: !733, size: 128, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !6, line: 31, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 26, size: 128, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !734, file: !6, line: 28, baseType: !215, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !734, file: !6, line: 29, baseType: !490, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !734, file: !6, line: 30, baseType: !490, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !555, file: !6, line: 3385, baseType: !490, size: 32, offset: 576)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !555, file: !6, line: 3389, baseType: !99, size: 32, offset: 608)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !555, file: !6, line: 3394, baseType: !215, size: 64, offset: 640)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !555, file: !6, line: 3400, baseType: !98, size: 8, offset: 704)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !555, file: !6, line: 3401, baseType: !215, size: 64, offset: 768)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !555, file: !6, line: 3402, baseType: !490, size: 32, offset: 832)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !555, file: !6, line: 3403, baseType: !490, size: 32, offset: 864)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !555, file: !6, line: 3404, baseType: !215, size: 64, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !555, file: !6, line: 3405, baseType: !490, size: 32, offset: 960)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !555, file: !6, line: 3406, baseType: !490, size: 32, offset: 992)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !555, file: !6, line: 3408, baseType: !750, size: 352, offset: 1024)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !6, line: 3358, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3343, size: 352, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !751, file: !6, line: 3345, baseType: !99, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !751, file: !6, line: 3346, baseType: !99, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !751, file: !6, line: 3347, baseType: !99, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !751, file: !6, line: 3348, baseType: !99, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !751, file: !6, line: 3349, baseType: !99, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !751, file: !6, line: 3350, baseType: !99, size: 32, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !751, file: !6, line: 3351, baseType: !99, size: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !751, file: !6, line: 3352, baseType: !99, size: 32, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !751, file: !6, line: 3353, baseType: !99, size: 32, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !751, file: !6, line: 3354, baseType: !99, size: 32, offset: 288)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !751, file: !6, line: 3356, baseType: !99, size: 32, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !555, file: !6, line: 3414, baseType: !215, size: 64, offset: 1408)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !555, file: !6, line: 3416, baseType: !98, size: 8, offset: 1472)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !555, file: !6, line: 3419, baseType: !215, size: 64, offset: 1536)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !555, file: !6, line: 3423, baseType: !99, size: 32, offset: 1600)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !555, file: !6, line: 3424, baseType: !99, size: 32, offset: 1632)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !555, file: !6, line: 3425, baseType: !99, size: 32, offset: 1664)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !555, file: !6, line: 3427, baseType: !99, size: 32, offset: 1696)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !555, file: !6, line: 3429, baseType: !490, size: 32, offset: 1728)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !555, file: !6, line: 3432, baseType: !490, size: 32, offset: 1760)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !555, file: !6, line: 3435, baseType: !99, size: 32, offset: 1792)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !555, file: !6, line: 3437, baseType: !99, size: 32, offset: 1824)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !555, file: !6, line: 3445, baseType: !99, size: 32, offset: 1856)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !555, file: !6, line: 3446, baseType: !99, size: 32, offset: 1888)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !555, file: !6, line: 3449, baseType: !99, size: 32, offset: 1920)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !555, file: !6, line: 3450, baseType: !99, size: 32, offset: 1952)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !555, file: !6, line: 3451, baseType: !99, size: 32, offset: 1984)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !555, file: !6, line: 3452, baseType: !99, size: 32, offset: 2016)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !555, file: !6, line: 3454, baseType: !782, size: 320, offset: 2048)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !6, line: 3330, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3324, size: 320, elements: !784)
!784 = !{!785, !786, !787, !788}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !783, file: !6, line: 3326, baseType: !99, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !783, file: !6, line: 3327, baseType: !99, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !783, file: !6, line: 3328, baseType: !733, size: 128, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !783, file: !6, line: 3329, baseType: !733, size: 128, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !555, file: !6, line: 3457, baseType: !99, size: 32, offset: 2368)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !555, file: !6, line: 3458, baseType: !99, size: 32, offset: 2400)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !555, file: !6, line: 3459, baseType: !115, size: 64, offset: 2432)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !555, file: !6, line: 3460, baseType: !793, size: 32, offset: 2496)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !6, line: 2524, baseType: !49)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !555, file: !6, line: 3461, baseType: !99, size: 32, offset: 2528)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !555, file: !6, line: 3462, baseType: !99, size: 32, offset: 2560)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !555, file: !6, line: 3463, baseType: !553, size: 64, offset: 2624)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !555, file: !6, line: 3464, baseType: !99, size: 32, offset: 2688)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !555, file: !6, line: 3465, baseType: !99, size: 32, offset: 2720)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !555, file: !6, line: 3466, baseType: !99, size: 32, offset: 2752)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !555, file: !6, line: 3467, baseType: !99, size: 32, offset: 2784)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !555, file: !6, line: 3468, baseType: !99, size: 32, offset: 2816)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !555, file: !6, line: 3469, baseType: !99, size: 32, offset: 2848)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !555, file: !6, line: 3470, baseType: !99, size: 32, offset: 2880)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !555, file: !6, line: 3471, baseType: !99, size: 32, offset: 2912)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !555, file: !6, line: 3472, baseType: !99, size: 32, offset: 2944)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !555, file: !6, line: 3473, baseType: !99, size: 32, offset: 2976)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !555, file: !6, line: 3474, baseType: !99, size: 32, offset: 3008)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !555, file: !6, line: 3475, baseType: !99, size: 32, offset: 3040)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !555, file: !6, line: 3476, baseType: !115, size: 64, offset: 3072)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !555, file: !6, line: 3477, baseType: !115, size: 64, offset: 3136)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !555, file: !6, line: 3478, baseType: !812, size: 128, offset: 3200)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 128, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 4)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !555, file: !6, line: 3479, baseType: !812, size: 128, offset: 3328)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !555, file: !6, line: 3480, baseType: !817, size: 256, offset: 3456)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 256, elements: !813)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !555, file: !6, line: 3481, baseType: !819, size: 256, offset: 3712)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 256, elements: !472)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !555, file: !6, line: 3483, baseType: !99, size: 32, offset: 3968)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !555, file: !6, line: 3484, baseType: !99, size: 32, offset: 4000)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !555, file: !6, line: 3485, baseType: !245, size: 64, offset: 4032)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !555, file: !6, line: 3487, baseType: !245, size: 64, offset: 4096)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !555, file: !6, line: 3490, baseType: !99, size: 32, offset: 4160)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !555, file: !6, line: 3493, baseType: !215, size: 64, offset: 4224)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !555, file: !6, line: 3495, baseType: !126, size: 192, offset: 4288)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !555, file: !6, line: 3496, baseType: !126, size: 192, offset: 4480)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !555, file: !6, line: 3497, baseType: !99, size: 32, offset: 4672)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !555, file: !6, line: 3498, baseType: !99, size: 32, offset: 4704)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !555, file: !6, line: 3500, baseType: !553, size: 64, offset: 4736)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !555, file: !6, line: 3501, baseType: !215, size: 64, offset: 4800)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !555, file: !6, line: 3502, baseType: !490, size: 32, offset: 4864)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !555, file: !6, line: 3503, baseType: !490, size: 32, offset: 4896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !555, file: !6, line: 3504, baseType: !99, size: 32, offset: 4928)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !555, file: !6, line: 3505, baseType: !99, size: 32, offset: 4960)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !555, file: !6, line: 3506, baseType: !99, size: 32, offset: 4992)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !555, file: !6, line: 3507, baseType: !838, size: 32, offset: 5024)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !6, line: 2530, baseType: !57)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !555, file: !6, line: 3509, baseType: !252, size: 64, offset: 5056)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !555, file: !6, line: 3510, baseType: !115, size: 64, offset: 5120)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !555, file: !6, line: 3511, baseType: !99, size: 32, offset: 5184)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !555, file: !6, line: 3512, baseType: !99, size: 32, offset: 5216)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !555, file: !6, line: 3514, baseType: !844, size: 64, offset: 5248)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !6, line: 2478, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !6, line: 2479, size: 704, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !846, file: !6, line: 2481, baseType: !100, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !846, file: !6, line: 2483, baseType: !844, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !846, file: !6, line: 2484, baseType: !844, size: 64, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !846, file: !6, line: 2485, baseType: !188, size: 128, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !846, file: !6, line: 2486, baseType: !98, size: 8, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !846, file: !6, line: 2487, baseType: !98, size: 8, offset: 328)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !846, file: !6, line: 2488, baseType: !99, size: 32, offset: 352)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !846, file: !6, line: 2489, baseType: !100, size: 64, offset: 384)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !846, file: !6, line: 2490, baseType: !126, size: 192, offset: 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !846, file: !6, line: 2491, baseType: !99, size: 32, offset: 640)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !555, file: !6, line: 3517, baseType: !99, size: 32, offset: 5312)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !555, file: !6, line: 3534, baseType: !99, size: 32, offset: 5344)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !555, file: !6, line: 3535, baseType: !733, size: 128, offset: 5376)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !555, file: !6, line: 3537, baseType: !490, size: 32, offset: 5504)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !555, file: !6, line: 3543, baseType: !99, size: 32, offset: 5536)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !555, file: !6, line: 3545, baseType: !99, size: 32, offset: 5568)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !555, file: !6, line: 3548, baseType: !99, size: 32, offset: 5600)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !555, file: !6, line: 3550, baseType: !490, size: 32, offset: 5632)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !555, file: !6, line: 3562, baseType: !99, size: 32, offset: 5664)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !555, file: !6, line: 3562, baseType: !99, size: 32, offset: 5696)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !555, file: !6, line: 3574, baseType: !99, size: 32, offset: 5728)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !555, file: !6, line: 3575, baseType: !870, size: 64, offset: 5760)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !6, line: 3225, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !6, line: 3216, size: 192, elements: !873)
!873 = !{!874, !875, !876, !877, !878}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !872, file: !6, line: 3218, baseType: !215, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !872, file: !6, line: 3219, baseType: !698, size: 16, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !872, file: !6, line: 3220, baseType: !98, size: 8, offset: 80)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !872, file: !6, line: 3222, baseType: !98, size: 8, offset: 88)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !872, file: !6, line: 3223, baseType: !215, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !555, file: !6, line: 3578, baseType: !150, size: 192, offset: 5824)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !555, file: !6, line: 3579, baseType: !98, size: 8, offset: 6016)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !555, file: !6, line: 3581, baseType: !98, size: 8, offset: 6024)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !555, file: !6, line: 3585, baseType: !99, size: 32, offset: 6048)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !555, file: !6, line: 3593, baseType: !99, size: 32, offset: 6080)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !555, file: !6, line: 3594, baseType: !99, size: 32, offset: 6112)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_top", scope: !555, file: !6, line: 3596, baseType: !215, size: 64, offset: 6144)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_bot", scope: !555, file: !6, line: 3597, baseType: !215, size: 64, offset: 6208)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_status", scope: !555, file: !6, line: 3598, baseType: !99, size: 32, offset: 6272)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_cursor", scope: !555, file: !6, line: 3602, baseType: !733, size: 128, offset: 6336)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_virtcol", scope: !555, file: !6, line: 3603, baseType: !490, size: 32, offset: 6464)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topline", scope: !555, file: !6, line: 3604, baseType: !215, size: 64, offset: 6528)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_line_count", scope: !555, file: !6, line: 3605, baseType: !215, size: 64, offset: 6592)
