; ModuleID = 'json.c'
source_filename = "json.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.listitem_S = type { %struct.listitem_S*, %struct.listitem_S*, %struct.typval_T }
%struct.typval_T = type { i32, i8, %union.anon }
%union.anon = type { i64 }
%struct.growarray = type { i32, i32, i32, i32, i8* }
%struct.listvar_S = type { %struct.listitem_S*, %struct.listwatch_S*, %union.anon.0, %struct.type_S*, %struct.listvar_S*, %struct.listvar_S*, %struct.listvar_S*, i32, i32, i32, i32, i8 }
%struct.listwatch_S = type { %struct.listitem_S*, %struct.listwatch_S* }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { i64, i64, i32 }
%struct.type_S = type { i32, i8, i8, i8, %struct.type_S*, %struct.type_S** }
%struct.js_reader = type { i8*, i8*, i32, i32 (%struct.js_reader*)*, i8*, i32 }
%struct.json_dec_item_T = type { i32, %struct.typval_T, %struct.typval_T, i8* }
%struct.dictvar_S = type { i8, i8, i32, i32, %struct.hashtable_S, %struct.type_S*, %struct.dictvar_S*, %struct.dictvar_S*, %struct.dictvar_S* }
%struct.hashtable_S = type { i64, i64, i64, i32, i32, i32, %struct.hashitem_S*, [16 x %struct.hashitem_S] }
%struct.hashitem_S = type { i64, i8* }
%struct.dictitem_S = type { %struct.typval_T, i8, [1 x i8] }
%struct.blobvar_S = type { %struct.growarray, i32, i8 }
%struct.vimconv_T = type { i32, i32, i8*, i32 }

@e_invarg = external global [0 x i8], align 1

!16 = !DIEnumerator(name: "VAR_BLOB", value: 8)
!17 = !DIEnumerator(name: "VAR_FUNC", value: 9)
!18 = !DIEnumerator(name: "VAR_PARTIAL", value: 10)
!19 = !DIEnumerator(name: "VAR_LIST", value: 11)
!20 = !DIEnumerator(name: "VAR_DICT", value: 12)
!21 = !DIEnumerator(name: "VAR_JOB", value: 13)
!22 = !DIEnumerator(name: "VAR_CHANNEL", value: 14)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1585, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28, !29}
!25 = !DIEnumerator(name: "UF_NOT_COMPILED", value: 0)
!26 = !DIEnumerator(name: "UF_TO_BE_COMPILED", value: 1)
!27 = !DIEnumerator(name: "UF_COMPILING", value: 2)
!28 = !DIEnumerator(name: "UF_COMPILED", value: 3)
!29 = !DIEnumerator(name: "UF_COMPILE_ERROR", value: 4)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2061, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "JOB_FAILED", value: 0)
!33 = !DIEnumerator(name: "JOB_STARTED", value: 1)
!34 = !DIEnumerator(name: "JOB_ENDED", value: 2)
!35 = !DIEnumerator(name: "JOB_FINISHED", value: 3)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2517, size: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43}
!38 = !DIEnumerator(name: "POPPOS_BOTLEFT", value: 0)
!39 = !DIEnumerator(name: "POPPOS_TOPLEFT", value: 1)
!40 = !DIEnumerator(name: "POPPOS_BOTRIGHT", value: 2)
!41 = !DIEnumerator(name: "POPPOS_TOPRIGHT", value: 3)
!42 = !DIEnumerator(name: "POPPOS_CENTER", value: 4)
!43 = !DIEnumerator(name: "POPPOS_NONE", value: 5)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2526, size: 32, elements: !45)
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "POPCLOSE_NONE", value: 0)
!47 = !DIEnumerator(name: "POPCLOSE_BUTTON", value: 1)
!48 = !DIEnumerator(name: "POPCLOSE_CLICK", value: 2)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 55, size: 32, elements: !51)
!50 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkvisual.h", directory: "/home/sahil/vim/src")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "GDK_VISUAL_STATIC_GRAY", value: 0)
!53 = !DIEnumerator(name: "GDK_VISUAL_GRAYSCALE", value: 1)
!54 = !DIEnumerator(name: "GDK_VISUAL_STATIC_COLOR", value: 2)
!55 = !DIEnumerator(name: "GDK_VISUAL_PSEUDO_COLOR", value: 3)
!56 = !DIEnumerator(name: "GDK_VISUAL_TRUE_COLOR", value: 4)
!57 = !DIEnumerator(name: "GDK_VISUAL_DIRECT_COLOR", value: 5)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 118, size: 32, elements: !60)
!59 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdktypes.h", directory: "/home/sahil/vim/src")
!60 = !{!61, !62}
!61 = !DIEnumerator(name: "GDK_LSB_FIRST", value: 0)
!62 = !DIEnumerator(name: "GDK_MSB_FIRST", value: 1)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 43, size: 32, elements: !65)
!64 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkfont.h", directory: "/home/sahil/vim/src")
!65 = !{!66, !67}
!66 = !DIEnumerator(name: "GDK_FONT_FONT", value: 0)
!67 = !DIEnumerator(name: "GDK_FONT_FONTSET", value: 1)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 52, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkrc.h", directory: "/home/sahil/vim/src")
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "GTK_RC_FG", value: 1)
!72 = !DIEnumerator(name: "GTK_RC_BG", value: 2)
!73 = !DIEnumerator(name: "GTK_RC_TEXT", value: 4)
!74 = !DIEnumerator(name: "GTK_RC_BASE", value: 8)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2140, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80}
!77 = !DIEnumerator(name: "MODE_NL", value: 0)
!78 = !DIEnumerator(name: "MODE_RAW", value: 1)
!79 = !DIEnumerator(name: "MODE_JSON", value: 2)
!80 = !DIEnumerator(name: "MODE_JS", value: 3)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2148, size: 32, elements: !82)
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIEnumerator(name: "JIO_PIPE", value: 0)
!84 = !DIEnumerator(name: "JIO_NULL", value: 1)
!85 = !DIEnumerator(name: "JIO_FILE", value: 2)
!86 = !DIEnumerator(name: "JIO_BUFFER", value: 3)
!87 = !DIEnumerator(name: "JIO_OUT", value: 4)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 572, size: 32, elements: !89)
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "JSON_ARRAY", value: 0)
!91 = !DIEnumerator(name: "JSON_OBJECT_KEY", value: 1)
!92 = !DIEnumerator(name: "JSON_OBJECT", value: 2)
!93 = !{!94, !96, !100, !101, !103, !104, !105, !106, !1712}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !98, line: 324, baseType: !99)
!98 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!99 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!100 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !6, line: 1327, baseType: !102)
!102 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_dec_item_T", file: !3, line: 583, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 578, size: 384, elements: !109)
!109 = !{!110, !112, !1779, !1780}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "jd_type", scope: !108, file: !3, line: 579, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "json_decode_T", file: !3, line: 576, baseType: !88)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "jd_tv", scope: !108, file: !3, line: 580, baseType: !113, size: 128, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !6, line: 1432, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1412, size: 128, elements: !115)
!115 = !{!116, !118, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !114, file: !6, line: 1414, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !6, line: 1391, baseType: !5)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !114, file: !6, line: 1415, baseType: !95, size: 8, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !114, file: !6, line: 1431, baseType: !120, size: 64, offset: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !114, file: !6, line: 1416, size: 64, elements: !121)
!121 = !{!122, !123, !126, !127, !184, !220, !371, !1770, !1771}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !120, file: !6, line: 1418, baseType: !101, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !120, file: !6, line: 1420, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !6, line: 1344, baseType: !125)
!125 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !120, file: !6, line: 1422, baseType: !96, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !120, file: !6, line: 1423, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !6, line: 1346, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !6, line: 1471, size: 768, elements: !131)
!131 = !{!132, !140, !147, !162, !176, !177, !178, !179, !180, !181, !182, !183}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !130, file: !6, line: 1473, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !6, line: 1446, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !6, line: 1448, size: 256, elements: !136)
!136 = !{!137, !138, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !135, file: !6, line: 1450, baseType: !133, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !135, file: !6, line: 1451, baseType: !133, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !135, file: !6, line: 1452, baseType: !113, size: 128, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !130, file: !6, line: 1474, baseType: !141, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !6, line: 1456, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !6, line: 1458, size: 128, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !143, file: !6, line: 1460, baseType: !133, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !143, file: !6, line: 1461, baseType: !141, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !130, file: !6, line: 1487, baseType: !148, size: 192, offset: 128)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !6, line: 1475, size: 192, elements: !149)
!149 = !{!150, !156}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !148, file: !6, line: 1481, baseType: !151, size: 192)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !6, line: 1476, size: 192, elements: !152)
!152 = !{!153, !154, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !151, file: !6, line: 1478, baseType: !101, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !151, file: !6, line: 1479, baseType: !101, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !151, file: !6, line: 1480, baseType: !104, size: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !148, file: !6, line: 1486, baseType: !157, size: 192)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !6, line: 1482, size: 192, elements: !158)
!158 = !{!159, !160, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !157, file: !6, line: 1483, baseType: !133, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !157, file: !6, line: 1484, baseType: !133, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !157, file: !6, line: 1485, baseType: !104, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !130, file: !6, line: 1488, baseType: !163, size: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !6, line: 1394, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !6, line: 1395, size: 192, elements: !166)
!166 = !{!167, !168, !171, !172, !173, !174}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !165, file: !6, line: 1396, baseType: !117, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !165, file: !6, line: 1397, baseType: !169, size: 8, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !6, line: 1342, baseType: !170)
!170 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !165, file: !6, line: 1398, baseType: !95, size: 8, offset: 40)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !165, file: !6, line: 1399, baseType: !95, size: 8, offset: 48)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !165, file: !6, line: 1400, baseType: !163, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !165, file: !6, line: 1401, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !130, file: !6, line: 1489, baseType: !128, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !130, file: !6, line: 1490, baseType: !128, size: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !130, file: !6, line: 1491, baseType: !128, size: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !130, file: !6, line: 1492, baseType: !104, size: 32, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !130, file: !6, line: 1493, baseType: !104, size: 32, offset: 608)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !130, file: !6, line: 1494, baseType: !104, size: 32, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !130, file: !6, line: 1496, baseType: !104, size: 32, offset: 672)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !130, file: !6, line: 1497, baseType: !95, size: 8, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !120, file: !6, line: 1424, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !6, line: 1347, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !6, line: 1545, size: 2816, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !216, !217, !218, !219}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !187, file: !6, line: 1547, baseType: !95, size: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !187, file: !6, line: 1548, baseType: !95, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !187, file: !6, line: 1549, baseType: !104, size: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !187, file: !6, line: 1550, baseType: !104, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !187, file: !6, line: 1551, baseType: !194, size: 2432, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !6, line: 1290, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !6, line: 1277, size: 2432, elements: !196)
!196 = !{!197, !200, !201, !202, !203, !204, !205, !212}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !195, file: !6, line: 1279, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !98, line: 345, baseType: !199)
!199 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !195, file: !6, line: 1281, baseType: !198, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !195, file: !6, line: 1282, baseType: !198, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !195, file: !6, line: 1283, baseType: !104, size: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !195, file: !6, line: 1284, baseType: !104, size: 32, offset: 224)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !195, file: !6, line: 1285, baseType: !104, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !195, file: !6, line: 1287, baseType: !206, size: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !6, line: 1265, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !6, line: 1261, size: 128, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !208, file: !6, line: 1263, baseType: !198, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !208, file: !6, line: 1264, baseType: !96, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !195, file: !6, line: 1289, baseType: !213, size: 2048, offset: 384)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 2048, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !187, file: !6, line: 1552, baseType: !163, size: 64, offset: 2560)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !187, file: !6, line: 1553, baseType: !185, size: 64, offset: 2624)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !187, file: !6, line: 1554, baseType: !185, size: 64, offset: 2688)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !187, file: !6, line: 1555, baseType: !185, size: 64, offset: 2752)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !120, file: !6, line: 1425, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !6, line: 1348, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !6, line: 1994, size: 832, elements: !224)
!224 = !{!225, !226, !227, !346, !347, !357, !367, !368, !369, !370}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !223, file: !6, line: 1996, baseType: !104, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !223, file: !6, line: 1997, baseType: !96, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !223, file: !6, line: 1999, baseType: !228, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !6, line: 1658, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1597, size: 3072, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !238, !239, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !259, !260, !261, !262, !263, !273, !274, !275, !276, !278, !279, !280, !281, !282, !283, !284, !294, !295, !296, !341, !342}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !230, file: !6, line: 1599, baseType: !104, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !230, file: !6, line: 1600, baseType: !104, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !230, file: !6, line: 1601, baseType: !104, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !230, file: !6, line: 1602, baseType: !104, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !230, file: !6, line: 1603, baseType: !237, size: 32, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !6, line: 1591, baseType: !23)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !230, file: !6, line: 1604, baseType: !104, size: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !230, file: !6, line: 1605, baseType: !240, size: 192, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !6, line: 55, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !6, line: 48, size: 192, elements: !242)
!242 = !{!243, !244, !245, !246, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !241, file: !6, line: 50, baseType: !104, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !241, file: !6, line: 51, baseType: !104, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !241, file: !6, line: 52, baseType: !104, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !241, file: !6, line: 53, baseType: !104, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !241, file: !6, line: 54, baseType: !103, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !230, file: !6, line: 1606, baseType: !240, size: 192, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !230, file: !6, line: 1609, baseType: !175, size: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !230, file: !6, line: 1610, baseType: !163, size: 64, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !230, file: !6, line: 1611, baseType: !240, size: 192, offset: 704)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !230, file: !6, line: 1612, baseType: !221, size: 64, offset: 896)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !230, file: !6, line: 1615, baseType: !96, size: 64, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !230, file: !6, line: 1616, baseType: !163, size: 64, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !230, file: !6, line: 1617, baseType: !163, size: 64, offset: 1088)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !230, file: !6, line: 1618, baseType: !104, size: 32, offset: 1152)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !230, file: !6, line: 1619, baseType: !258, size: 64, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !230, file: !6, line: 1626, baseType: !240, size: 192, offset: 1280)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !230, file: !6, line: 1628, baseType: !104, size: 32, offset: 1472)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !230, file: !6, line: 1629, baseType: !104, size: 32, offset: 1504)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !230, file: !6, line: 1631, baseType: !104, size: 32, offset: 1536)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !230, file: !6, line: 1632, baseType: !264, size: 128, offset: 1600)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !98, line: 1786, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !266, line: 8, size: 128, elements: !267)
!266 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!267 = !{!268, !271}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !265, file: !266, line: 10, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !270, line: 160, baseType: !100)
!270 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !265, file: !266, line: 11, baseType: !272, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !270, line: 162, baseType: !100)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !230, file: !6, line: 1633, baseType: !264, size: 128, offset: 1728)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !230, file: !6, line: 1634, baseType: !264, size: 128, offset: 1856)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !230, file: !6, line: 1636, baseType: !258, size: 64, offset: 1984)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !230, file: !6, line: 1637, baseType: !277, size: 64, offset: 2048)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !230, file: !6, line: 1638, baseType: !277, size: 64, offset: 2112)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !230, file: !6, line: 1639, baseType: !264, size: 128, offset: 2176)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !230, file: !6, line: 1640, baseType: !264, size: 128, offset: 2304)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !230, file: !6, line: 1641, baseType: !264, size: 128, offset: 2432)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !230, file: !6, line: 1642, baseType: !104, size: 32, offset: 2560)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !230, file: !6, line: 1643, baseType: !104, size: 32, offset: 2592)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !230, file: !6, line: 1645, baseType: !285, size: 192, offset: 2624)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !6, line: 92, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 85, size: 192, elements: !287)
!287 = !{!288, !290, !291, !293}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !286, file: !6, line: 87, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !6, line: 62, baseType: !104)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !286, file: !6, line: 88, baseType: !104, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !286, file: !6, line: 89, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !98, line: 1687, baseType: !100)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !286, file: !6, line: 91, baseType: !104, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !230, file: !6, line: 1648, baseType: !104, size: 32, offset: 2816)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !230, file: !6, line: 1649, baseType: !104, size: 32, offset: 2848)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !230, file: !6, line: 1651, baseType: !297, size: 64, offset: 2880)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !6, line: 1582, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !6, line: 1682, size: 17280, elements: !300)
!300 = !{!301, !302, !303, !304, !324, !325, !326, !327, !328, !329, !331, !333, !334, !335, !336, !337, !338, !339, !340}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !299, file: !6, line: 1684, baseType: !228, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !299, file: !6, line: 1685, baseType: !104, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !299, file: !6, line: 1686, baseType: !104, size: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !299, file: !6, line: 1691, baseType: !305, size: 4608, offset: 128)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 4608, elements: !322)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !6, line: 1687, size: 384, elements: !307)
!307 = !{!308, !318}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !306, file: !6, line: 1689, baseType: !309, size: 192)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !6, line: 1519, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !6, line: 1513, size: 192, elements: !311)
!311 = !{!312, !313, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !310, file: !6, line: 1515, baseType: !113, size: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !310, file: !6, line: 1516, baseType: !97, size: 8, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !310, file: !6, line: 1517, baseType: !315, size: 8, offset: 136)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 8, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 1)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "room", scope: !306, file: !6, line: 1690, baseType: !319, size: 160, offset: 192)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 160, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 20)
!322 = !{!323}
!323 = !DISubrange(count: 12)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars", scope: !299, file: !6, line: 1692, baseType: !186, size: 2816, offset: 4736)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars_var", scope: !299, file: !6, line: 1693, baseType: !309, size: 192, offset: 7552)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars", scope: !299, file: !6, line: 1694, baseType: !186, size: 2816, offset: 7744)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars_var", scope: !299, file: !6, line: 1695, baseType: !309, size: 192, offset: 10560)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "l_varlist", scope: !299, file: !6, line: 1696, baseType: !129, size: 768, offset: 10752)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "l_listitems", scope: !299, file: !6, line: 1697, baseType: !330, size: 5120, offset: 11520)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 5120, elements: !320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rettv", scope: !299, file: !6, line: 1698, baseType: !332, size: 64, offset: 16640)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !299, file: !6, line: 1699, baseType: !292, size: 64, offset: 16704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dbg_tick", scope: !299, file: !6, line: 1700, baseType: !104, size: 32, offset: 16768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !299, file: !6, line: 1701, baseType: !104, size: 32, offset: 16800)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prof_child", scope: !299, file: !6, line: 1703, baseType: !264, size: 128, offset: 16832)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !299, file: !6, line: 1705, baseType: !297, size: 64, offset: 16960)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fc_refcount", scope: !299, file: !6, line: 1709, baseType: !104, size: 32, offset: 17024)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fc_copyID", scope: !299, file: !6, line: 1711, baseType: !104, size: 32, offset: 17056)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fc_funcs", scope: !299, file: !6, line: 1712, baseType: !240, size: 192, offset: 17088)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name_exp", scope: !230, file: !6, line: 1653, baseType: !96, size: 64, offset: 2944)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name", scope: !230, file: !6, line: 1655, baseType: !343, size: 32, offset: 3008)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 32, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 4)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pt_auto", scope: !223, file: !6, line: 2001, baseType: !104, size: 32, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pt_outer", scope: !223, file: !6, line: 2005, baseType: !348, size: 256, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "outer_T", file: !6, line: 1986, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_S", file: !6, line: 1987, size: 256, elements: !350)
!350 = !{!351, !353, !354, !356}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "out_stack", scope: !349, file: !6, line: 1988, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame_idx", scope: !349, file: !6, line: 1989, baseType: !104, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "out_up", scope: !349, file: !6, line: 1990, baseType: !355, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "out_up_is_copy", scope: !349, file: !6, line: 1991, baseType: !104, size: 32, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pt_funcstack", scope: !223, file: !6, line: 2007, baseType: !358, size: 64, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "funcstack_T", file: !6, line: 1984, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcstack_S", file: !6, line: 1972, size: 320, elements: !361)
!361 = !{!362, !363, !364, !365, !366}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ga", scope: !360, file: !6, line: 1974, baseType: !240, size: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fs_var_offset", scope: !360, file: !6, line: 1978, baseType: !104, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fs_refcount", scope: !360, file: !6, line: 1981, baseType: !104, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fs_min_refcount", scope: !360, file: !6, line: 1982, baseType: !104, size: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "fs_copyID", scope: !360, file: !6, line: 1983, baseType: !104, size: 32, offset: 288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argc", scope: !223, file: !6, line: 2010, baseType: !104, size: 32, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argv", scope: !223, file: !6, line: 2011, baseType: !332, size: 64, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pt_dict", scope: !223, file: !6, line: 2013, baseType: !185, size: 64, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pt_copyID", scope: !223, file: !6, line: 2014, baseType: !104, size: 32, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !120, file: !6, line: 1427, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !6, line: 1365, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !6, line: 2072, size: 1024, elements: !375)
!375 = !{!376, !377, !378, !382, !383, !384, !386, !387, !388, !389, !396, !1668, !1669, !1670, !1768}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !374, file: !6, line: 2074, baseType: !372, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !374, file: !6, line: 2075, baseType: !372, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !374, file: !6, line: 2077, baseType: !379, size: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !380, line: 97, baseType: !381)
!380 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !270, line: 154, baseType: !104)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !374, file: !6, line: 2083, baseType: !96, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !374, file: !6, line: 2084, baseType: !96, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !374, file: !6, line: 2085, baseType: !385, size: 32, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !6, line: 2067, baseType: !30)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !374, file: !6, line: 2086, baseType: !96, size: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !374, file: !6, line: 2088, baseType: !96, size: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !374, file: !6, line: 2093, baseType: !104, size: 32, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !374, file: !6, line: 2094, baseType: !390, size: 192, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !6, line: 1360, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1356, size: 192, elements: !392)
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !391, file: !6, line: 1357, baseType: !96, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !391, file: !6, line: 1358, baseType: !221, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !391, file: !6, line: 1359, baseType: !104, size: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !374, file: !6, line: 2096, baseType: !397, size: 64, offset: 768)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !6, line: 63, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !6, line: 2629, size: 73152, elements: !400)
!400 = !{!401, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !509, !512, !513, !517, !518, !528, !529, !530, !531, !532, !533, !534, !535, !1341, !1342, !1343, !1348, !1349, !1350, !1354, !1362, !1363, !1364, !1365, !1366, !1368, !1369, !1370, !1371, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1615, !1616, !1617, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1651, !1652, !1653, !1654, !1655, !1662, !1663, !1667}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !399, file: !6, line: 2631, baseType: !402, size: 832)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !6, line: 766, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !6, line: 737, size: 832, elements: !404)
!404 = !{!405, !406, !467, !476, !477, !478, !479, !481, !482, !483, !484, !485, !486, !487, !494, !495}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !403, file: !6, line: 739, baseType: !292, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !403, file: !6, line: 741, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !6, line: 459, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !6, line: 671, size: 9856, elements: !410)
!410 = !{!411, !412, !413, !414, !415, !416, !435, !436, !437, !438, !439, !452, !453, !454, !455, !456, !457, !458, !459, !460, !464, !465, !466}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !409, file: !6, line: 673, baseType: !96, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !409, file: !6, line: 674, baseType: !96, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !409, file: !6, line: 675, baseType: !104, size: 32, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !409, file: !6, line: 676, baseType: !104, size: 32, offset: 160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !409, file: !6, line: 677, baseType: !104, size: 32, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !409, file: !6, line: 678, baseType: !417, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !6, line: 458, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !6, line: 506, size: 448, elements: !420)
!420 = !{!421, !430, !431, !432, !433, !434}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !419, file: !6, line: 508, baseType: !422, size: 192)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !6, line: 469, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !6, line: 471, size: 192, elements: !424)
!424 = !{!425, !427, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !423, file: !6, line: 473, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !423, file: !6, line: 474, baseType: !426, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !423, file: !6, line: 475, baseType: !429, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !6, line: 460, baseType: !100)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !419, file: !6, line: 511, baseType: !417, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !419, file: !6, line: 512, baseType: !417, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !419, file: !6, line: 513, baseType: !96, size: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !419, file: !6, line: 514, baseType: !104, size: 32, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !419, file: !6, line: 518, baseType: !95, size: 8, offset: 416)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !409, file: !6, line: 679, baseType: !417, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !409, file: !6, line: 680, baseType: !417, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !409, file: !6, line: 681, baseType: !105, size: 32, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !409, file: !6, line: 682, baseType: !105, size: 32, offset: 480)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !409, file: !6, line: 683, baseType: !440, size: 4352, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !6, line: 489, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !6, line: 480, size: 4352, elements: !442)
!442 = !{!443, !444, !445, !447, !451}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !441, file: !6, line: 482, baseType: !198, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !441, file: !6, line: 484, baseType: !198, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !441, file: !6, line: 485, baseType: !446, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !441, file: !6, line: 487, baseType: !448, size: 4096, offset: 192)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 4096, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !441, file: !6, line: 488, baseType: !95, size: 8, offset: 4288)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !409, file: !6, line: 684, baseType: !440, size: 4352, offset: 4864)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !409, file: !6, line: 685, baseType: !429, size: 64, offset: 9216)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !409, file: !6, line: 686, baseType: !429, size: 64, offset: 9280)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !409, file: !6, line: 687, baseType: !429, size: 64, offset: 9344)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !409, file: !6, line: 688, baseType: !429, size: 64, offset: 9408)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !409, file: !6, line: 689, baseType: !105, size: 32, offset: 9472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !409, file: !6, line: 690, baseType: !104, size: 32, offset: 9504)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !409, file: !6, line: 692, baseType: !397, size: 64, offset: 9536)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !409, file: !6, line: 693, baseType: !461, size: 64, offset: 9600)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 64, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 8)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !409, file: !6, line: 697, baseType: !96, size: 64, offset: 9664)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !409, file: !6, line: 698, baseType: !104, size: 32, offset: 9728)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !409, file: !6, line: 699, baseType: !461, size: 64, offset: 9760)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !403, file: !6, line: 743, baseType: !468, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !6, line: 717, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !6, line: 711, size: 256, elements: !471)
!471 = !{!472, !473, !474, !475}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !470, file: !6, line: 713, baseType: !429, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !470, file: !6, line: 714, baseType: !292, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !470, file: !6, line: 715, baseType: !292, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !470, file: !6, line: 716, baseType: !104, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !403, file: !6, line: 744, baseType: !104, size: 32, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !403, file: !6, line: 745, baseType: !104, size: 32, offset: 224)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !403, file: !6, line: 751, baseType: !104, size: 32, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !403, file: !6, line: 753, baseType: !480, size: 32, offset: 288)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !98, line: 1688, baseType: !104)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !403, file: !6, line: 754, baseType: !292, size: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !403, file: !6, line: 755, baseType: !96, size: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !403, file: !6, line: 757, baseType: !417, size: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !403, file: !6, line: 758, baseType: !292, size: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !403, file: !6, line: 759, baseType: !292, size: 64, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !403, file: !6, line: 760, baseType: !104, size: 32, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !403, file: !6, line: 762, baseType: !488, size: 64, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !6, line: 724, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !6, line: 720, size: 128, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !490, file: !6, line: 722, baseType: !104, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !490, file: !6, line: 723, baseType: !100, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !403, file: !6, line: 763, baseType: !104, size: 32, offset: 768)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !403, file: !6, line: 764, baseType: !104, size: 32, offset: 800)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !399, file: !6, line: 2634, baseType: !397, size: 64, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !399, file: !6, line: 2635, baseType: !397, size: 64, offset: 896)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !399, file: !6, line: 2637, baseType: !104, size: 32, offset: 960)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !399, file: !6, line: 2639, baseType: !104, size: 32, offset: 992)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !399, file: !6, line: 2640, baseType: !104, size: 32, offset: 1024)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !399, file: !6, line: 2642, baseType: !104, size: 32, offset: 1056)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !399, file: !6, line: 2651, baseType: !96, size: 64, offset: 1088)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !399, file: !6, line: 2652, baseType: !96, size: 64, offset: 1152)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !399, file: !6, line: 2654, baseType: !96, size: 64, offset: 1216)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !399, file: !6, line: 2658, baseType: !104, size: 32, offset: 1280)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !399, file: !6, line: 2659, baseType: !507, size: 64, offset: 1344)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !380, line: 59, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !270, line: 145, baseType: !199)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !399, file: !6, line: 2660, baseType: !510, size: 64, offset: 1408)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !380, line: 47, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !270, line: 148, baseType: !199)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !399, file: !6, line: 2667, baseType: !104, size: 32, offset: 1472)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !399, file: !6, line: 2668, baseType: !514, size: 72, offset: 1504)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 72, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 9)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !399, file: !6, line: 2672, baseType: !104, size: 32, offset: 1600)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !399, file: !6, line: 2674, baseType: !519, size: 320, offset: 1664)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !6, line: 1532, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !6, line: 1526, size: 320, elements: !521)
!521 = !{!522, !523, !524}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !520, file: !6, line: 1528, baseType: !113, size: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !520, file: !6, line: 1529, baseType: !97, size: 8, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !520, file: !6, line: 1530, baseType: !525, size: 136, offset: 136)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 136, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 17)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !399, file: !6, line: 2679, baseType: !101, size: 64, offset: 1984)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !399, file: !6, line: 2681, baseType: !101, size: 64, offset: 2048)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !399, file: !6, line: 2684, baseType: !104, size: 32, offset: 2112)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !399, file: !6, line: 2691, baseType: !104, size: 32, offset: 2144)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !399, file: !6, line: 2693, baseType: !292, size: 64, offset: 2176)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !399, file: !6, line: 2694, baseType: !292, size: 64, offset: 2240)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !399, file: !6, line: 2696, baseType: !100, size: 64, offset: 2304)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !399, file: !6, line: 2699, baseType: !536, size: 64, offset: 2368)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !6, line: 60, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !6, line: 325, size: 11648, elements: !539)
!539 = !{!540, !541, !542, !1336, !1337, !1338, !1339, !1340}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !538, file: !6, line: 327, baseType: !536, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !538, file: !6, line: 328, baseType: !536, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !538, file: !6, line: 329, baseType: !543, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !6, line: 59, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !6, line: 3365, size: 72064, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !706, !707, !722, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !779, !780, !781, !782, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !803, !804, !806, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !827, !828, !829, !830, !831, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !891, !892, !893, !894, !895, !1148, !1156, !1157, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1249, !1250, !1251, !1252, !1293, !1294, !1304, !1305, !1306, !1307, !1308, !1328, !1329, !1330, !1331, !1335}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !545, file: !6, line: 3367, baseType: !104, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !545, file: !6, line: 3369, baseType: !397, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !545, file: !6, line: 3371, baseType: !543, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !545, file: !6, line: 3372, baseType: !543, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !545, file: !6, line: 3375, baseType: !552, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !6, line: 2618, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2542, size: 9920, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !571, !572, !573, !574, !575, !633, !641, !642, !643, !644, !645, !682, !683, !684, !685, !686, !687, !689, !690, !694, !695, !696, !697, !698, !699, !700, !701, !705}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !554, file: !6, line: 2544, baseType: !194, size: 2432)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !554, file: !6, line: 2545, baseType: !194, size: 2432, offset: 2432)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !554, file: !6, line: 2546, baseType: !104, size: 32, offset: 4864)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !554, file: !6, line: 2548, baseType: !104, size: 32, offset: 4896)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !554, file: !6, line: 2550, baseType: !104, size: 32, offset: 4928)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !554, file: !6, line: 2551, baseType: !104, size: 32, offset: 4960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !554, file: !6, line: 2552, baseType: !104, size: 32, offset: 4992)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !554, file: !6, line: 2553, baseType: !240, size: 192, offset: 5056)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !554, file: !6, line: 2554, baseType: !240, size: 192, offset: 5248)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !554, file: !6, line: 2555, baseType: !104, size: 32, offset: 5440)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !554, file: !6, line: 2556, baseType: !104, size: 32, offset: 5472)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !554, file: !6, line: 2557, baseType: !104, size: 32, offset: 5504)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !554, file: !6, line: 2559, baseType: !104, size: 32, offset: 5536)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !554, file: !6, line: 2560, baseType: !570, size: 16, offset: 5568)
!570 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !554, file: !6, line: 2561, baseType: !100, size: 64, offset: 5632)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !554, file: !6, line: 2562, baseType: !100, size: 64, offset: 5696)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !554, file: !6, line: 2563, baseType: !100, size: 64, offset: 5760)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !554, file: !6, line: 2564, baseType: !96, size: 64, offset: 5824)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !554, file: !6, line: 2565, baseType: !576, size: 64, offset: 5888)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !578, line: 56, baseType: !579)
!578 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !578, line: 49, size: 192, elements: !580)
!580 = !{!581, !629, !630, !631, !632}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !579, file: !578, line: 51, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !578, line: 42, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !578, line: 167, size: 320, elements: !585)
!585 = !{!586, !590, !594, !609, !628}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !584, file: !578, line: 169, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!576, !96, !104}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !584, file: !578, line: 170, baseType: !591, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !576}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !584, file: !578, line: 171, baseType: !595, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!104, !598, !96, !480, !104}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !578, line: 137, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 131, size: 1408, elements: !601)
!601 = !{!602, !603, !607, !608}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !600, file: !578, line: 133, baseType: !576, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !600, file: !578, line: 134, baseType: !604, size: 640, offset: 64)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 640, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 10)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !600, file: !578, line: 135, baseType: !604, size: 640, offset: 704)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !600, file: !578, line: 136, baseType: !104, size: 32, offset: 1344)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !584, file: !578, line: 172, baseType: !610, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!100, !613, !543, !397, !292, !480, !277, !258}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !578, line: 154, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 147, size: 2688, elements: !616)
!616 = !{!617, !618, !625, !626, !627}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !615, file: !578, line: 149, baseType: !576, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !615, file: !578, line: 150, baseType: !619, size: 1280, offset: 64)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 1280, elements: !605)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !6, line: 41, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 37, size: 128, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !621, file: !6, line: 39, baseType: !292, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !621, file: !6, line: 40, baseType: !480, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !615, file: !578, line: 151, baseType: !619, size: 1280, offset: 1344)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !615, file: !578, line: 152, baseType: !104, size: 32, offset: 2624)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !615, file: !578, line: 153, baseType: !480, size: 32, offset: 2656)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !584, file: !578, line: 173, baseType: !96, size: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !579, file: !578, line: 52, baseType: !105, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !579, file: !578, line: 53, baseType: !105, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !579, file: !578, line: 54, baseType: !105, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !579, file: !578, line: 55, baseType: !104, size: 32, offset: 160)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !554, file: !6, line: 2567, baseType: !634, size: 384, offset: 5952)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !6, line: 2475, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2470, size: 384, elements: !636)
!636 = !{!637, !638, !639, !640}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !635, file: !6, line: 2471, baseType: !264, size: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !635, file: !6, line: 2472, baseType: !264, size: 128, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !635, file: !6, line: 2473, baseType: !100, size: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !635, file: !6, line: 2474, baseType: !100, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !554, file: !6, line: 2569, baseType: !104, size: 32, offset: 6336)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !554, file: !6, line: 2570, baseType: !104, size: 32, offset: 6368)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !554, file: !6, line: 2572, baseType: !104, size: 32, offset: 6400)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !554, file: !6, line: 2575, baseType: !104, size: 32, offset: 6432)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !554, file: !6, line: 2592, baseType: !646, size: 64, offset: 6464)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !6, line: 1061, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !6, line: 1063, size: 1728, elements: !649)
!649 = !{!650, !651, !652, !674, !675, !676, !678, !681}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !648, file: !6, line: 1065, baseType: !646, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !648, file: !6, line: 1066, baseType: !292, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !648, file: !6, line: 1071, baseType: !653, size: 1344, offset: 128)
!653 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !648, file: !6, line: 1067, size: 1344, elements: !654)
!654 = !{!655, !673}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !653, file: !6, line: 1069, baseType: !656, size: 1344)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 1344, elements: !671)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !6, line: 1055, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !6, line: 1046, size: 192, elements: !659)
!659 = !{!660, !661, !662, !663, !664}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !658, file: !6, line: 1048, baseType: !104, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !658, file: !6, line: 1049, baseType: !104, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !658, file: !6, line: 1051, baseType: !104, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !658, file: !6, line: 1052, baseType: !104, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !658, file: !6, line: 1054, baseType: !665, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !578, line: 165, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 161, size: 704, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !667, file: !578, line: 163, baseType: !570, size: 16)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !667, file: !578, line: 164, baseType: !604, size: 640, offset: 64)
!671 = !{!672}
!672 = !DISubrange(count: 7)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !653, file: !6, line: 1070, baseType: !240, size: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !648, file: !6, line: 1072, baseType: !104, size: 32, offset: 1472)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !648, file: !6, line: 1073, baseType: !104, size: 32, offset: 1504)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !648, file: !6, line: 1074, baseType: !677, size: 64, offset: 1536)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !648, file: !6, line: 1076, baseType: !679, size: 16, offset: 1600)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !98, line: 1689, baseType: !680)
!680 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !648, file: !6, line: 1077, baseType: !292, size: 64, offset: 1664)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !554, file: !6, line: 2593, baseType: !104, size: 32, offset: 6528)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !554, file: !6, line: 2594, baseType: !646, size: 64, offset: 6592)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !554, file: !6, line: 2595, baseType: !646, size: 64, offset: 6656)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !554, file: !6, line: 2596, baseType: !104, size: 32, offset: 6720)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !554, file: !6, line: 2597, baseType: !292, size: 64, offset: 6784)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !554, file: !6, line: 2598, baseType: !688, size: 16, offset: 6848)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !98, line: 325, baseType: !680)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !554, file: !6, line: 2603, baseType: !240, size: 192, offset: 6912)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !554, file: !6, line: 2604, baseType: !691, size: 2048, offset: 7104)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 2048, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !554, file: !6, line: 2605, baseType: !96, size: 64, offset: 9152)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !554, file: !6, line: 2606, baseType: !96, size: 64, offset: 9216)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !554, file: !6, line: 2607, baseType: !576, size: 64, offset: 9280)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !554, file: !6, line: 2608, baseType: !96, size: 64, offset: 9344)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !554, file: !6, line: 2609, baseType: !96, size: 64, offset: 9408)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !554, file: !6, line: 2610, baseType: !96, size: 64, offset: 9472)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !554, file: !6, line: 2611, baseType: !104, size: 32, offset: 9536)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !554, file: !6, line: 2616, baseType: !702, size: 256, offset: 9568)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 256, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !554, file: !6, line: 2617, baseType: !96, size: 64, offset: 9856)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !545, file: !6, line: 3378, baseType: !104, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !545, file: !6, line: 3381, baseType: !708, size: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !6, line: 61, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !6, line: 3231, size: 512, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !710, file: !6, line: 3233, baseType: !95, size: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !710, file: !6, line: 3234, baseType: !104, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !710, file: !6, line: 3235, baseType: !104, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !710, file: !6, line: 3236, baseType: !104, size: 32, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !710, file: !6, line: 3237, baseType: !104, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !710, file: !6, line: 3238, baseType: !708, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !710, file: !6, line: 3239, baseType: !708, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !710, file: !6, line: 3241, baseType: !708, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !710, file: !6, line: 3244, baseType: !708, size: 64, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !710, file: !6, line: 3245, baseType: !543, size: 64, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !545, file: !6, line: 3383, baseType: !723, size: 128, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !6, line: 31, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 26, size: 128, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !724, file: !6, line: 28, baseType: !292, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !724, file: !6, line: 29, baseType: !480, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !724, file: !6, line: 30, baseType: !480, size: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !545, file: !6, line: 3385, baseType: !480, size: 32, offset: 576)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !545, file: !6, line: 3389, baseType: !104, size: 32, offset: 608)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !545, file: !6, line: 3394, baseType: !292, size: 64, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !545, file: !6, line: 3400, baseType: !95, size: 8, offset: 704)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !545, file: !6, line: 3401, baseType: !292, size: 64, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !545, file: !6, line: 3402, baseType: !480, size: 32, offset: 832)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !545, file: !6, line: 3403, baseType: !480, size: 32, offset: 864)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !545, file: !6, line: 3404, baseType: !292, size: 64, offset: 896)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !545, file: !6, line: 3405, baseType: !480, size: 32, offset: 960)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !545, file: !6, line: 3406, baseType: !480, size: 32, offset: 992)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !545, file: !6, line: 3408, baseType: !740, size: 352, offset: 1024)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !6, line: 3358, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3343, size: 352, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !741, file: !6, line: 3345, baseType: !104, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !741, file: !6, line: 3346, baseType: !104, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !741, file: !6, line: 3347, baseType: !104, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !741, file: !6, line: 3348, baseType: !104, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !741, file: !6, line: 3349, baseType: !104, size: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !741, file: !6, line: 3350, baseType: !104, size: 32, offset: 160)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !741, file: !6, line: 3351, baseType: !104, size: 32, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !741, file: !6, line: 3352, baseType: !104, size: 32, offset: 224)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !741, file: !6, line: 3353, baseType: !104, size: 32, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !741, file: !6, line: 3354, baseType: !104, size: 32, offset: 288)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !741, file: !6, line: 3356, baseType: !104, size: 32, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !545, file: !6, line: 3414, baseType: !292, size: 64, offset: 1408)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !545, file: !6, line: 3416, baseType: !95, size: 8, offset: 1472)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !545, file: !6, line: 3419, baseType: !292, size: 64, offset: 1536)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !545, file: !6, line: 3423, baseType: !104, size: 32, offset: 1600)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !545, file: !6, line: 3424, baseType: !104, size: 32, offset: 1632)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !545, file: !6, line: 3425, baseType: !104, size: 32, offset: 1664)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !545, file: !6, line: 3427, baseType: !104, size: 32, offset: 1696)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !545, file: !6, line: 3429, baseType: !480, size: 32, offset: 1728)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !545, file: !6, line: 3432, baseType: !480, size: 32, offset: 1760)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !545, file: !6, line: 3435, baseType: !104, size: 32, offset: 1792)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !545, file: !6, line: 3437, baseType: !104, size: 32, offset: 1824)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !545, file: !6, line: 3445, baseType: !104, size: 32, offset: 1856)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !545, file: !6, line: 3446, baseType: !104, size: 32, offset: 1888)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !545, file: !6, line: 3449, baseType: !104, size: 32, offset: 1920)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !545, file: !6, line: 3450, baseType: !104, size: 32, offset: 1952)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !545, file: !6, line: 3451, baseType: !104, size: 32, offset: 1984)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !545, file: !6, line: 3452, baseType: !104, size: 32, offset: 2016)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !545, file: !6, line: 3454, baseType: !772, size: 320, offset: 2048)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !6, line: 3330, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3324, size: 320, elements: !774)
!774 = !{!775, !776, !777, !778}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !773, file: !6, line: 3326, baseType: !104, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !773, file: !6, line: 3327, baseType: !104, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !773, file: !6, line: 3328, baseType: !723, size: 128, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !773, file: !6, line: 3329, baseType: !723, size: 128, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !545, file: !6, line: 3457, baseType: !104, size: 32, offset: 2368)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !545, file: !6, line: 3458, baseType: !104, size: 32, offset: 2400)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !545, file: !6, line: 3459, baseType: !96, size: 64, offset: 2432)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !545, file: !6, line: 3460, baseType: !783, size: 32, offset: 2496)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !6, line: 2524, baseType: !36)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !545, file: !6, line: 3461, baseType: !104, size: 32, offset: 2528)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !545, file: !6, line: 3462, baseType: !104, size: 32, offset: 2560)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !545, file: !6, line: 3463, baseType: !543, size: 64, offset: 2624)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !545, file: !6, line: 3464, baseType: !104, size: 32, offset: 2688)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !545, file: !6, line: 3465, baseType: !104, size: 32, offset: 2720)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !545, file: !6, line: 3466, baseType: !104, size: 32, offset: 2752)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !545, file: !6, line: 3467, baseType: !104, size: 32, offset: 2784)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !545, file: !6, line: 3468, baseType: !104, size: 32, offset: 2816)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !545, file: !6, line: 3469, baseType: !104, size: 32, offset: 2848)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !545, file: !6, line: 3470, baseType: !104, size: 32, offset: 2880)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !545, file: !6, line: 3471, baseType: !104, size: 32, offset: 2912)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !545, file: !6, line: 3472, baseType: !104, size: 32, offset: 2944)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !545, file: !6, line: 3473, baseType: !104, size: 32, offset: 2976)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !545, file: !6, line: 3474, baseType: !104, size: 32, offset: 3008)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !545, file: !6, line: 3475, baseType: !104, size: 32, offset: 3040)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !545, file: !6, line: 3476, baseType: !96, size: 64, offset: 3072)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !545, file: !6, line: 3477, baseType: !96, size: 64, offset: 3136)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !545, file: !6, line: 3478, baseType: !802, size: 128, offset: 3200)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 128, elements: !344)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !545, file: !6, line: 3479, baseType: !802, size: 128, offset: 3328)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !545, file: !6, line: 3480, baseType: !805, size: 256, offset: 3456)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 256, elements: !344)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !545, file: !6, line: 3481, baseType: !807, size: 256, offset: 3712)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 256, elements: !462)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !545, file: !6, line: 3483, baseType: !104, size: 32, offset: 3968)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !545, file: !6, line: 3484, baseType: !104, size: 32, offset: 4000)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !545, file: !6, line: 3485, baseType: !101, size: 64, offset: 4032)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !545, file: !6, line: 3487, baseType: !101, size: 64, offset: 4096)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !545, file: !6, line: 3490, baseType: !104, size: 32, offset: 4160)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !545, file: !6, line: 3493, baseType: !292, size: 64, offset: 4224)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !545, file: !6, line: 3495, baseType: !390, size: 192, offset: 4288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !545, file: !6, line: 3496, baseType: !390, size: 192, offset: 4480)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !545, file: !6, line: 3497, baseType: !104, size: 32, offset: 4672)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !545, file: !6, line: 3498, baseType: !104, size: 32, offset: 4704)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !545, file: !6, line: 3500, baseType: !543, size: 64, offset: 4736)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !545, file: !6, line: 3501, baseType: !292, size: 64, offset: 4800)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !545, file: !6, line: 3502, baseType: !480, size: 32, offset: 4864)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !545, file: !6, line: 3503, baseType: !480, size: 32, offset: 4896)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !545, file: !6, line: 3504, baseType: !104, size: 32, offset: 4928)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !545, file: !6, line: 3505, baseType: !104, size: 32, offset: 4960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !545, file: !6, line: 3506, baseType: !104, size: 32, offset: 4992)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !545, file: !6, line: 3507, baseType: !826, size: 32, offset: 5024)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !6, line: 2530, baseType: !44)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !545, file: !6, line: 3509, baseType: !128, size: 64, offset: 5056)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !545, file: !6, line: 3510, baseType: !96, size: 64, offset: 5120)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !545, file: !6, line: 3511, baseType: !104, size: 32, offset: 5184)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !545, file: !6, line: 3512, baseType: !104, size: 32, offset: 5216)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !545, file: !6, line: 3514, baseType: !832, size: 64, offset: 5248)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !6, line: 2478, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !6, line: 2479, size: 704, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !834, file: !6, line: 2481, baseType: !100, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !834, file: !6, line: 2483, baseType: !832, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !834, file: !6, line: 2484, baseType: !832, size: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !834, file: !6, line: 2485, baseType: !264, size: 128, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !834, file: !6, line: 2486, baseType: !95, size: 8, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !834, file: !6, line: 2487, baseType: !95, size: 8, offset: 328)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !834, file: !6, line: 2488, baseType: !104, size: 32, offset: 352)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !834, file: !6, line: 2489, baseType: !100, size: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !834, file: !6, line: 2490, baseType: !390, size: 192, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !834, file: !6, line: 2491, baseType: !104, size: 32, offset: 640)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !545, file: !6, line: 3517, baseType: !104, size: 32, offset: 5312)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !545, file: !6, line: 3534, baseType: !104, size: 32, offset: 5344)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !545, file: !6, line: 3535, baseType: !723, size: 128, offset: 5376)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !545, file: !6, line: 3537, baseType: !480, size: 32, offset: 5504)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !545, file: !6, line: 3543, baseType: !104, size: 32, offset: 5536)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !545, file: !6, line: 3545, baseType: !104, size: 32, offset: 5568)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !545, file: !6, line: 3548, baseType: !104, size: 32, offset: 5600)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !545, file: !6, line: 3550, baseType: !480, size: 32, offset: 5632)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !545, file: !6, line: 3562, baseType: !104, size: 32, offset: 5664)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !545, file: !6, line: 3562, baseType: !104, size: 32, offset: 5696)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !545, file: !6, line: 3574, baseType: !104, size: 32, offset: 5728)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !545, file: !6, line: 3575, baseType: !858, size: 64, offset: 5760)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !6, line: 3225, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !6, line: 3216, size: 192, elements: !861)
!861 = !{!862, !863, !864, !865, !866}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !860, file: !6, line: 3218, baseType: !292, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !860, file: !6, line: 3219, baseType: !688, size: 16, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !860, file: !6, line: 3220, baseType: !95, size: 8, offset: 80)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !860, file: !6, line: 3222, baseType: !95, size: 8, offset: 88)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !860, file: !6, line: 3223, baseType: !292, size: 64, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !545, file: !6, line: 3578, baseType: !240, size: 192, offset: 5824)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !545, file: !6, line: 3579, baseType: !95, size: 8, offset: 6016)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !545, file: !6, line: 3581, baseType: !95, size: 8, offset: 6024)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !545, file: !6, line: 3585, baseType: !104, size: 32, offset: 6048)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !545, file: !6, line: 3593, baseType: !104, size: 32, offset: 6080)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !545, file: !6, line: 3594, baseType: !104, size: 32, offset: 6112)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_top", scope: !545, file: !6, line: 3596, baseType: !292, size: 64, offset: 6144)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_bot", scope: !545, file: !6, line: 3597, baseType: !292, size: 64, offset: 6208)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_status", scope: !545, file: !6, line: 3598, baseType: !104, size: 32, offset: 6272)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_cursor", scope: !545, file: !6, line: 3602, baseType: !723, size: 128, offset: 6336)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_virtcol", scope: !545, file: !6, line: 3603, baseType: !480, size: 32, offset: 6464)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topline", scope: !545, file: !6, line: 3604, baseType: !292, size: 64, offset: 6528)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_line_count", scope: !545, file: !6, line: 3605, baseType: !292, size: 64, offset: 6592)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topfill", scope: !545, file: !6, line: 3607, baseType: !104, size: 32, offset: 6656)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_empty", scope: !545, file: !6, line: 3609, baseType: !95, size: 8, offset: 6688)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "w_alt_fnum", scope: !545, file: !6, line: 3612, baseType: !104, size: 32, offset: 6720)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "w_alist", scope: !545, file: !6, line: 3614, baseType: !884, size: 64, offset: 6784)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "alist_T", file: !6, line: 863, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arglist", file: !6, line: 858, size: 256, elements: !887)
!887 = !{!888, !889, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "al_ga", scope: !886, file: !6, line: 860, baseType: !240, size: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "al_refcount", scope: !886, file: !6, line: 861, baseType: !104, size: 32, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !886, file: !6, line: 862, baseType: !104, size: 32, offset: 224)
