; ModuleID = 'list.c'
source_filename = "list.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.listvar_S = type { %struct.listitem_S*, %struct.listwatch_S*, %union.anon.0, %struct.type_S*, %struct.listvar_S*, %struct.listvar_S*, %struct.listvar_S*, i32, i32, i32, i32, i8 }
%struct.listitem_S = type { %struct.listitem_S*, %struct.listitem_S*, %struct.typval_T }
%struct.typval_T = type { i32, i8, %union.anon }
%union.anon = type { i64 }
%struct.listwatch_S = type { %struct.listitem_S*, %struct.listwatch_S* }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { i64, i64, i32 }
%struct.type_S = type { i32, i8, i8, i8, %struct.type_S*, %struct.type_S** }
%struct.sortinfo_T = type { i32, i32, i32, i32, i32, i8*, %struct.partial_S*, %struct.dictvar_S*, i32, i32 }
%struct.partial_S = type { i32, i8*, %struct.ufunc_T*, i32, %struct.outer_S, %struct.funcstack_S*, i32, %struct.typval_T*, %struct.dictvar_S*, i32 }
%struct.ufunc_T = type { i32, i32, i32, i32, i32, i32, %struct.growarray, %struct.growarray, %struct.type_S**, %struct.type_S*, %struct.growarray, %struct.partial_S*, i8*, %struct.type_S*, %struct.type_S*, i32, i32*, %struct.growarray, i32, i32, i32, %struct.timeval, %struct.timeval, %struct.timeval, i32*, %struct.timeval*, %struct.timeval*, %struct.timeval, %struct.timeval, %struct.timeval, i32, i32, %struct.sctx_T, i32, i32, %struct.funccall_S*, i8*, [4 x i8] }

!41 = !DIEnumerator(name: "POPPOS_TOPRIGHT", value: 3)
!42 = !DIEnumerator(name: "POPPOS_CENTER", value: 4)
!43 = !DIEnumerator(name: "POPPOS_NONE", value: 5)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2526, size: 32, elements: !45)
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "POPCLOSE_NONE", value: 0)
!47 = !DIEnumerator(name: "POPCLOSE_BUTTON", value: 1)
!48 = !DIEnumerator(name: "POPCLOSE_CLICK", value: 2)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 55, size: 32, elements: !51)
!50 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkvisual.h", directory: "/home/sahil/vim/src")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "GDK_VISUAL_STATIC_GRAY", value: 0)
!53 = !DIEnumerator(name: "GDK_VISUAL_GRAYSCALE", value: 1)
!54 = !DIEnumerator(name: "GDK_VISUAL_STATIC_COLOR", value: 2)
!55 = !DIEnumerator(name: "GDK_VISUAL_PSEUDO_COLOR", value: 3)
!56 = !DIEnumerator(name: "GDK_VISUAL_TRUE_COLOR", value: 4)
!57 = !DIEnumerator(name: "GDK_VISUAL_DIRECT_COLOR", value: 5)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 118, size: 32, elements: !60)
!59 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdktypes.h", directory: "/home/sahil/vim/src")
!60 = !{!61, !62}
!61 = !DIEnumerator(name: "GDK_LSB_FIRST", value: 0)
!62 = !DIEnumerator(name: "GDK_MSB_FIRST", value: 1)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 43, size: 32, elements: !65)
!64 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkfont.h", directory: "/home/sahil/vim/src")
!65 = !{!66, !67}
!66 = !DIEnumerator(name: "GDK_FONT_FONT", value: 0)
!67 = !DIEnumerator(name: "GDK_FONT_FONTSET", value: 1)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 52, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkrc.h", directory: "/home/sahil/vim/src")
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "GTK_RC_FG", value: 1)
!72 = !DIEnumerator(name: "GTK_RC_BG", value: 2)
!73 = !DIEnumerator(name: "GTK_RC_TEXT", value: 4)
!74 = !DIEnumerator(name: "GTK_RC_BASE", value: 8)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2140, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80}
!77 = !DIEnumerator(name: "MODE_NL", value: 0)
!78 = !DIEnumerator(name: "MODE_RAW", value: 1)
!79 = !DIEnumerator(name: "MODE_JSON", value: 2)
!80 = !DIEnumerator(name: "MODE_JS", value: 3)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2148, size: 32, elements: !82)
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIEnumerator(name: "JIO_PIPE", value: 0)
!84 = !DIEnumerator(name: "JIO_NULL", value: 1)
!85 = !DIEnumerator(name: "JIO_FILE", value: 2)
!86 = !DIEnumerator(name: "JIO_BUFFER", value: 3)
!87 = !DIEnumerator(name: "JIO_OUT", value: 4)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 13, size: 32, elements: !90)
!89 = !DIFile(filename: "./alloc.h", directory: "/home/sahil/vim/src")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!91 = !DIEnumerator(name: "aid_none", value: 0)
!92 = !DIEnumerator(name: "aid_qf_dirname_start", value: 1)
!93 = !DIEnumerator(name: "aid_qf_dirname_now", value: 2)
!94 = !DIEnumerator(name: "aid_qf_namebuf", value: 3)
!95 = !DIEnumerator(name: "aid_qf_module", value: 4)
!96 = !DIEnumerator(name: "aid_qf_errmsg", value: 5)
!97 = !DIEnumerator(name: "aid_qf_pattern", value: 6)
!98 = !DIEnumerator(name: "aid_tagstack_items", value: 7)
!99 = !DIEnumerator(name: "aid_tagstack_from", value: 8)
!100 = !DIEnumerator(name: "aid_tagstack_details", value: 9)
!101 = !DIEnumerator(name: "aid_sign_getdefined", value: 10)
!102 = !DIEnumerator(name: "aid_sign_getplaced", value: 11)
!103 = !DIEnumerator(name: "aid_sign_define_by_name", value: 12)
!104 = !DIEnumerator(name: "aid_sign_getlist", value: 13)
!105 = !DIEnumerator(name: "aid_sign_getplaced_dict", value: 14)
!106 = !DIEnumerator(name: "aid_sign_getplaced_list", value: 15)
!107 = !DIEnumerator(name: "aid_insert_sign", value: 16)
!108 = !DIEnumerator(name: "aid_sign_getinfo", value: 17)
!109 = !DIEnumerator(name: "aid_last", value: 18)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1572, size: 32, elements: !111)
!111 = !{!112, !113, !114, !115}
!112 = !DIEnumerator(name: "GETLINE_NONE", value: 0)
!113 = !DIEnumerator(name: "GETLINE_CONCAT_CONT", value: 1)
!114 = !DIEnumerator(name: "GETLINE_CONCAT_CONTBAR", value: 2)
!115 = !DIEnumerator(name: "GETLINE_CONCAT_ALL", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1979, size: 32, elements: !117)
!117 = !{!118, !119, !120}
!118 = !DIEnumerator(name: "FILTERMAP_FILTER", value: 0)
!119 = !DIEnumerator(name: "FILTERMAP_MAP", value: 1)
!120 = !DIEnumerator(name: "FILTERMAP_MAPNEW", value: 2)
!121 = !{!122, !123, !128, !258, !1738, !165, !152, !1800, !1806, !1701, !1807, !1759}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !6, line: 1346, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !6, line: 1471, size: 768, elements: !126)
!126 = !{!127, !1769, !1776, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !125, file: !6, line: 1473, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !6, line: 1446, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !6, line: 1448, size: 256, elements: !131)
!131 = !{!132, !133, !134}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !130, file: !6, line: 1450, baseType: !128, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !130, file: !6, line: 1451, baseType: !128, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !130, file: !6, line: 1452, baseType: !135, size: 128, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !6, line: 1432, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1412, size: 128, elements: !137)
!137 = !{!138, !140, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !136, file: !6, line: 1414, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !6, line: 1391, baseType: !5)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !136, file: !6, line: 1415, baseType: !141, size: 8, offset: 32)
!141 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !136, file: !6, line: 1431, baseType: !143, size: 64, offset: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !6, line: 1416, size: 64, elements: !144)
!144 = !{!145, !148, !151, !156, !157, !207, !359, !1760, !1761}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !143, file: !6, line: 1418, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !6, line: 1327, baseType: !147)
!147 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !143, file: !6, line: 1420, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !6, line: 1344, baseType: !150)
!150 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !143, file: !6, line: 1422, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !154, line: 324, baseType: !155)
!154 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !143, file: !6, line: 1423, baseType: !123, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !143, file: !6, line: 1424, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !6, line: 1347, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !6, line: 1545, size: 2816, elements: !161)
!161 = !{!162, !163, !164, !166, !167, !190, !204, !205, !206}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !160, file: !6, line: 1547, baseType: !141, size: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !160, file: !6, line: 1548, baseType: !141, size: 8, offset: 8)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !160, file: !6, line: 1549, baseType: !165, size: 32, offset: 32)
!165 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !160, file: !6, line: 1550, baseType: !165, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !160, file: !6, line: 1551, baseType: !168, size: 2432, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !6, line: 1290, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !6, line: 1277, size: 2432, elements: !170)
!170 = !{!171, !174, !175, !176, !177, !178, !179, !186}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !169, file: !6, line: 1279, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !154, line: 345, baseType: !173)
!173 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !169, file: !6, line: 1281, baseType: !172, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !169, file: !6, line: 1282, baseType: !172, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !169, file: !6, line: 1283, baseType: !165, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !169, file: !6, line: 1284, baseType: !165, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !169, file: !6, line: 1285, baseType: !165, size: 32, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !169, file: !6, line: 1287, baseType: !180, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !6, line: 1265, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !6, line: 1261, size: 128, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !182, file: !6, line: 1263, baseType: !172, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !182, file: !6, line: 1264, baseType: !152, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !169, file: !6, line: 1289, baseType: !187, size: 2048, offset: 384)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 2048, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 16)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !160, file: !6, line: 1552, baseType: !191, size: 64, offset: 2560)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !6, line: 1394, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !6, line: 1395, size: 192, elements: !194)
!194 = !{!195, !196, !199, !200, !201, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !193, file: !6, line: 1396, baseType: !139, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !193, file: !6, line: 1397, baseType: !197, size: 8, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !6, line: 1342, baseType: !198)
!198 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !193, file: !6, line: 1398, baseType: !141, size: 8, offset: 40)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !193, file: !6, line: 1399, baseType: !141, size: 8, offset: 48)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !193, file: !6, line: 1400, baseType: !191, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !193, file: !6, line: 1401, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !160, file: !6, line: 1553, baseType: !158, size: 64, offset: 2624)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !160, file: !6, line: 1554, baseType: !158, size: 64, offset: 2688)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !160, file: !6, line: 1555, baseType: !158, size: 64, offset: 2752)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !143, file: !6, line: 1425, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !6, line: 1348, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !6, line: 1994, size: 832, elements: !211)
!211 = !{!212, !213, !214, !334, !335, !345, !355, !356, !357, !358}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !210, file: !6, line: 1996, baseType: !165, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !210, file: !6, line: 1997, baseType: !152, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !210, file: !6, line: 1999, baseType: !215, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !6, line: 1658, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1597, size: 3072, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !225, !226, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !246, !247, !248, !249, !250, !261, !262, !263, !264, !266, !267, !268, !269, !270, !271, !272, !282, !283, !284, !329, !330}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !217, file: !6, line: 1599, baseType: !165, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !217, file: !6, line: 1600, baseType: !165, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !217, file: !6, line: 1601, baseType: !165, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !217, file: !6, line: 1602, baseType: !165, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !217, file: !6, line: 1603, baseType: !224, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !6, line: 1591, baseType: !23)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !217, file: !6, line: 1604, baseType: !165, size: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !217, file: !6, line: 1605, baseType: !227, size: 192, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !6, line: 55, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !6, line: 48, size: 192, elements: !229)
!229 = !{!230, !231, !232, !233, !234}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !228, file: !6, line: 50, baseType: !165, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !228, file: !6, line: 51, baseType: !165, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !228, file: !6, line: 52, baseType: !165, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !228, file: !6, line: 53, baseType: !165, size: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !228, file: !6, line: 54, baseType: !122, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !217, file: !6, line: 1606, baseType: !227, size: 192, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !217, file: !6, line: 1609, baseType: !203, size: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !217, file: !6, line: 1610, baseType: !191, size: 64, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !217, file: !6, line: 1611, baseType: !227, size: 192, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !217, file: !6, line: 1612, baseType: !208, size: 64, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !217, file: !6, line: 1615, baseType: !152, size: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !217, file: !6, line: 1616, baseType: !191, size: 64, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !217, file: !6, line: 1617, baseType: !191, size: 64, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !217, file: !6, line: 1618, baseType: !165, size: 32, offset: 1152)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !217, file: !6, line: 1619, baseType: !245, size: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !217, file: !6, line: 1626, baseType: !227, size: 192, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !217, file: !6, line: 1628, baseType: !165, size: 32, offset: 1472)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !217, file: !6, line: 1629, baseType: !165, size: 32, offset: 1504)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !217, file: !6, line: 1631, baseType: !165, size: 32, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !217, file: !6, line: 1632, baseType: !251, size: 128, offset: 1600)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !154, line: 1786, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !253, line: 8, size: 128, elements: !254)
!253 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!254 = !{!255, !259}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !252, file: !253, line: 10, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !257, line: 160, baseType: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!258 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !252, file: !253, line: 11, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !257, line: 162, baseType: !258)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !217, file: !6, line: 1633, baseType: !251, size: 128, offset: 1728)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !217, file: !6, line: 1634, baseType: !251, size: 128, offset: 1856)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !217, file: !6, line: 1636, baseType: !245, size: 64, offset: 1984)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !217, file: !6, line: 1637, baseType: !265, size: 64, offset: 2048)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !217, file: !6, line: 1638, baseType: !265, size: 64, offset: 2112)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !217, file: !6, line: 1639, baseType: !251, size: 128, offset: 2176)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !217, file: !6, line: 1640, baseType: !251, size: 128, offset: 2304)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !217, file: !6, line: 1641, baseType: !251, size: 128, offset: 2432)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !217, file: !6, line: 1642, baseType: !165, size: 32, offset: 2560)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !217, file: !6, line: 1643, baseType: !165, size: 32, offset: 2592)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !217, file: !6, line: 1645, baseType: !273, size: 192, offset: 2624)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !6, line: 92, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 85, size: 192, elements: !275)
!275 = !{!276, !278, !279, !281}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !274, file: !6, line: 87, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !6, line: 62, baseType: !165)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !274, file: !6, line: 88, baseType: !165, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !274, file: !6, line: 89, baseType: !280, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !154, line: 1687, baseType: !258)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !274, file: !6, line: 91, baseType: !165, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !217, file: !6, line: 1648, baseType: !165, size: 32, offset: 2816)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !217, file: !6, line: 1649, baseType: !165, size: 32, offset: 2848)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !217, file: !6, line: 1651, baseType: !285, size: 64, offset: 2880)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !6, line: 1582, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !6, line: 1682, size: 17280, elements: !288)
!288 = !{!289, !290, !291, !292, !312, !313, !314, !315, !316, !317, !319, !321, !322, !323, !324, !325, !326, !327, !328}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !287, file: !6, line: 1684, baseType: !215, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !287, file: !6, line: 1685, baseType: !165, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !287, file: !6, line: 1686, baseType: !165, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !287, file: !6, line: 1691, baseType: !293, size: 4608, offset: 128)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 4608, elements: !310)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !6, line: 1687, size: 384, elements: !295)
!295 = !{!296, !306}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !294, file: !6, line: 1689, baseType: !297, size: 192)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !6, line: 1519, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !6, line: 1513, size: 192, elements: !299)
!299 = !{!300, !301, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !298, file: !6, line: 1515, baseType: !135, size: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !298, file: !6, line: 1516, baseType: !153, size: 8, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !298, file: !6, line: 1517, baseType: !303, size: 8, offset: 136)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 8, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 1)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "room", scope: !294, file: !6, line: 1690, baseType: !307, size: 160, offset: 192)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 160, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 20)
!310 = !{!311}
!311 = !DISubrange(count: 12)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars", scope: !287, file: !6, line: 1692, baseType: !159, size: 2816, offset: 4736)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars_var", scope: !287, file: !6, line: 1693, baseType: !297, size: 192, offset: 7552)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars", scope: !287, file: !6, line: 1694, baseType: !159, size: 2816, offset: 7744)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars_var", scope: !287, file: !6, line: 1695, baseType: !297, size: 192, offset: 10560)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "l_varlist", scope: !287, file: !6, line: 1696, baseType: !124, size: 768, offset: 10752)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "l_listitems", scope: !287, file: !6, line: 1697, baseType: !318, size: 5120, offset: 11520)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 5120, elements: !308)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rettv", scope: !287, file: !6, line: 1698, baseType: !320, size: 64, offset: 16640)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !287, file: !6, line: 1699, baseType: !280, size: 64, offset: 16704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dbg_tick", scope: !287, file: !6, line: 1700, baseType: !165, size: 32, offset: 16768)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !287, file: !6, line: 1701, baseType: !165, size: 32, offset: 16800)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "prof_child", scope: !287, file: !6, line: 1703, baseType: !251, size: 128, offset: 16832)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !287, file: !6, line: 1705, baseType: !285, size: 64, offset: 16960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "fc_refcount", scope: !287, file: !6, line: 1709, baseType: !165, size: 32, offset: 17024)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fc_copyID", scope: !287, file: !6, line: 1711, baseType: !165, size: 32, offset: 17056)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fc_funcs", scope: !287, file: !6, line: 1712, baseType: !227, size: 192, offset: 17088)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name_exp", scope: !217, file: !6, line: 1653, baseType: !152, size: 64, offset: 2944)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name", scope: !217, file: !6, line: 1655, baseType: !331, size: 32, offset: 3008)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 32, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 4)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pt_auto", scope: !210, file: !6, line: 2001, baseType: !165, size: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pt_outer", scope: !210, file: !6, line: 2005, baseType: !336, size: 256, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "outer_T", file: !6, line: 1986, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_S", file: !6, line: 1987, size: 256, elements: !338)
!338 = !{!339, !341, !342, !344}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "out_stack", scope: !337, file: !6, line: 1988, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame_idx", scope: !337, file: !6, line: 1989, baseType: !165, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "out_up", scope: !337, file: !6, line: 1990, baseType: !343, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "out_up_is_copy", scope: !337, file: !6, line: 1991, baseType: !165, size: 32, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pt_funcstack", scope: !210, file: !6, line: 2007, baseType: !346, size: 64, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "funcstack_T", file: !6, line: 1984, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcstack_S", file: !6, line: 1972, size: 320, elements: !349)
!349 = !{!350, !351, !352, !353, !354}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ga", scope: !348, file: !6, line: 1974, baseType: !227, size: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "fs_var_offset", scope: !348, file: !6, line: 1978, baseType: !165, size: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fs_refcount", scope: !348, file: !6, line: 1981, baseType: !165, size: 32, offset: 224)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fs_min_refcount", scope: !348, file: !6, line: 1982, baseType: !165, size: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fs_copyID", scope: !348, file: !6, line: 1983, baseType: !165, size: 32, offset: 288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argc", scope: !210, file: !6, line: 2010, baseType: !165, size: 32, offset: 576)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argv", scope: !210, file: !6, line: 2011, baseType: !320, size: 64, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pt_dict", scope: !210, file: !6, line: 2013, baseType: !158, size: 64, offset: 704)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pt_copyID", scope: !210, file: !6, line: 2014, baseType: !165, size: 32, offset: 768)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !143, file: !6, line: 1427, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !6, line: 1365, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !6, line: 2072, size: 1024, elements: !363)
!363 = !{!364, !365, !366, !370, !371, !372, !374, !375, !376, !377, !384, !1657, !1658, !1659, !1758}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !362, file: !6, line: 2074, baseType: !360, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !362, file: !6, line: 2075, baseType: !360, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !362, file: !6, line: 2077, baseType: !367, size: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !368, line: 97, baseType: !369)
!368 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !257, line: 154, baseType: !165)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !362, file: !6, line: 2083, baseType: !152, size: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !362, file: !6, line: 2084, baseType: !152, size: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !362, file: !6, line: 2085, baseType: !373, size: 32, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !6, line: 2067, baseType: !30)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !362, file: !6, line: 2086, baseType: !152, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !362, file: !6, line: 2088, baseType: !152, size: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !362, file: !6, line: 2093, baseType: !165, size: 32, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !362, file: !6, line: 2094, baseType: !378, size: 192, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !6, line: 1360, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1356, size: 192, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !379, file: !6, line: 1357, baseType: !152, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !379, file: !6, line: 1358, baseType: !208, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !379, file: !6, line: 1359, baseType: !165, size: 32, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !362, file: !6, line: 2096, baseType: !385, size: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !6, line: 63, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !6, line: 2629, size: 73152, elements: !388)
!388 = !{!389, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !498, !501, !502, !506, !507, !517, !518, !519, !520, !521, !522, !523, !524, !1330, !1331, !1332, !1337, !1338, !1339, !1343, !1351, !1352, !1353, !1354, !1355, !1357, !1358, !1359, !1360, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1604, !1605, !1606, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1640, !1641, !1642, !1643, !1644, !1651, !1652, !1656}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !387, file: !6, line: 2631, baseType: !390, size: 832)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !6, line: 766, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !6, line: 737, size: 832, elements: !392)
!392 = !{!393, !394, !456, !465, !466, !467, !468, !470, !471, !472, !473, !474, !475, !476, !483, !484}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !391, file: !6, line: 739, baseType: !280, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !391, file: !6, line: 741, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !6, line: 459, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !6, line: 671, size: 9856, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !423, !424, !425, !427, !428, !441, !442, !443, !444, !445, !446, !447, !448, !449, !453, !454, !455}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !397, file: !6, line: 673, baseType: !152, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !397, file: !6, line: 674, baseType: !152, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !397, file: !6, line: 675, baseType: !165, size: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !397, file: !6, line: 676, baseType: !165, size: 32, offset: 160)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !397, file: !6, line: 677, baseType: !165, size: 32, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !397, file: !6, line: 678, baseType: !405, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !6, line: 458, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !6, line: 506, size: 448, elements: !408)
!408 = !{!409, !418, !419, !420, !421, !422}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !407, file: !6, line: 508, baseType: !410, size: 192)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !6, line: 469, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !6, line: 471, size: 192, elements: !412)
!412 = !{!413, !415, !416}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !411, file: !6, line: 473, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !411, file: !6, line: 474, baseType: !414, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !411, file: !6, line: 475, baseType: !417, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !6, line: 460, baseType: !258)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !407, file: !6, line: 511, baseType: !405, size: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !407, file: !6, line: 512, baseType: !405, size: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !407, file: !6, line: 513, baseType: !152, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !407, file: !6, line: 514, baseType: !165, size: 32, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !407, file: !6, line: 518, baseType: !141, size: 8, offset: 416)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !397, file: !6, line: 679, baseType: !405, size: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !397, file: !6, line: 680, baseType: !405, size: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !397, file: !6, line: 681, baseType: !426, size: 32, offset: 448)
!426 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !397, file: !6, line: 682, baseType: !426, size: 32, offset: 480)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !397, file: !6, line: 683, baseType: !429, size: 4352, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !6, line: 489, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !6, line: 480, size: 4352, elements: !431)
!431 = !{!432, !433, !434, !436, !440}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !430, file: !6, line: 482, baseType: !172, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !430, file: !6, line: 484, baseType: !172, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !430, file: !6, line: 485, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !430, file: !6, line: 487, baseType: !437, size: 4096, offset: 192)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 4096, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !430, file: !6, line: 488, baseType: !141, size: 8, offset: 4288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !397, file: !6, line: 684, baseType: !429, size: 4352, offset: 4864)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !397, file: !6, line: 685, baseType: !417, size: 64, offset: 9216)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !397, file: !6, line: 686, baseType: !417, size: 64, offset: 9280)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !397, file: !6, line: 687, baseType: !417, size: 64, offset: 9344)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !397, file: !6, line: 688, baseType: !417, size: 64, offset: 9408)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !397, file: !6, line: 689, baseType: !426, size: 32, offset: 9472)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !397, file: !6, line: 690, baseType: !165, size: 32, offset: 9504)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !397, file: !6, line: 692, baseType: !385, size: 64, offset: 9536)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !397, file: !6, line: 693, baseType: !450, size: 64, offset: 9600)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 8)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !397, file: !6, line: 697, baseType: !152, size: 64, offset: 9664)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !397, file: !6, line: 698, baseType: !165, size: 32, offset: 9728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !397, file: !6, line: 699, baseType: !450, size: 64, offset: 9760)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !391, file: !6, line: 743, baseType: !457, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !6, line: 717, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !6, line: 711, size: 256, elements: !460)
!460 = !{!461, !462, !463, !464}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !459, file: !6, line: 713, baseType: !417, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !459, file: !6, line: 714, baseType: !280, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !459, file: !6, line: 715, baseType: !280, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !459, file: !6, line: 716, baseType: !165, size: 32, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !391, file: !6, line: 744, baseType: !165, size: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !391, file: !6, line: 745, baseType: !165, size: 32, offset: 224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !391, file: !6, line: 751, baseType: !165, size: 32, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !391, file: !6, line: 753, baseType: !469, size: 32, offset: 288)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !154, line: 1688, baseType: !165)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !391, file: !6, line: 754, baseType: !280, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !391, file: !6, line: 755, baseType: !152, size: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !391, file: !6, line: 757, baseType: !405, size: 64, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !391, file: !6, line: 758, baseType: !280, size: 64, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !391, file: !6, line: 759, baseType: !280, size: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !391, file: !6, line: 760, baseType: !165, size: 32, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !391, file: !6, line: 762, baseType: !477, size: 64, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !6, line: 724, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !6, line: 720, size: 128, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !479, file: !6, line: 722, baseType: !165, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !479, file: !6, line: 723, baseType: !258, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !391, file: !6, line: 763, baseType: !165, size: 32, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !391, file: !6, line: 764, baseType: !165, size: 32, offset: 800)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !387, file: !6, line: 2634, baseType: !385, size: 64, offset: 832)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !387, file: !6, line: 2635, baseType: !385, size: 64, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !387, file: !6, line: 2637, baseType: !165, size: 32, offset: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !387, file: !6, line: 2639, baseType: !165, size: 32, offset: 992)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !387, file: !6, line: 2640, baseType: !165, size: 32, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !387, file: !6, line: 2642, baseType: !165, size: 32, offset: 1056)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !387, file: !6, line: 2651, baseType: !152, size: 64, offset: 1088)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !387, file: !6, line: 2652, baseType: !152, size: 64, offset: 1152)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !387, file: !6, line: 2654, baseType: !152, size: 64, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !387, file: !6, line: 2658, baseType: !165, size: 32, offset: 1280)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !387, file: !6, line: 2659, baseType: !496, size: 64, offset: 1344)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !368, line: 59, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !257, line: 145, baseType: !173)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !387, file: !6, line: 2660, baseType: !499, size: 64, offset: 1408)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !368, line: 47, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !257, line: 148, baseType: !173)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !387, file: !6, line: 2667, baseType: !165, size: 32, offset: 1472)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !387, file: !6, line: 2668, baseType: !503, size: 72, offset: 1504)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 72, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 9)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !387, file: !6, line: 2672, baseType: !165, size: 32, offset: 1600)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !387, file: !6, line: 2674, baseType: !508, size: 320, offset: 1664)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !6, line: 1532, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !6, line: 1526, size: 320, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !509, file: !6, line: 1528, baseType: !135, size: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !509, file: !6, line: 1529, baseType: !153, size: 8, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !509, file: !6, line: 1530, baseType: !514, size: 136, offset: 136)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 136, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 17)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !387, file: !6, line: 2679, baseType: !146, size: 64, offset: 1984)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !387, file: !6, line: 2681, baseType: !146, size: 64, offset: 2048)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !387, file: !6, line: 2684, baseType: !165, size: 32, offset: 2112)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !387, file: !6, line: 2691, baseType: !165, size: 32, offset: 2144)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !387, file: !6, line: 2693, baseType: !280, size: 64, offset: 2176)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !387, file: !6, line: 2694, baseType: !280, size: 64, offset: 2240)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !387, file: !6, line: 2696, baseType: !258, size: 64, offset: 2304)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !387, file: !6, line: 2699, baseType: !525, size: 64, offset: 2368)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !6, line: 60, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !6, line: 325, size: 11648, elements: !528)
!528 = !{!529, !530, !531, !1325, !1326, !1327, !1328, !1329}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !527, file: !6, line: 327, baseType: !525, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !527, file: !6, line: 328, baseType: !525, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !527, file: !6, line: 329, baseType: !532, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !6, line: 59, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !6, line: 3365, size: 72064, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !695, !696, !711, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !768, !769, !770, !771, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !792, !793, !795, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !816, !817, !818, !819, !820, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !880, !881, !882, !883, !884, !1137, !1145, !1146, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1238, !1239, !1240, !1241, !1282, !1283, !1293, !1294, !1295, !1296, !1297, !1317, !1318, !1319, !1320, !1324}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !534, file: !6, line: 3367, baseType: !165, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !534, file: !6, line: 3369, baseType: !385, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !534, file: !6, line: 3371, baseType: !532, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !534, file: !6, line: 3372, baseType: !532, size: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !534, file: !6, line: 3375, baseType: !541, size: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !6, line: 2618, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2542, size: 9920, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !560, !561, !562, !563, !564, !622, !630, !631, !632, !633, !634, !671, !672, !673, !674, !675, !676, !678, !679, !683, !684, !685, !686, !687, !688, !689, !690, !694}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !543, file: !6, line: 2544, baseType: !168, size: 2432)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !543, file: !6, line: 2545, baseType: !168, size: 2432, offset: 2432)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !543, file: !6, line: 2546, baseType: !165, size: 32, offset: 4864)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !543, file: !6, line: 2548, baseType: !165, size: 32, offset: 4896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !543, file: !6, line: 2550, baseType: !165, size: 32, offset: 4928)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !543, file: !6, line: 2551, baseType: !165, size: 32, offset: 4960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !543, file: !6, line: 2552, baseType: !165, size: 32, offset: 4992)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !543, file: !6, line: 2553, baseType: !227, size: 192, offset: 5056)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !543, file: !6, line: 2554, baseType: !227, size: 192, offset: 5248)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !543, file: !6, line: 2555, baseType: !165, size: 32, offset: 5440)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !543, file: !6, line: 2556, baseType: !165, size: 32, offset: 5472)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !543, file: !6, line: 2557, baseType: !165, size: 32, offset: 5504)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !543, file: !6, line: 2559, baseType: !165, size: 32, offset: 5536)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !543, file: !6, line: 2560, baseType: !559, size: 16, offset: 5568)
!559 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !543, file: !6, line: 2561, baseType: !258, size: 64, offset: 5632)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !543, file: !6, line: 2562, baseType: !258, size: 64, offset: 5696)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !543, file: !6, line: 2563, baseType: !258, size: 64, offset: 5760)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !543, file: !6, line: 2564, baseType: !152, size: 64, offset: 5824)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !543, file: !6, line: 2565, baseType: !565, size: 64, offset: 5888)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !567, line: 56, baseType: !568)
!567 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !567, line: 49, size: 192, elements: !569)
!569 = !{!570, !618, !619, !620, !621}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !568, file: !567, line: 51, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !567, line: 42, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !567, line: 167, size: 320, elements: !574)
!574 = !{!575, !579, !583, !598, !617}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !573, file: !567, line: 169, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!565, !152, !165}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !573, file: !567, line: 170, baseType: !580, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !565}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !573, file: !567, line: 171, baseType: !584, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!165, !587, !152, !469, !165}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !567, line: 137, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 131, size: 1408, elements: !590)
!590 = !{!591, !592, !596, !597}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !589, file: !567, line: 133, baseType: !565, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !589, file: !567, line: 134, baseType: !593, size: 640, offset: 64)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 640, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 10)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !589, file: !567, line: 135, baseType: !593, size: 640, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !589, file: !567, line: 136, baseType: !165, size: 32, offset: 1344)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !573, file: !567, line: 172, baseType: !599, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!258, !602, !532, !385, !280, !469, !265, !245}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !567, line: 154, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 147, size: 2688, elements: !605)
!605 = !{!606, !607, !614, !615, !616}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !604, file: !567, line: 149, baseType: !565, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !604, file: !567, line: 150, baseType: !608, size: 1280, offset: 64)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 1280, elements: !594)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !6, line: 41, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 37, size: 128, elements: !611)
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !610, file: !6, line: 39, baseType: !280, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !610, file: !6, line: 40, baseType: !469, size: 32, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !604, file: !567, line: 151, baseType: !608, size: 1280, offset: 1344)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !604, file: !567, line: 152, baseType: !165, size: 32, offset: 2624)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !604, file: !567, line: 153, baseType: !469, size: 32, offset: 2656)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !573, file: !567, line: 173, baseType: !152, size: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !568, file: !567, line: 52, baseType: !426, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !568, file: !567, line: 53, baseType: !426, size: 32, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !568, file: !567, line: 54, baseType: !426, size: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !568, file: !567, line: 55, baseType: !165, size: 32, offset: 160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !543, file: !6, line: 2567, baseType: !623, size: 384, offset: 5952)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !6, line: 2475, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2470, size: 384, elements: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !624, file: !6, line: 2471, baseType: !251, size: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !624, file: !6, line: 2472, baseType: !251, size: 128, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !624, file: !6, line: 2473, baseType: !258, size: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !624, file: !6, line: 2474, baseType: !258, size: 64, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !543, file: !6, line: 2569, baseType: !165, size: 32, offset: 6336)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !543, file: !6, line: 2570, baseType: !165, size: 32, offset: 6368)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !543, file: !6, line: 2572, baseType: !165, size: 32, offset: 6400)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !543, file: !6, line: 2575, baseType: !165, size: 32, offset: 6432)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !543, file: !6, line: 2592, baseType: !635, size: 64, offset: 6464)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !6, line: 1061, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !6, line: 1063, size: 1728, elements: !638)
!638 = !{!639, !640, !641, !663, !664, !665, !667, !670}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !637, file: !6, line: 1065, baseType: !635, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !637, file: !6, line: 1066, baseType: !280, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !637, file: !6, line: 1071, baseType: !642, size: 1344, offset: 128)
!642 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !637, file: !6, line: 1067, size: 1344, elements: !643)
!643 = !{!644, !662}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !642, file: !6, line: 1069, baseType: !645, size: 1344)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 1344, elements: !660)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !6, line: 1055, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !6, line: 1046, size: 192, elements: !648)
!648 = !{!649, !650, !651, !652, !653}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !647, file: !6, line: 1048, baseType: !165, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !647, file: !6, line: 1049, baseType: !165, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !647, file: !6, line: 1051, baseType: !165, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !647, file: !6, line: 1052, baseType: !165, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !647, file: !6, line: 1054, baseType: !654, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !567, line: 165, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 161, size: 704, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !656, file: !567, line: 163, baseType: !559, size: 16)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !656, file: !567, line: 164, baseType: !593, size: 640, offset: 64)
!660 = !{!661}
!661 = !DISubrange(count: 7)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !642, file: !6, line: 1070, baseType: !227, size: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !637, file: !6, line: 1072, baseType: !165, size: 32, offset: 1472)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !637, file: !6, line: 1073, baseType: !165, size: 32, offset: 1504)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !637, file: !6, line: 1074, baseType: !666, size: 64, offset: 1536)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !637, file: !6, line: 1076, baseType: !668, size: 16, offset: 1600)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !154, line: 1689, baseType: !669)
!669 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !637, file: !6, line: 1077, baseType: !280, size: 64, offset: 1664)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !543, file: !6, line: 2593, baseType: !165, size: 32, offset: 6528)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !543, file: !6, line: 2594, baseType: !635, size: 64, offset: 6592)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !543, file: !6, line: 2595, baseType: !635, size: 64, offset: 6656)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !543, file: !6, line: 2596, baseType: !165, size: 32, offset: 6720)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !543, file: !6, line: 2597, baseType: !280, size: 64, offset: 6784)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !543, file: !6, line: 2598, baseType: !677, size: 16, offset: 6848)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !154, line: 325, baseType: !669)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !543, file: !6, line: 2603, baseType: !227, size: 192, offset: 6912)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !543, file: !6, line: 2604, baseType: !680, size: 2048, offset: 7104)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 2048, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !543, file: !6, line: 2605, baseType: !152, size: 64, offset: 9152)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !543, file: !6, line: 2606, baseType: !152, size: 64, offset: 9216)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !543, file: !6, line: 2607, baseType: !565, size: 64, offset: 9280)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !543, file: !6, line: 2608, baseType: !152, size: 64, offset: 9344)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !543, file: !6, line: 2609, baseType: !152, size: 64, offset: 9408)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !543, file: !6, line: 2610, baseType: !152, size: 64, offset: 9472)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !543, file: !6, line: 2611, baseType: !165, size: 32, offset: 9536)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !543, file: !6, line: 2616, baseType: !691, size: 256, offset: 9568)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 256, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !543, file: !6, line: 2617, baseType: !152, size: 64, offset: 9856)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !534, file: !6, line: 3378, baseType: !165, size: 32, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !534, file: !6, line: 3381, baseType: !697, size: 64, offset: 384)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !6, line: 61, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !6, line: 3231, size: 512, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !699, file: !6, line: 3233, baseType: !141, size: 8)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !699, file: !6, line: 3234, baseType: !165, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !699, file: !6, line: 3235, baseType: !165, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !699, file: !6, line: 3236, baseType: !165, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !699, file: !6, line: 3237, baseType: !165, size: 32, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !699, file: !6, line: 3238, baseType: !697, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !699, file: !6, line: 3239, baseType: !697, size: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !699, file: !6, line: 3241, baseType: !697, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !699, file: !6, line: 3244, baseType: !697, size: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !699, file: !6, line: 3245, baseType: !532, size: 64, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !534, file: !6, line: 3383, baseType: !712, size: 128, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !6, line: 31, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 26, size: 128, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !713, file: !6, line: 28, baseType: !280, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !713, file: !6, line: 29, baseType: !469, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !713, file: !6, line: 30, baseType: !469, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !534, file: !6, line: 3385, baseType: !469, size: 32, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !534, file: !6, line: 3389, baseType: !165, size: 32, offset: 608)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !534, file: !6, line: 3394, baseType: !280, size: 64, offset: 640)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !534, file: !6, line: 3400, baseType: !141, size: 8, offset: 704)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !534, file: !6, line: 3401, baseType: !280, size: 64, offset: 768)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !534, file: !6, line: 3402, baseType: !469, size: 32, offset: 832)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !534, file: !6, line: 3403, baseType: !469, size: 32, offset: 864)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !534, file: !6, line: 3404, baseType: !280, size: 64, offset: 896)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !534, file: !6, line: 3405, baseType: !469, size: 32, offset: 960)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !534, file: !6, line: 3406, baseType: !469, size: 32, offset: 992)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !534, file: !6, line: 3408, baseType: !729, size: 352, offset: 1024)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !6, line: 3358, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3343, size: 352, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !730, file: !6, line: 3345, baseType: !165, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !730, file: !6, line: 3346, baseType: !165, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !730, file: !6, line: 3347, baseType: !165, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !730, file: !6, line: 3348, baseType: !165, size: 32, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !730, file: !6, line: 3349, baseType: !165, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !730, file: !6, line: 3350, baseType: !165, size: 32, offset: 160)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !730, file: !6, line: 3351, baseType: !165, size: 32, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !730, file: !6, line: 3352, baseType: !165, size: 32, offset: 224)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !730, file: !6, line: 3353, baseType: !165, size: 32, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !730, file: !6, line: 3354, baseType: !165, size: 32, offset: 288)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !730, file: !6, line: 3356, baseType: !165, size: 32, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !534, file: !6, line: 3414, baseType: !280, size: 64, offset: 1408)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !534, file: !6, line: 3416, baseType: !141, size: 8, offset: 1472)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !534, file: !6, line: 3419, baseType: !280, size: 64, offset: 1536)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !534, file: !6, line: 3423, baseType: !165, size: 32, offset: 1600)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !534, file: !6, line: 3424, baseType: !165, size: 32, offset: 1632)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !534, file: !6, line: 3425, baseType: !165, size: 32, offset: 1664)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !534, file: !6, line: 3427, baseType: !165, size: 32, offset: 1696)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !534, file: !6, line: 3429, baseType: !469, size: 32, offset: 1728)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !534, file: !6, line: 3432, baseType: !469, size: 32, offset: 1760)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !534, file: !6, line: 3435, baseType: !165, size: 32, offset: 1792)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !534, file: !6, line: 3437, baseType: !165, size: 32, offset: 1824)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !534, file: !6, line: 3445, baseType: !165, size: 32, offset: 1856)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !534, file: !6, line: 3446, baseType: !165, size: 32, offset: 1888)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !534, file: !6, line: 3449, baseType: !165, size: 32, offset: 1920)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !534, file: !6, line: 3450, baseType: !165, size: 32, offset: 1952)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !534, file: !6, line: 3451, baseType: !165, size: 32, offset: 1984)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !534, file: !6, line: 3452, baseType: !165, size: 32, offset: 2016)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !534, file: !6, line: 3454, baseType: !761, size: 320, offset: 2048)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !6, line: 3330, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3324, size: 320, elements: !763)
!763 = !{!764, !765, !766, !767}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !762, file: !6, line: 3326, baseType: !165, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !762, file: !6, line: 3327, baseType: !165, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !762, file: !6, line: 3328, baseType: !712, size: 128, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !762, file: !6, line: 3329, baseType: !712, size: 128, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !534, file: !6, line: 3457, baseType: !165, size: 32, offset: 2368)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !534, file: !6, line: 3458, baseType: !165, size: 32, offset: 2400)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !534, file: !6, line: 3459, baseType: !152, size: 64, offset: 2432)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !534, file: !6, line: 3460, baseType: !772, size: 32, offset: 2496)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !6, line: 2524, baseType: !36)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !534, file: !6, line: 3461, baseType: !165, size: 32, offset: 2528)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !534, file: !6, line: 3462, baseType: !165, size: 32, offset: 2560)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !534, file: !6, line: 3463, baseType: !532, size: 64, offset: 2624)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !534, file: !6, line: 3464, baseType: !165, size: 32, offset: 2688)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !534, file: !6, line: 3465, baseType: !165, size: 32, offset: 2720)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !534, file: !6, line: 3466, baseType: !165, size: 32, offset: 2752)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !534, file: !6, line: 3467, baseType: !165, size: 32, offset: 2784)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !534, file: !6, line: 3468, baseType: !165, size: 32, offset: 2816)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !534, file: !6, line: 3469, baseType: !165, size: 32, offset: 2848)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !534, file: !6, line: 3470, baseType: !165, size: 32, offset: 2880)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !534, file: !6, line: 3471, baseType: !165, size: 32, offset: 2912)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !534, file: !6, line: 3472, baseType: !165, size: 32, offset: 2944)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !534, file: !6, line: 3473, baseType: !165, size: 32, offset: 2976)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !534, file: !6, line: 3474, baseType: !165, size: 32, offset: 3008)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !534, file: !6, line: 3475, baseType: !165, size: 32, offset: 3040)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !534, file: !6, line: 3476, baseType: !152, size: 64, offset: 3072)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !534, file: !6, line: 3477, baseType: !152, size: 64, offset: 3136)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !534, file: !6, line: 3478, baseType: !791, size: 128, offset: 3200)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 128, elements: !332)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !534, file: !6, line: 3479, baseType: !791, size: 128, offset: 3328)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !534, file: !6, line: 3480, baseType: !794, size: 256, offset: 3456)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 256, elements: !332)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !534, file: !6, line: 3481, baseType: !796, size: 256, offset: 3712)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 256, elements: !451)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !534, file: !6, line: 3483, baseType: !165, size: 32, offset: 3968)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !534, file: !6, line: 3484, baseType: !165, size: 32, offset: 4000)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !534, file: !6, line: 3485, baseType: !146, size: 64, offset: 4032)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !534, file: !6, line: 3487, baseType: !146, size: 64, offset: 4096)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !534, file: !6, line: 3490, baseType: !165, size: 32, offset: 4160)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !534, file: !6, line: 3493, baseType: !280, size: 64, offset: 4224)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !534, file: !6, line: 3495, baseType: !378, size: 192, offset: 4288)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !534, file: !6, line: 3496, baseType: !378, size: 192, offset: 4480)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !534, file: !6, line: 3497, baseType: !165, size: 32, offset: 4672)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !534, file: !6, line: 3498, baseType: !165, size: 32, offset: 4704)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !534, file: !6, line: 3500, baseType: !532, size: 64, offset: 4736)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !534, file: !6, line: 3501, baseType: !280, size: 64, offset: 4800)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !534, file: !6, line: 3502, baseType: !469, size: 32, offset: 4864)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !534, file: !6, line: 3503, baseType: !469, size: 32, offset: 4896)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !534, file: !6, line: 3504, baseType: !165, size: 32, offset: 4928)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !534, file: !6, line: 3505, baseType: !165, size: 32, offset: 4960)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !534, file: !6, line: 3506, baseType: !165, size: 32, offset: 4992)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !534, file: !6, line: 3507, baseType: !815, size: 32, offset: 5024)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !6, line: 2530, baseType: !44)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !534, file: !6, line: 3509, baseType: !123, size: 64, offset: 5056)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !534, file: !6, line: 3510, baseType: !152, size: 64, offset: 5120)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !534, file: !6, line: 3511, baseType: !165, size: 32, offset: 5184)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !534, file: !6, line: 3512, baseType: !165, size: 32, offset: 5216)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !534, file: !6, line: 3514, baseType: !821, size: 64, offset: 5248)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !6, line: 2478, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !6, line: 2479, size: 704, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !823, file: !6, line: 2481, baseType: !258, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !823, file: !6, line: 2483, baseType: !821, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !823, file: !6, line: 2484, baseType: !821, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !823, file: !6, line: 2485, baseType: !251, size: 128, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !823, file: !6, line: 2486, baseType: !141, size: 8, offset: 320)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !823, file: !6, line: 2487, baseType: !141, size: 8, offset: 328)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !823, file: !6, line: 2488, baseType: !165, size: 32, offset: 352)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !823, file: !6, line: 2489, baseType: !258, size: 64, offset: 384)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !823, file: !6, line: 2490, baseType: !378, size: 192, offset: 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !823, file: !6, line: 2491, baseType: !165, size: 32, offset: 640)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !534, file: !6, line: 3517, baseType: !165, size: 32, offset: 5312)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !534, file: !6, line: 3534, baseType: !165, size: 32, offset: 5344)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !534, file: !6, line: 3535, baseType: !712, size: 128, offset: 5376)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !534, file: !6, line: 3537, baseType: !469, size: 32, offset: 5504)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !534, file: !6, line: 3543, baseType: !165, size: 32, offset: 5536)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !534, file: !6, line: 3545, baseType: !165, size: 32, offset: 5568)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !534, file: !6, line: 3548, baseType: !165, size: 32, offset: 5600)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !534, file: !6, line: 3550, baseType: !469, size: 32, offset: 5632)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !534, file: !6, line: 3562, baseType: !165, size: 32, offset: 5664)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !534, file: !6, line: 3562, baseType: !165, size: 32, offset: 5696)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !534, file: !6, line: 3574, baseType: !165, size: 32, offset: 5728)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !534, file: !6, line: 3575, baseType: !847, size: 64, offset: 5760)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !6, line: 3225, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !6, line: 3216, size: 192, elements: !850)
!850 = !{!851, !852, !853, !854, !855}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !849, file: !6, line: 3218, baseType: !280, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !849, file: !6, line: 3219, baseType: !677, size: 16, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !849, file: !6, line: 3220, baseType: !141, size: 8, offset: 80)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !849, file: !6, line: 3222, baseType: !141, size: 8, offset: 88)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !849, file: !6, line: 3223, baseType: !280, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !534, file: !6, line: 3578, baseType: !227, size: 192, offset: 5824)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !534, file: !6, line: 3579, baseType: !141, size: 8, offset: 6016)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !534, file: !6, line: 3581, baseType: !141, size: 8, offset: 6024)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !534, file: !6, line: 3585, baseType: !165, size: 32, offset: 6048)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !534, file: !6, line: 3593, baseType: !165, size: 32, offset: 6080)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !534, file: !6, line: 3594, baseType: !165, size: 32, offset: 6112)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_top", scope: !534, file: !6, line: 3596, baseType: !280, size: 64, offset: 6144)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_bot", scope: !534, file: !6, line: 3597, baseType: !280, size: 64, offset: 6208)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_status", scope: !534, file: !6, line: 3598, baseType: !165, size: 32, offset: 6272)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_cursor", scope: !534, file: !6, line: 3602, baseType: !712, size: 128, offset: 6336)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_virtcol", scope: !534, file: !6, line: 3603, baseType: !469, size: 32, offset: 6464)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topline", scope: !534, file: !6, line: 3604, baseType: !280, size: 64, offset: 6528)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_line_count", scope: !534, file: !6, line: 3605, baseType: !280, size: 64, offset: 6592)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topfill", scope: !534, file: !6, line: 3607, baseType: !165, size: 32, offset: 6656)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_empty", scope: !534, file: !6, line: 3609, baseType: !141, size: 8, offset: 6688)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "w_alt_fnum", scope: !534, file: !6, line: 3612, baseType: !165, size: 32, offset: 6720)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "w_alist", scope: !534, file: !6, line: 3614, baseType: !873, size: 64, offset: 6784)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "alist_T", file: !6, line: 863, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arglist", file: !6, line: 858, size: 256, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "al_ga", scope: !875, file: !6, line: 860, baseType: !227, size: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "al_refcount", scope: !875, file: !6, line: 861, baseType: !165, size: 32, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !875, file: !6, line: 862, baseType: !165, size: 32, offset: 224)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx", scope: !534, file: !6, line: 3615, baseType: !165, size: 32, offset: 6848)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx_invalid", scope: !534, file: !6, line: 3617, baseType: !165, size: 32, offset: 6880)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "w_localdir", scope: !534, file: !6, line: 3619, baseType: !152, size: 64, offset: 6912)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "w_prevdir", scope: !534, file: !6, line: 3621, baseType: !152, size: 64, offset: 6976)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "w_winbar", scope: !534, file: !6, line: 3623, baseType: !885, size: 64, offset: 7040)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "vimmenu_T", file: !6, line: 67, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VimMenu", file: !6, line: 3889, size: 1984, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !902, !903, !904, !905, !907, !908, !910, !911, !912, !913, !1134, !1135, !1136}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !887, file: !6, line: 3891, baseType: !165, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !887, file: !6, line: 3892, baseType: !165, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !887, file: !6, line: 3893, baseType: !152, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "dname", scope: !887, file: !6, line: 3894, baseType: !152, size: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "en_name", scope: !887, file: !6, line: 3896, baseType: !152, size: 64, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "en_dname", scope: !887, file: !6, line: 3898, baseType: !152, size: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic", scope: !887, file: !6, line: 3901, baseType: !165, size: 32, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "actext", scope: !887, file: !6, line: 3902, baseType: !152, size: 64, offset: 384)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !887, file: !6, line: 3903, baseType: !165, size: 32, offset: 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !887, file: !6, line: 3905, baseType: !899, size: 64, offset: 512)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !885}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "iconfile", scope: !887, file: !6, line: 3908, baseType: !152, size: 64, offset: 576)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "iconidx", scope: !887, file: !6, line: 3909, baseType: !165, size: 32, offset: 640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "icon_builtin", scope: !887, file: !6, line: 3910, baseType: !165, size: 32, offset: 672)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "strings", scope: !887, file: !6, line: 3912, baseType: !906, size: 512, offset: 704)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 512, elements: !451)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "noremap", scope: !887, file: !6, line: 3913, baseType: !796, size: 256, offset: 1216)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !887, file: !6, line: 3914, baseType: !909, size: 64, offset: 1472)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64, elements: !451)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !887, file: !6, line: 3915, baseType: !885, size: 64, offset: 1536)
