; ModuleID = 'locale.c'
source_filename = "locale.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.exarg = type { i8*, i8*, i8*, i8**, i8*, i32, i64, i32, i32, i32, i64, i64, i32, i32, i8*, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* (i32, i8*, i32, i32)*, i8*, %struct.cstack_T* }
%struct.cstack_T = type { [50 x i16], [50 x i8], %union.anon, [50 x i8*], [50 x i32], [50 x i32], [50 x i32], i32, i32, i32, %struct.eslist_elem*, i8 }
%union.anon = type { [50 x i8*] }
%struct.eslist_elem = type { i32, %struct.eslist_elem* }
%struct.expand = type { i8*, i32, i32, i8*, %struct.sctx_T, i32, i32, i32, i32, i8**, i8* }
%struct.sctx_T = type { i32, i32, i64, i32 }
%struct.growarray = type { i32, i32, i32, i32, i8* }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"C\00", align 1
@.str.2 = private unnamed_addr constant [11 x i8] c"VIMRUNTIME\00", align 1
@NameBuff = external local_unnamed_addr global i8*, align 8
@.str.3 = private unnamed_addr constant [8 x i8] c"%s/lang\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"vim\00", align 1
@.str.5 = private unnamed_addr constant [9 x i8] c"messages\00", align 1
@.str.6 = private unnamed_addr constant [10 x i8] c"messages \00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"ctype\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c"ctype \00", align 1

!643 = !DILocation(line: 25, column: 21, scope: !636, inlinedAt: !642)
!644 = !DILocation(line: 22, column: 13, scope: !636, inlinedAt: !642)
!645 = !DILocation(line: 112, column: 13, scope: !630)
!646 = !DILocalVariable(name: "lang", arg: 1, scope: !647, file: !3, line: 100, type: !609)
!647 = distinct !DISubprogram(name: "is_valid_mess_lang", scope: !3, file: !3, line: 100, type: !648, isLocal: true, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !650)
!648 = !DISubroutineType(types: !649)
!649 = !{!624, !609}
!650 = !{!646}
!651 = !DILocation(line: 100, column: 28, scope: !647, inlinedAt: !652)
!652 = distinct !DILocation(line: 136, column: 12, scope: !630)
!653 = !DILocation(line: 102, column: 17, scope: !647, inlinedAt: !652)
!654 = !DILocation(line: 102, column: 25, scope: !647, inlinedAt: !652)
!655 = !DILocation(line: 102, column: 28, scope: !647, inlinedAt: !652)
!656 = !{!657, !657, i64 0}
!657 = !{!"omnipotent char", !658, i64 0}
!658 = !{!"Simple C/C++ TBAA"}
!659 = !DILocation(line: 102, column: 54, scope: !647, inlinedAt: !652)
!660 = !DILocation(line: 136, column: 12, scope: !630)
!661 = !DILocation(line: 136, column: 5, scope: !630)
!662 = distinct !DISubprogram(name: "set_lang_var", scope: !3, file: !3, line: 179, type: !663, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !665)
!663 = !DISubroutineType(types: !664)
!664 = !{null}
!665 = !{!666}
!666 = !DILocalVariable(name: "loc", scope: !662, file: !3, line: 181, type: !609)
!667 = !DILocation(line: 20, column: 20, scope: !636, inlinedAt: !668)
!668 = distinct !DILocation(line: 184, column: 11, scope: !662)
!669 = !DILocation(line: 25, column: 21, scope: !636, inlinedAt: !668)
!670 = !DILocation(line: 22, column: 13, scope: !636, inlinedAt: !668)
!671 = !DILocation(line: 181, column: 13, scope: !662)
!672 = !DILocation(line: 189, column: 5, scope: !662)
!673 = !DILocation(line: 20, column: 20, scope: !636, inlinedAt: !674)
!674 = distinct !DILocation(line: 194, column: 11, scope: !662)
!675 = !DILocation(line: 25, column: 21, scope: !636, inlinedAt: !674)
!676 = !DILocation(line: 22, column: 13, scope: !636, inlinedAt: !674)
!677 = !DILocation(line: 198, column: 5, scope: !662)
!678 = !DILocation(line: 20, column: 20, scope: !636, inlinedAt: !679)
!679 = distinct !DILocation(line: 201, column: 11, scope: !662)
!680 = !DILocation(line: 25, column: 21, scope: !636, inlinedAt: !679)
!681 = !DILocation(line: 22, column: 13, scope: !636, inlinedAt: !679)
!682 = !DILocation(line: 203, column: 5, scope: !662)
!683 = !DILocation(line: 20, column: 20, scope: !636, inlinedAt: !684)
!684 = distinct !DILocation(line: 206, column: 11, scope: !662)
!685 = !DILocation(line: 25, column: 21, scope: !636, inlinedAt: !684)
!686 = !DILocation(line: 22, column: 13, scope: !636, inlinedAt: !684)
!687 = !DILocation(line: 211, column: 5, scope: !662)
!688 = !DILocation(line: 212, column: 1, scope: !662)
!689 = distinct !DISubprogram(name: "init_locale", scope: !3, file: !3, line: 220, type: !663, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !690)
!690 = !{!691, !693}
!691 = !DILocalVariable(name: "mustfree", scope: !692, file: !3, line: 242, type: !624)
!692 = distinct !DILexicalBlock(scope: !689, file: !3, line: 241, column: 5)
!693 = !DILocalVariable(name: "p", scope: !692, file: !3, line: 243, type: !609)
!694 = !DILocation(line: 222, column: 5, scope: !689)
!695 = !DILocation(line: 226, column: 5, scope: !689)
!696 = !DILocation(line: 230, column: 5, scope: !689)
!697 = !DILocation(line: 242, column: 2, scope: !692)
!698 = !DILocation(line: 242, column: 6, scope: !692)
!699 = !{!700, !700, i64 0}
!700 = !{!"int", !657, i64 0}
!701 = !DILocation(line: 251, column: 6, scope: !692)
!702 = !DILocation(line: 243, column: 10, scope: !692)
!703 = !DILocation(line: 252, column: 8, scope: !704)
!704 = distinct !DILexicalBlock(scope: !692, file: !3, line: 252, column: 6)
!705 = !DILocation(line: 252, column: 16, scope: !704)
!706 = !DILocation(line: 252, column: 19, scope: !704)
!707 = !DILocation(line: 252, column: 22, scope: !704)
!708 = !DILocation(line: 252, column: 6, scope: !692)
!709 = !DILocation(line: 254, column: 27, scope: !710)
!710 = distinct !DILexicalBlock(scope: !704, file: !3, line: 253, column: 2)
!711 = !{!712, !712, i64 0}
!712 = !{!"any pointer", !657, i64 0}
!713 = !DILocation(line: 254, column: 6, scope: !710)
!714 = !DILocation(line: 255, column: 41, scope: !710)
!715 = !DILocation(line: 255, column: 6, scope: !710)
!716 = !DILocation(line: 256, column: 2, scope: !710)
!717 = !DILocation(line: 257, column: 6, scope: !718)
!718 = distinct !DILexicalBlock(scope: !692, file: !3, line: 257, column: 6)
!719 = !DILocation(line: 257, column: 6, scope: !692)
!720 = !DILocation(line: 258, column: 6, scope: !718)
!721 = !DILocation(line: 259, column: 2, scope: !692)
!722 = !DILocation(line: 260, column: 5, scope: !689)
!723 = !DILocation(line: 262, column: 1, scope: !689)
!724 = distinct !DISubprogram(name: "ex_language", scope: !3, file: !3, line: 268, type: !725, isLocal: false, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !802)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "exarg_T", file: !6, line: 85, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exarg", file: !6, line: 1861, size: 1472, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !738, !740, !741, !742, !743, !745, !746, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !767, !768}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !729, file: !6, line: 1863, baseType: !609, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "nextcmd", scope: !729, file: !6, line: 1864, baseType: !609, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !729, file: !6, line: 1865, baseType: !609, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "cmdlinep", scope: !729, file: !6, line: 1866, baseType: !620, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_tofree", scope: !729, file: !6, line: 1868, baseType: !609, size: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "cmdidx", scope: !729, file: !6, line: 1870, baseType: !737, size: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmdidx_T", file: !6, line: 1856, baseType: !5)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "argt", scope: !729, file: !6, line: 1871, baseType: !739, size: 64, offset: 384)
!739 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !729, file: !6, line: 1872, baseType: !624, size: 32, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "forceit", scope: !729, file: !6, line: 1873, baseType: !624, size: 32, offset: 480)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "addr_count", scope: !729, file: !6, line: 1874, baseType: !624, size: 32, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "line1", scope: !729, file: !6, line: 1875, baseType: !744, size: 64, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !611, line: 1687, baseType: !739)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "line2", scope: !729, file: !6, line: 1876, baseType: !744, size: 64, offset: 640)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "addr_type", scope: !729, file: !6, line: 1877, baseType: !747, size: 32, offset: 704)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmd_addr_T", file: !6, line: 81, baseType: !587)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !729, file: !6, line: 1878, baseType: !624, size: 32, offset: 736)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "do_ecmd_cmd", scope: !729, file: !6, line: 1879, baseType: !609, size: 64, offset: 768)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "do_ecmd_lnum", scope: !729, file: !6, line: 1880, baseType: !744, size: 64, offset: 832)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "append", scope: !729, file: !6, line: 1881, baseType: !624, size: 32, offset: 896)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "usefilter", scope: !729, file: !6, line: 1882, baseType: !624, size: 32, offset: 928)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "amount", scope: !729, file: !6, line: 1883, baseType: !624, size: 32, offset: 960)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "regname", scope: !729, file: !6, line: 1884, baseType: !624, size: 32, offset: 992)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "force_bin", scope: !729, file: !6, line: 1885, baseType: !624, size: 32, offset: 1024)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "read_edit", scope: !729, file: !6, line: 1886, baseType: !624, size: 32, offset: 1056)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "force_ff", scope: !729, file: !6, line: 1887, baseType: !624, size: 32, offset: 1088)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "force_enc", scope: !729, file: !6, line: 1888, baseType: !624, size: 32, offset: 1120)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "bad_char", scope: !729, file: !6, line: 1889, baseType: !624, size: 32, offset: 1152)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "useridx", scope: !729, file: !6, line: 1890, baseType: !624, size: 32, offset: 1184)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "errmsg", scope: !729, file: !6, line: 1891, baseType: !614, size: 64, offset: 1216)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "getline", scope: !729, file: !6, line: 1892, baseType: !763, size: 64, offset: 1280)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!609, !624, !613, !624, !766}
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "getline_opt_T", file: !602, line: 1577, baseType: !601)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !729, file: !6, line: 1893, baseType: !613, size: 64, offset: 1344)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "cstack", scope: !729, file: !6, line: 1895, baseType: !769, size: 64, offset: 1408)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "cstack_T", file: !602, line: 921, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 904, size: 12672, elements: !772)
!772 = !{!773, !778, !780, !786, !787, !789, !790, !791, !792, !793, !794, !801}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "cs_flags", scope: !771, file: !602, line: 905, baseType: !774, size: 800)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 800, elements: !776)
!775 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!776 = !{!777}
!777 = !DISubrange(count: 50)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "cs_pending", scope: !771, file: !602, line: 906, baseType: !779, size: 400, offset: 800)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 400, elements: !776)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "cs_pend", scope: !771, file: !602, line: 910, baseType: !781, size: 3200, offset: 1216)
!781 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !771, file: !602, line: 907, size: 3200, elements: !782)
!782 = !{!783, !785}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "csp_rv", scope: !781, file: !602, line: 908, baseType: !784, size: 3200)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 3200, elements: !776)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "csp_ex", scope: !781, file: !602, line: 909, baseType: !784, size: 3200)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cs_forinfo", scope: !771, file: !602, line: 911, baseType: !784, size: 3200, offset: 4416)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cs_line", scope: !771, file: !602, line: 912, baseType: !788, size: 1600, offset: 7616)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 1600, elements: !776)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cs_block_id", scope: !771, file: !602, line: 913, baseType: !788, size: 1600, offset: 9216)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "cs_script_var_len", scope: !771, file: !602, line: 914, baseType: !788, size: 1600, offset: 10816)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cs_idx", scope: !771, file: !602, line: 916, baseType: !624, size: 32, offset: 12416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cs_looplevel", scope: !771, file: !602, line: 917, baseType: !624, size: 32, offset: 12448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cs_trylevel", scope: !771, file: !602, line: 918, baseType: !624, size: 32, offset: 12480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cs_emsg_silent_list", scope: !771, file: !602, line: 919, baseType: !795, size: 64, offset: 12544)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "eslist_T", file: !602, line: 891, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eslist_elem", file: !602, line: 892, size: 128, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "saved_emsg_silent", scope: !797, file: !602, line: 894, baseType: !624, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !797, file: !602, line: 895, baseType: !795, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "cs_lflags", scope: !771, file: !602, line: 920, baseType: !615, size: 8, offset: 12608)
!802 = !{!803, !804, !805, !806, !807, !808, !809}
!803 = !DILocalVariable(name: "eap", arg: 1, scope: !724, file: !3, line: 268, type: !727)
!804 = !DILocalVariable(name: "loc", scope: !724, file: !3, line: 270, type: !614)
!805 = !DILocalVariable(name: "p", scope: !724, file: !3, line: 271, type: !609)
!806 = !DILocalVariable(name: "name", scope: !724, file: !3, line: 272, type: !609)
!807 = !DILocalVariable(name: "what", scope: !724, file: !3, line: 273, type: !624)
!808 = !DILocalVariable(name: "whatstr", scope: !724, file: !3, line: 274, type: !614)
!809 = !DILocalVariable(name: "mname", scope: !810, file: !3, line: 376, type: !609)
!810 = distinct !DILexicalBlock(scope: !811, file: !3, line: 375, column: 3)
!811 = distinct !DILexicalBlock(scope: !812, file: !3, line: 374, column: 7)
!812 = distinct !DILexicalBlock(scope: !813, file: !3, line: 356, column: 6)
!813 = distinct !DILexicalBlock(scope: !814, file: !3, line: 355, column: 10)
!814 = distinct !DILexicalBlock(scope: !815, file: !3, line: 344, column: 2)
!815 = distinct !DILexicalBlock(scope: !816, file: !3, line: 341, column: 6)
!816 = distinct !DILexicalBlock(scope: !817, file: !3, line: 328, column: 5)
!817 = distinct !DILexicalBlock(scope: !724, file: !3, line: 315, column: 9)
!818 = !DILocation(line: 268, column: 22, scope: !724)
!819 = !DILocation(line: 273, column: 10, scope: !724)
!820 = !DILocation(line: 281, column: 17, scope: !724)
!821 = !{!822, !712, i64 0}
!822 = !{!"exarg", !712, i64 0, !712, i64 8, !712, i64 16, !712, i64 24, !712, i64 32, !657, i64 40, !823, i64 48, !700, i64 56, !700, i64 60, !700, i64 64, !823, i64 72, !823, i64 80, !657, i64 88, !700, i64 92, !712, i64 96, !823, i64 104, !700, i64 112, !700, i64 116, !700, i64 120, !700, i64 124, !700, i64 128, !700, i64 132, !700, i64 136, !700, i64 140, !700, i64 144, !700, i64 148, !712, i64 152, !712, i64 160, !712, i64 168, !712, i64 176}
!823 = !{!"long", !657, i64 0}
!824 = !DILocation(line: 272, column: 13, scope: !724)
!825 = !DILocation(line: 286, column: 9, scope: !724)
!826 = !DILocation(line: 271, column: 13, scope: !724)
!827 = !DILocation(line: 287, column: 10, scope: !828)
!828 = distinct !DILexicalBlock(scope: !724, file: !3, line: 287, column: 9)
!829 = !DILocation(line: 287, column: 20, scope: !828)
!830 = !DILocation(line: 287, column: 52, scope: !828)
!831 = !DILocation(line: 287, column: 45, scope: !828)
!832 = !DILocation(line: 287, column: 56, scope: !828)
!833 = !DILocation(line: 287, column: 9, scope: !724)
!834 = !DILocation(line: 289, column: 6, scope: !835)
!835 = distinct !DILexicalBlock(scope: !836, file: !3, line: 289, column: 6)
!836 = distinct !DILexicalBlock(scope: !828, file: !3, line: 288, column: 5)
!837 = !DILocation(line: 289, column: 51, scope: !835)
!838 = !DILocation(line: 289, column: 6, scope: !836)
!839 = !DILocation(line: 292, column: 13, scope: !840)
!840 = distinct !DILexicalBlock(scope: !835, file: !3, line: 290, column: 2)
!841 = !DILocation(line: 294, column: 2, scope: !840)
!842 = !DILocation(line: 295, column: 11, scope: !843)
!843 = distinct !DILexicalBlock(scope: !835, file: !3, line: 295, column: 11)
!844 = !DILocation(line: 295, column: 53, scope: !843)
!845 = !DILocation(line: 295, column: 11, scope: !835)
!846 = !DILocation(line: 298, column: 13, scope: !847)
!847 = distinct !DILexicalBlock(scope: !843, file: !3, line: 296, column: 2)
!848 = !DILocation(line: 300, column: 2, scope: !847)
!849 = !DILocation(line: 301, column: 11, scope: !850)
!850 = distinct !DILexicalBlock(scope: !843, file: !3, line: 301, column: 11)
!851 = !DILocation(line: 301, column: 52, scope: !850)
!852 = !DILocation(line: 301, column: 11, scope: !843)
!853 = !DILocation(line: 304, column: 13, scope: !854)
!854 = distinct !DILexicalBlock(scope: !850, file: !3, line: 302, column: 2)
!855 = !DILocation(line: 306, column: 2, scope: !854)
!856 = !DILocation(line: 307, column: 11, scope: !857)
!857 = distinct !DILexicalBlock(scope: !850, file: !3, line: 307, column: 11)
!858 = !DILocation(line: 307, column: 55, scope: !857)
!859 = !DILocation(line: 307, column: 11, scope: !850)
!860 = !DILocation(line: 310, column: 13, scope: !861)
!861 = distinct !DILexicalBlock(scope: !857, file: !3, line: 308, column: 2)
!862 = !DILocation(line: 312, column: 2, scope: !861)
!863 = !DILocation(line: 274, column: 11, scope: !724)
!864 = !DILocation(line: 315, column: 9, scope: !817)
!865 = !DILocation(line: 315, column: 15, scope: !817)
!866 = !DILocation(line: 315, column: 9, scope: !724)
!867 = !DILocation(line: 322, column: 20, scope: !868)
!868 = distinct !DILexicalBlock(scope: !817, file: !3, line: 316, column: 5)
!869 = !DILocation(line: 323, column: 8, scope: !870)
!870 = distinct !DILexicalBlock(scope: !868, file: !3, line: 323, column: 6)
!871 = !DILocation(line: 323, column: 16, scope: !870)
!872 = !DILocation(line: 323, column: 19, scope: !870)
!873 = !DILocation(line: 323, column: 22, scope: !870)
!874 = !DILocation(line: 323, column: 6, scope: !868)
!875 = !DILocation(line: 324, column: 6, scope: !870)
!876 = !DILocation(line: 325, column: 7, scope: !868)
!877 = !DILocation(line: 325, column: 2, scope: !868)
!878 = !DILocation(line: 326, column: 5, scope: !868)
!879 = !DILocation(line: 335, column: 12, scope: !880)
!880 = distinct !DILexicalBlock(scope: !816, file: !3, line: 334, column: 2)
!881 = !DILocation(line: 270, column: 11, scope: !724)
!882 = !DILocation(line: 338, column: 6, scope: !880)
!883 = !DILocation(line: 341, column: 10, scope: !815)
!884 = !DILocation(line: 341, column: 6, scope: !816)
!885 = !DILocation(line: 342, column: 12, scope: !815)
!886 = !DILocation(line: 342, column: 6, scope: !815)
!887 = !DILocation(line: 350, column: 6, scope: !814)
!888 = !DILocation(line: 353, column: 6, scope: !814)
!889 = !DILocation(line: 355, column: 26, scope: !813)
!890 = !DILocation(line: 361, column: 7, scope: !812)
!891 = !DILocation(line: 363, column: 7, scope: !892)
!892 = distinct !DILexicalBlock(scope: !893, file: !3, line: 362, column: 3)
!893 = distinct !DILexicalBlock(scope: !812, file: !3, line: 361, column: 7)
!894 = !DILocation(line: 366, column: 7, scope: !892)
!895 = !DILocation(line: 374, column: 7, scope: !812)
!896 = !DILocation(line: 376, column: 15, scope: !810)
!897 = !DILocation(line: 382, column: 7, scope: !810)
!898 = !DILocation(line: 384, column: 7, scope: !810)
!899 = !DILocation(line: 386, column: 3, scope: !810)
!900 = !DILocation(line: 20, column: 20, scope: !636, inlinedAt: !901)
!901 = distinct !DILocation(line: 184, column: 11, scope: !662, inlinedAt: !902)
!902 = distinct !DILocation(line: 391, column: 6, scope: !814)
!903 = !DILocation(line: 25, column: 21, scope: !636, inlinedAt: !901)
!904 = !DILocation(line: 22, column: 13, scope: !636, inlinedAt: !901)
!905 = !DILocation(line: 181, column: 13, scope: !662, inlinedAt: !902)
!906 = !DILocation(line: 189, column: 5, scope: !662, inlinedAt: !902)
!907 = !DILocation(line: 20, column: 20, scope: !636, inlinedAt: !908)
!908 = distinct !DILocation(line: 194, column: 11, scope: !662, inlinedAt: !902)
!909 = !DILocation(line: 25, column: 21, scope: !636, inlinedAt: !908)
!910 = !DILocation(line: 22, column: 13, scope: !636, inlinedAt: !908)
!911 = !DILocation(line: 198, column: 5, scope: !662, inlinedAt: !902)
!912 = !DILocation(line: 20, column: 20, scope: !636, inlinedAt: !913)
!913 = distinct !DILocation(line: 201, column: 11, scope: !662, inlinedAt: !902)
!914 = !DILocation(line: 25, column: 21, scope: !636, inlinedAt: !913)
!915 = !DILocation(line: 22, column: 13, scope: !636, inlinedAt: !913)
!916 = !DILocation(line: 203, column: 5, scope: !662, inlinedAt: !902)
!917 = !DILocation(line: 20, column: 20, scope: !636, inlinedAt: !918)
!918 = distinct !DILocation(line: 206, column: 11, scope: !662, inlinedAt: !902)
!919 = !DILocation(line: 25, column: 21, scope: !636, inlinedAt: !918)
!920 = !DILocation(line: 22, column: 13, scope: !636, inlinedAt: !918)
!921 = !DILocation(line: 211, column: 5, scope: !662, inlinedAt: !902)
!922 = !DILocation(line: 394, column: 6, scope: !814)
!923 = !DILocation(line: 398, column: 1, scope: !724)
!924 = distinct !DISubprogram(name: "get_lang_arg", scope: !3, file: !3, line: 535, type: !925, isLocal: false, isDefinition: true, scopeLine: 536, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !950)
!925 = !DISubroutineType(types: !926)
!926 = !{!609, !927, !624}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "expand_T", file: !602, line: 589, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "expand", file: !602, line: 570, size: 640, elements: !930)
!930 = !{!931, !932, !933, !934, !935, !944, !945, !946, !947, !948, !949}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "xp_pattern", scope: !929, file: !602, line: 572, baseType: !609, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "xp_context", scope: !929, file: !602, line: 573, baseType: !624, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "xp_pattern_len", scope: !929, file: !602, line: 574, baseType: !624, size: 32, offset: 96)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "xp_arg", scope: !929, file: !602, line: 576, baseType: !609, size: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "xp_script_ctx", scope: !929, file: !602, line: 577, baseType: !936, size: 192, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !602, line: 92, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 85, size: 192, elements: !938)
!938 = !{!939, !941, !942, !943}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !937, file: !602, line: 87, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !602, line: 62, baseType: !624)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !937, file: !602, line: 88, baseType: !624, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !937, file: !602, line: 89, baseType: !744, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !937, file: !602, line: 91, baseType: !624, size: 32, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "xp_backslash", scope: !929, file: !602, line: 579, baseType: !624, size: 32, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "xp_shell", scope: !929, file: !602, line: 581, baseType: !624, size: 32, offset: 416)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "xp_numfiles", scope: !929, file: !602, line: 584, baseType: !624, size: 32, offset: 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "xp_col", scope: !929, file: !602, line: 586, baseType: !624, size: 32, offset: 480)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "xp_files", scope: !929, file: !602, line: 587, baseType: !620, size: 64, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "xp_line", scope: !929, file: !602, line: 588, baseType: !609, size: 64, offset: 576)
!950 = !{!951, !952}
!951 = !DILocalVariable(name: "xp", arg: 1, scope: !924, file: !3, line: 535, type: !927)
!952 = !DILocalVariable(name: "idx", arg: 2, scope: !924, file: !3, line: 535, type: !624)
!953 = !DILocation(line: 535, column: 24, scope: !924)
!954 = !DILocation(line: 535, column: 39, scope: !924)
!955 = !DILocation(line: 537, column: 9, scope: !924)
!956 = !DILocation(line: 546, column: 5, scope: !924)
!957 = !DILocation(line: 547, column: 9, scope: !958)
!958 = distinct !DILexicalBlock(scope: !924, file: !3, line: 547, column: 9)
!959 = !DILocation(line: 547, column: 17, scope: !958)
!960 = !DILocation(line: 547, column: 9, scope: !924)
!961 = !DILocation(line: 549, column: 24, scope: !924)
!962 = !DILocation(line: 549, column: 12, scope: !924)
!963 = !DILocation(line: 549, column: 5, scope: !924)
!964 = !DILocation(line: 550, column: 1, scope: !924)
!965 = distinct !DISubprogram(name: "init_locales", scope: !3, file: !3, line: 507, type: !663, isLocal: true, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !966)
!966 = !{}
!967 = !DILocation(line: 509, column: 9, scope: !965)
!968 = !DILocation(line: 411, column: 5, scope: !969, inlinedAt: !986)
!969 = distinct !DISubprogram(name: "find_locales", scope: !3, file: !3, line: 409, type: !970, isLocal: true, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !972)
!970 = !DISubroutineType(types: !971)
!971 = !{!620}
!972 = !{!973, !982, !983, !984}
!973 = !DILocalVariable(name: "locales_ga", scope: !969, file: !3, line: 411, type: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !602, line: 55, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !602, line: 48, size: 192, elements: !976)
!976 = !{!977, !978, !979, !980, !981}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !975, file: !602, line: 50, baseType: !624, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !975, file: !602, line: 51, baseType: !624, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !975, file: !602, line: 52, baseType: !624, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !975, file: !602, line: 53, baseType: !624, size: 32, offset: 96)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !975, file: !602, line: 54, baseType: !613, size: 64, offset: 128)
!982 = !DILocalVariable(name: "loc", scope: !969, file: !3, line: 412, type: !609)
!983 = !DILocalVariable(name: "locale_list", scope: !969, file: !3, line: 413, type: !609)
!984 = !DILocalVariable(name: "ignore", scope: !985, file: !3, line: 463, type: !624)
!985 = distinct !DILexicalBlock(scope: !969, file: !3, line: 462, column: 5)
!986 = distinct !DILocation(line: 512, column: 12, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !3, line: 510, column: 5)
!988 = distinct !DILexicalBlock(scope: !965, file: !3, line: 509, column: 9)
!989 = !DILocation(line: 421, column: 19, scope: !969, inlinedAt: !986)
!990 = !DILocation(line: 413, column: 13, scope: !969, inlinedAt: !986)
!991 = !DILocation(line: 453, column: 21, scope: !992, inlinedAt: !986)
!992 = distinct !DILexicalBlock(scope: !969, file: !3, line: 453, column: 9)
!993 = !DILocation(line: 453, column: 9, scope: !969, inlinedAt: !986)
!994 = !DILocation(line: 411, column: 14, scope: !969, inlinedAt: !986)
!995 = !DILocation(line: 455, column: 5, scope: !969, inlinedAt: !986)
!996 = !DILocation(line: 459, column: 21, scope: !969, inlinedAt: !986)
!997 = !DILocation(line: 412, column: 13, scope: !969, inlinedAt: !986)
!998 = !DILocation(line: 461, column: 16, scope: !969, inlinedAt: !986)
!999 = !DILocation(line: 461, column: 5, scope: !969, inlinedAt: !986)
!1000 = !DILocation(line: 463, column: 6, scope: !985, inlinedAt: !986)
!1001 = !DILocation(line: 474, column: 10, scope: !1002, inlinedAt: !986)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 474, column: 10)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 473, column: 2)
!1004 = distinct !DILexicalBlock(scope: !985, file: !3, line: 472, column: 6)
!1005 = !DILocation(line: 474, column: 34, scope: !1002, inlinedAt: !986)
!1006 = !DILocation(line: 474, column: 10, scope: !1003, inlinedAt: !986)
!1007 = !DILocation(line: 477, column: 12, scope: !1003, inlinedAt: !986)
!1008 = !DILocation(line: 478, column: 14, scope: !1009, inlinedAt: !986)
!1009 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 478, column: 10)
!1010 = !DILocation(line: 478, column: 10, scope: !1003, inlinedAt: !986)
!1011 = !DILocation(line: 481, column: 29, scope: !1003, inlinedAt: !986)
!1012 = !{!1013, !712, i64 16}
!1013 = !{!"growarray", !700, i64 0, !700, i64 4, !700, i64 8, !700, i64 12, !712, i64 16}
!1014 = !DILocation(line: 481, column: 55, scope: !1003, inlinedAt: !986)
!1015 = !{!1013, !700, i64 0}
!1016 = !DILocation(line: 481, column: 6, scope: !1003, inlinedAt: !986)
!1017 = !DILocation(line: 481, column: 59, scope: !1003, inlinedAt: !986)
!1018 = !DILocation(line: 483, column: 18, scope: !985, inlinedAt: !986)
!1019 = distinct !{!1019, !1020, !1021}
!1020 = !DILocation(line: 461, column: 5, scope: !969)
!1021 = !DILocation(line: 484, column: 5, scope: !969)
!1022 = !DILocation(line: 493, column: 5, scope: !969, inlinedAt: !986)
!1023 = !DILocation(line: 494, column: 9, scope: !1024, inlinedAt: !986)
!1024 = distinct !DILexicalBlock(scope: !969, file: !3, line: 494, column: 9)
!1025 = !DILocation(line: 494, column: 33, scope: !1024, inlinedAt: !986)
!1026 = !DILocation(line: 494, column: 9, scope: !969, inlinedAt: !986)
!1027 = !DILocation(line: 496, column: 2, scope: !1028, inlinedAt: !986)
!1028 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 495, column: 5)
!1029 = !DILocation(line: 497, column: 2, scope: !1028, inlinedAt: !986)
!1030 = !DILocation(line: 499, column: 28, scope: !969, inlinedAt: !986)
!1031 = !DILocation(line: 499, column: 48, scope: !969, inlinedAt: !986)
!1032 = !DILocation(line: 499, column: 5, scope: !969, inlinedAt: !986)
!1033 = !DILocation(line: 499, column: 56, scope: !969, inlinedAt: !986)
!1034 = !DILocation(line: 500, column: 34, scope: !969, inlinedAt: !986)
!1035 = !DILocation(line: 500, column: 5, scope: !969, inlinedAt: !986)
