; ModuleID = 'session.c'
source_filename = "session.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cmdmod_T = type { i32, i32, i32, %struct.regmatch_T, i32, i32, i8*, i32, i64, i32, i32, i32 }
%struct.regmatch_T = type { %struct.regprog*, [10 x i8*], [10 x i8*], i32 }
%struct.regprog = type { %struct.regengine*, i32, i32, i32, i32 }
%struct.regengine = type { %struct.regprog* (i8*, i32)*, void (%struct.regprog*)*, i32 (%struct.regmatch_T*, i8*, i32, i32)*, i64 (%struct.regmmatch_T*, %struct.window_S*, %struct.file_buffer*, i64, i32, %struct.timeval*, i32*)*, i8* }
%struct.regmmatch_T = type { %struct.regprog*, [10 x %struct.lpos_T], [10 x %struct.lpos_T], i32, i32 }
%struct.lpos_T = type { i64, i32 }

!623 = !DIEnumerator(name: "VAR_BLOB", value: 8)
!624 = !DIEnumerator(name: "VAR_FUNC", value: 9)
!625 = !DIEnumerator(name: "VAR_PARTIAL", value: 10)
!626 = !DIEnumerator(name: "VAR_LIST", value: 11)
!627 = !DIEnumerator(name: "VAR_DICT", value: 12)
!628 = !DIEnumerator(name: "VAR_JOB", value: 13)
!629 = !DIEnumerator(name: "VAR_CHANNEL", value: 14)
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !602, line: 1585, size: 32, elements: !631)
!631 = !{!632, !633, !634, !635, !636}
!632 = !DIEnumerator(name: "UF_NOT_COMPILED", value: 0)
!633 = !DIEnumerator(name: "UF_TO_BE_COMPILED", value: 1)
!634 = !DIEnumerator(name: "UF_COMPILING", value: 2)
!635 = !DIEnumerator(name: "UF_COMPILED", value: 3)
!636 = !DIEnumerator(name: "UF_COMPILE_ERROR", value: 4)
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !602, line: 2061, size: 32, elements: !638)
!638 = !{!639, !640, !641, !642}
!639 = !DIEnumerator(name: "JOB_FAILED", value: 0)
!640 = !DIEnumerator(name: "JOB_STARTED", value: 1)
!641 = !DIEnumerator(name: "JOB_ENDED", value: 2)
!642 = !DIEnumerator(name: "JOB_FINISHED", value: 3)
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !602, line: 2140, size: 32, elements: !644)
!644 = !{!645, !646, !647, !648}
!645 = !DIEnumerator(name: "MODE_NL", value: 0)
!646 = !DIEnumerator(name: "MODE_RAW", value: 1)
!647 = !DIEnumerator(name: "MODE_JSON", value: 2)
!648 = !DIEnumerator(name: "MODE_JS", value: 3)
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !602, line: 2148, size: 32, elements: !650)
!650 = !{!651, !652, !653, !654, !655}
!651 = !DIEnumerator(name: "JIO_PIPE", value: 0)
!652 = !DIEnumerator(name: "JIO_NULL", value: 1)
!653 = !DIEnumerator(name: "JIO_FILE", value: 2)
!654 = !DIEnumerator(name: "JIO_BUFFER", value: 3)
!655 = !DIEnumerator(name: "JIO_OUT", value: 4)
!656 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !602, line: 2517, size: 32, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663}
!658 = !DIEnumerator(name: "POPPOS_BOTLEFT", value: 0)
!659 = !DIEnumerator(name: "POPPOS_TOPLEFT", value: 1)
!660 = !DIEnumerator(name: "POPPOS_BOTRIGHT", value: 2)
!661 = !DIEnumerator(name: "POPPOS_TOPRIGHT", value: 3)
!662 = !DIEnumerator(name: "POPPOS_CENTER", value: 4)
!663 = !DIEnumerator(name: "POPPOS_NONE", value: 5)
!664 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !602, line: 2526, size: 32, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIEnumerator(name: "POPCLOSE_NONE", value: 0)
!667 = !DIEnumerator(name: "POPCLOSE_BUTTON", value: 1)
!668 = !DIEnumerator(name: "POPCLOSE_CLICK", value: 2)
!669 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !670, line: 55, size: 32, elements: !671)
!670 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkvisual.h", directory: "/home/sahil/vim/src")
!671 = !{!672, !673, !674, !675, !676, !677}
!672 = !DIEnumerator(name: "GDK_VISUAL_STATIC_GRAY", value: 0)
!673 = !DIEnumerator(name: "GDK_VISUAL_GRAYSCALE", value: 1)
!674 = !DIEnumerator(name: "GDK_VISUAL_STATIC_COLOR", value: 2)
!675 = !DIEnumerator(name: "GDK_VISUAL_PSEUDO_COLOR", value: 3)
!676 = !DIEnumerator(name: "GDK_VISUAL_TRUE_COLOR", value: 4)
!677 = !DIEnumerator(name: "GDK_VISUAL_DIRECT_COLOR", value: 5)
!678 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !679, line: 118, size: 32, elements: !680)
!679 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdktypes.h", directory: "/home/sahil/vim/src")
!680 = !{!681, !682}
!681 = !DIEnumerator(name: "GDK_LSB_FIRST", value: 0)
!682 = !DIEnumerator(name: "GDK_MSB_FIRST", value: 1)
!683 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !684, line: 43, size: 32, elements: !685)
!684 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkfont.h", directory: "/home/sahil/vim/src")
!685 = !{!686, !687}
!686 = !DIEnumerator(name: "GDK_FONT_FONT", value: 0)
!687 = !DIEnumerator(name: "GDK_FONT_FONTSET", value: 1)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !689, line: 52, size: 32, elements: !690)
!689 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkrc.h", directory: "/home/sahil/vim/src")
!690 = !{!691, !692, !693, !694}
!691 = !DIEnumerator(name: "GTK_RC_FG", value: 1)
!692 = !DIEnumerator(name: "GTK_RC_BG", value: 2)
!693 = !DIEnumerator(name: "GTK_RC_TEXT", value: 4)
!694 = !DIEnumerator(name: "GTK_RC_BASE", value: 8)
!695 = !{!696, !697, !701, !703, !704, !705, !2375, !870}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !699, line: 324, baseType: !700)
!699 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!700 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!703 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!704 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !602, line: 1519, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !602, line: 1513, size: 192, elements: !708)
!708 = !{!709, !2373, !2374}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !707, file: !602, line: 1515, baseType: !710, size: 128)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !602, line: 1432, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 1412, size: 128, elements: !712)
!712 = !{!713, !715, !716}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !711, file: !602, line: 1414, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !602, line: 1391, baseType: !613)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !711, file: !602, line: 1415, baseType: !702, size: 8, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !711, file: !602, line: 1431, baseType: !717, size: 64, offset: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !711, file: !602, line: 1416, size: 64, elements: !718)
!718 = !{!719, !722, !725, !726, !783, !819, !962, !2364, !2365}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !717, file: !602, line: 1418, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !602, line: 1327, baseType: !721)
!721 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !717, file: !602, line: 1420, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !602, line: 1344, baseType: !724)
!724 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !717, file: !602, line: 1422, baseType: !697, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !717, file: !602, line: 1423, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !602, line: 1346, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !602, line: 1471, size: 768, elements: !730)
!730 = !{!731, !739, !746, !761, !775, !776, !777, !778, !779, !780, !781, !782}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !729, file: !602, line: 1473, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !602, line: 1446, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !602, line: 1448, size: 256, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !734, file: !602, line: 1450, baseType: !732, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !734, file: !602, line: 1451, baseType: !732, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !734, file: !602, line: 1452, baseType: !710, size: 128, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !729, file: !602, line: 1474, baseType: !740, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !602, line: 1456, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !602, line: 1458, size: 128, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !742, file: !602, line: 1460, baseType: !732, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !742, file: !602, line: 1461, baseType: !740, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !729, file: !602, line: 1487, baseType: !747, size: 192, offset: 128)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !729, file: !602, line: 1475, size: 192, elements: !748)
!748 = !{!749, !755}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !747, file: !602, line: 1481, baseType: !750, size: 192)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !747, file: !602, line: 1476, size: 192, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !750, file: !602, line: 1478, baseType: !720, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !750, file: !602, line: 1479, baseType: !720, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !750, file: !602, line: 1480, baseType: !704, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !747, file: !602, line: 1486, baseType: !756, size: 192)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !747, file: !602, line: 1482, size: 192, elements: !757)
!757 = !{!758, !759, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !756, file: !602, line: 1483, baseType: !732, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !756, file: !602, line: 1484, baseType: !732, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !756, file: !602, line: 1485, baseType: !704, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !729, file: !602, line: 1488, baseType: !762, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !602, line: 1394, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !602, line: 1395, size: 192, elements: !765)
!765 = !{!766, !767, !770, !771, !772, !773}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !764, file: !602, line: 1396, baseType: !714, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !764, file: !602, line: 1397, baseType: !768, size: 8, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !602, line: 1342, baseType: !769)
!769 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !764, file: !602, line: 1398, baseType: !702, size: 8, offset: 40)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !764, file: !602, line: 1399, baseType: !702, size: 8, offset: 48)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !764, file: !602, line: 1400, baseType: !762, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !764, file: !602, line: 1401, baseType: !774, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !729, file: !602, line: 1489, baseType: !727, size: 64, offset: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !729, file: !602, line: 1490, baseType: !727, size: 64, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !729, file: !602, line: 1491, baseType: !727, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !729, file: !602, line: 1492, baseType: !704, size: 32, offset: 576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !729, file: !602, line: 1493, baseType: !704, size: 32, offset: 608)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !729, file: !602, line: 1494, baseType: !704, size: 32, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !729, file: !602, line: 1496, baseType: !704, size: 32, offset: 672)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !729, file: !602, line: 1497, baseType: !702, size: 8, offset: 704)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !717, file: !602, line: 1424, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !602, line: 1347, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !602, line: 1545, size: 2816, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !815, !816, !817, !818}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !786, file: !602, line: 1547, baseType: !702, size: 8)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !786, file: !602, line: 1548, baseType: !702, size: 8, offset: 8)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !786, file: !602, line: 1549, baseType: !704, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !786, file: !602, line: 1550, baseType: !704, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !786, file: !602, line: 1551, baseType: !793, size: 2432, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !602, line: 1290, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !602, line: 1277, size: 2432, elements: !795)
!795 = !{!796, !799, !800, !801, !802, !803, !804, !811}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !794, file: !602, line: 1279, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !699, line: 345, baseType: !798)
!798 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !794, file: !602, line: 1281, baseType: !797, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !794, file: !602, line: 1282, baseType: !797, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !794, file: !602, line: 1283, baseType: !704, size: 32, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !794, file: !602, line: 1284, baseType: !704, size: 32, offset: 224)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !794, file: !602, line: 1285, baseType: !704, size: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !794, file: !602, line: 1287, baseType: !805, size: 64, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !602, line: 1265, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !602, line: 1261, size: 128, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !807, file: !602, line: 1263, baseType: !797, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !807, file: !602, line: 1264, baseType: !697, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !794, file: !602, line: 1289, baseType: !812, size: 2048, offset: 384)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 2048, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 16)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !786, file: !602, line: 1552, baseType: !762, size: 64, offset: 2560)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !786, file: !602, line: 1553, baseType: !784, size: 64, offset: 2624)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !786, file: !602, line: 1554, baseType: !784, size: 64, offset: 2688)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !786, file: !602, line: 1555, baseType: !784, size: 64, offset: 2752)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !717, file: !602, line: 1425, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !602, line: 1348, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !602, line: 1994, size: 832, elements: !823)
!823 = !{!824, !825, !826, !937, !938, !948, !958, !959, !960, !961}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !822, file: !602, line: 1996, baseType: !704, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !822, file: !602, line: 1997, baseType: !697, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !822, file: !602, line: 1999, baseType: !827, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !602, line: 1658, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 1597, size: 3072, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !837, !838, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !858, !859, !860, !861, !862, !873, !874, !875, !876, !878, !879, !880, !881, !882, !883, !884, !894, !895, !896, !932, !933}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !829, file: !602, line: 1599, baseType: !704, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !829, file: !602, line: 1600, baseType: !704, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !829, file: !602, line: 1601, baseType: !704, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !829, file: !602, line: 1602, baseType: !704, size: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !829, file: !602, line: 1603, baseType: !836, size: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !602, line: 1591, baseType: !630)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !829, file: !602, line: 1604, baseType: !704, size: 32, offset: 160)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !829, file: !602, line: 1605, baseType: !839, size: 192, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !602, line: 55, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !602, line: 48, size: 192, elements: !841)
!841 = !{!842, !843, !844, !845, !846}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !840, file: !602, line: 50, baseType: !704, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !840, file: !602, line: 51, baseType: !704, size: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !840, file: !602, line: 52, baseType: !704, size: 32, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !840, file: !602, line: 53, baseType: !704, size: 32, offset: 96)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !840, file: !602, line: 54, baseType: !696, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !829, file: !602, line: 1606, baseType: !839, size: 192, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !829, file: !602, line: 1609, baseType: !774, size: 64, offset: 576)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !829, file: !602, line: 1610, baseType: !762, size: 64, offset: 640)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !829, file: !602, line: 1611, baseType: !839, size: 192, offset: 704)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !829, file: !602, line: 1612, baseType: !820, size: 64, offset: 896)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !829, file: !602, line: 1615, baseType: !697, size: 64, offset: 960)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !829, file: !602, line: 1616, baseType: !762, size: 64, offset: 1024)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !829, file: !602, line: 1617, baseType: !762, size: 64, offset: 1088)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !829, file: !602, line: 1618, baseType: !704, size: 32, offset: 1152)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !829, file: !602, line: 1619, baseType: !857, size: 64, offset: 1216)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !829, file: !602, line: 1626, baseType: !839, size: 192, offset: 1280)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !829, file: !602, line: 1628, baseType: !704, size: 32, offset: 1472)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !829, file: !602, line: 1629, baseType: !704, size: 32, offset: 1504)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !829, file: !602, line: 1631, baseType: !704, size: 32, offset: 1536)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !829, file: !602, line: 1632, baseType: !863, size: 128, offset: 1600)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !699, line: 1786, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !865, line: 8, size: 128, elements: !866)
!865 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!866 = !{!867, !871}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !864, file: !865, line: 10, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !869, line: 160, baseType: !870)
!869 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!870 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !864, file: !865, line: 11, baseType: !872, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !869, line: 162, baseType: !870)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !829, file: !602, line: 1633, baseType: !863, size: 128, offset: 1728)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !829, file: !602, line: 1634, baseType: !863, size: 128, offset: 1856)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !829, file: !602, line: 1636, baseType: !857, size: 64, offset: 1984)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !829, file: !602, line: 1637, baseType: !877, size: 64, offset: 2048)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !829, file: !602, line: 1638, baseType: !877, size: 64, offset: 2112)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !829, file: !602, line: 1639, baseType: !863, size: 128, offset: 2176)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !829, file: !602, line: 1640, baseType: !863, size: 128, offset: 2304)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !829, file: !602, line: 1641, baseType: !863, size: 128, offset: 2432)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !829, file: !602, line: 1642, baseType: !704, size: 32, offset: 2560)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !829, file: !602, line: 1643, baseType: !704, size: 32, offset: 2592)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !829, file: !602, line: 1645, baseType: !885, size: 192, offset: 2624)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !602, line: 92, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 85, size: 192, elements: !887)
!887 = !{!888, !890, !891, !893}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !886, file: !602, line: 87, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !602, line: 62, baseType: !704)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !886, file: !602, line: 88, baseType: !704, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !886, file: !602, line: 89, baseType: !892, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !699, line: 1687, baseType: !870)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !886, file: !602, line: 91, baseType: !704, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !829, file: !602, line: 1648, baseType: !704, size: 32, offset: 2816)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !829, file: !602, line: 1649, baseType: !704, size: 32, offset: 2848)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !829, file: !602, line: 1651, baseType: !897, size: 64, offset: 2880)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !602, line: 1582, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !602, line: 1682, size: 17280, elements: !900)
!900 = !{!901, !902, !903, !904, !915, !916, !917, !918, !919, !920, !922, !924, !925, !926, !927, !928, !929, !930, !931}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !899, file: !602, line: 1684, baseType: !827, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !899, file: !602, line: 1685, baseType: !704, size: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !899, file: !602, line: 1686, baseType: !704, size: 32, offset: 96)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !899, file: !602, line: 1691, baseType: !905, size: 4608, offset: 128)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 4608, elements: !913)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !899, file: !602, line: 1687, size: 384, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !906, file: !602, line: 1689, baseType: !706, size: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "room", scope: !906, file: !602, line: 1690, baseType: !910, size: 160, offset: 192)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 160, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 20)
!913 = !{!914}
!914 = !DISubrange(count: 12)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars", scope: !899, file: !602, line: 1692, baseType: !785, size: 2816, offset: 4736)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars_var", scope: !899, file: !602, line: 1693, baseType: !706, size: 192, offset: 7552)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars", scope: !899, file: !602, line: 1694, baseType: !785, size: 2816, offset: 7744)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars_var", scope: !899, file: !602, line: 1695, baseType: !706, size: 192, offset: 10560)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "l_varlist", scope: !899, file: !602, line: 1696, baseType: !728, size: 768, offset: 10752)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "l_listitems", scope: !899, file: !602, line: 1697, baseType: !921, size: 5120, offset: 11520)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 5120, elements: !911)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rettv", scope: !899, file: !602, line: 1698, baseType: !923, size: 64, offset: 16640)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !899, file: !602, line: 1699, baseType: !892, size: 64, offset: 16704)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "dbg_tick", scope: !899, file: !602, line: 1700, baseType: !704, size: 32, offset: 16768)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !899, file: !602, line: 1701, baseType: !704, size: 32, offset: 16800)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "prof_child", scope: !899, file: !602, line: 1703, baseType: !863, size: 128, offset: 16832)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !899, file: !602, line: 1705, baseType: !897, size: 64, offset: 16960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "fc_refcount", scope: !899, file: !602, line: 1709, baseType: !704, size: 32, offset: 17024)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fc_copyID", scope: !899, file: !602, line: 1711, baseType: !704, size: 32, offset: 17056)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fc_funcs", scope: !899, file: !602, line: 1712, baseType: !839, size: 192, offset: 17088)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name_exp", scope: !829, file: !602, line: 1653, baseType: !697, size: 64, offset: 2944)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name", scope: !829, file: !602, line: 1655, baseType: !934, size: 32, offset: 3008)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 32, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 4)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pt_auto", scope: !822, file: !602, line: 2001, baseType: !704, size: 32, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pt_outer", scope: !822, file: !602, line: 2005, baseType: !939, size: 256, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "outer_T", file: !602, line: 1986, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_S", file: !602, line: 1987, size: 256, elements: !941)
!941 = !{!942, !944, !945, !947}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "out_stack", scope: !940, file: !602, line: 1988, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame_idx", scope: !940, file: !602, line: 1989, baseType: !704, size: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "out_up", scope: !940, file: !602, line: 1990, baseType: !946, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "out_up_is_copy", scope: !940, file: !602, line: 1991, baseType: !704, size: 32, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pt_funcstack", scope: !822, file: !602, line: 2007, baseType: !949, size: 64, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "funcstack_T", file: !602, line: 1984, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcstack_S", file: !602, line: 1972, size: 320, elements: !952)
!952 = !{!953, !954, !955, !956, !957}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ga", scope: !951, file: !602, line: 1974, baseType: !839, size: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fs_var_offset", scope: !951, file: !602, line: 1978, baseType: !704, size: 32, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "fs_refcount", scope: !951, file: !602, line: 1981, baseType: !704, size: 32, offset: 224)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fs_min_refcount", scope: !951, file: !602, line: 1982, baseType: !704, size: 32, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fs_copyID", scope: !951, file: !602, line: 1983, baseType: !704, size: 32, offset: 288)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argc", scope: !822, file: !602, line: 2010, baseType: !704, size: 32, offset: 576)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argv", scope: !822, file: !602, line: 2011, baseType: !923, size: 64, offset: 640)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "pt_dict", scope: !822, file: !602, line: 2013, baseType: !784, size: 64, offset: 704)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pt_copyID", scope: !822, file: !602, line: 2014, baseType: !704, size: 32, offset: 768)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !717, file: !602, line: 1427, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !602, line: 1365, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !602, line: 2072, size: 1024, elements: !966)
!966 = !{!967, !968, !969, !973, !974, !975, !977, !978, !979, !980, !987, !2262, !2263, !2264, !2362}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !965, file: !602, line: 2074, baseType: !963, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !965, file: !602, line: 2075, baseType: !963, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !965, file: !602, line: 2077, baseType: !970, size: 32, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !971, line: 97, baseType: !972)
!971 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !869, line: 154, baseType: !704)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !965, file: !602, line: 2083, baseType: !697, size: 64, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !965, file: !602, line: 2084, baseType: !697, size: 64, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !965, file: !602, line: 2085, baseType: !976, size: 32, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !602, line: 2067, baseType: !637)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !965, file: !602, line: 2086, baseType: !697, size: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !965, file: !602, line: 2088, baseType: !697, size: 64, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !965, file: !602, line: 2093, baseType: !704, size: 32, offset: 512)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !965, file: !602, line: 2094, baseType: !981, size: 192, offset: 576)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !602, line: 1360, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 1356, size: 192, elements: !983)
!983 = !{!984, !985, !986}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !982, file: !602, line: 1357, baseType: !697, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !982, file: !602, line: 1358, baseType: !820, size: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !982, file: !602, line: 1359, baseType: !704, size: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !965, file: !602, line: 2096, baseType: !988, size: 64, offset: 768)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !602, line: 63, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !602, line: 2629, size: 73152, elements: !991)
!991 = !{!992, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1100, !1103, !1104, !1108, !1109, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1932, !1933, !1934, !1939, !1940, !1941, !1945, !1953, !1954, !1955, !1956, !1957, !1959, !1960, !1961, !1962, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2206, !2207, !2208, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2245, !2246, !2247, !2248, !2249, !2256, !2257, !2261}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !990, file: !602, line: 2631, baseType: !993, size: 832)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !602, line: 766, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !602, line: 737, size: 832, elements: !995)
!995 = !{!996, !997, !1058, !1067, !1068, !1069, !1070, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1085, !1086}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !994, file: !602, line: 739, baseType: !892, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !994, file: !602, line: 741, baseType: !998, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !602, line: 459, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !602, line: 671, size: 9856, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1026, !1027, !1028, !1029, !1030, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1055, !1056, !1057}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !1000, file: !602, line: 673, baseType: !697, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !1000, file: !602, line: 674, baseType: !697, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !1000, file: !602, line: 675, baseType: !704, size: 32, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !1000, file: !602, line: 676, baseType: !704, size: 32, offset: 160)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !1000, file: !602, line: 677, baseType: !704, size: 32, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !1000, file: !602, line: 678, baseType: !1008, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !602, line: 458, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !602, line: 506, size: 448, elements: !1011)
!1011 = !{!1012, !1021, !1022, !1023, !1024, !1025}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !1010, file: !602, line: 508, baseType: !1013, size: 192)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !602, line: 469, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !602, line: 471, size: 192, elements: !1015)
!1015 = !{!1016, !1018, !1019}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !1014, file: !602, line: 473, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !1014, file: !602, line: 474, baseType: !1017, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !1014, file: !602, line: 475, baseType: !1020, size: 64, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !602, line: 460, baseType: !870)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !1010, file: !602, line: 511, baseType: !1008, size: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !1010, file: !602, line: 512, baseType: !1008, size: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !1010, file: !602, line: 513, baseType: !697, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !1010, file: !602, line: 514, baseType: !704, size: 32, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !1010, file: !602, line: 518, baseType: !702, size: 8, offset: 416)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !1000, file: !602, line: 679, baseType: !1008, size: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !1000, file: !602, line: 680, baseType: !1008, size: 64, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !1000, file: !602, line: 681, baseType: !703, size: 32, offset: 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !1000, file: !602, line: 682, baseType: !703, size: 32, offset: 480)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !1000, file: !602, line: 683, baseType: !1031, size: 4352, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !602, line: 489, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !602, line: 480, size: 4352, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1038, !1042}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !1032, file: !602, line: 482, baseType: !797, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !1032, file: !602, line: 484, baseType: !797, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !1032, file: !602, line: 485, baseType: !1037, size: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !1032, file: !602, line: 487, baseType: !1039, size: 4096, offset: 192)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 4096, elements: !1040)
!1040 = !{!1041}
!1041 = !DISubrange(count: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !1032, file: !602, line: 488, baseType: !702, size: 8, offset: 4288)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !1000, file: !602, line: 684, baseType: !1031, size: 4352, offset: 4864)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !1000, file: !602, line: 685, baseType: !1020, size: 64, offset: 9216)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !1000, file: !602, line: 686, baseType: !1020, size: 64, offset: 9280)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !1000, file: !602, line: 687, baseType: !1020, size: 64, offset: 9344)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !1000, file: !602, line: 688, baseType: !1020, size: 64, offset: 9408)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !1000, file: !602, line: 689, baseType: !703, size: 32, offset: 9472)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !1000, file: !602, line: 690, baseType: !704, size: 32, offset: 9504)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !1000, file: !602, line: 692, baseType: !988, size: 64, offset: 9536)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !1000, file: !602, line: 693, baseType: !1052, size: 64, offset: 9600)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 64, elements: !1053)
!1053 = !{!1054}
!1054 = !DISubrange(count: 8)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !1000, file: !602, line: 697, baseType: !697, size: 64, offset: 9664)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !1000, file: !602, line: 698, baseType: !704, size: 32, offset: 9728)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !1000, file: !602, line: 699, baseType: !1052, size: 64, offset: 9760)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !994, file: !602, line: 743, baseType: !1059, size: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !602, line: 717, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !602, line: 711, size: 256, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1066}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !1061, file: !602, line: 713, baseType: !1020, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !1061, file: !602, line: 714, baseType: !892, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !1061, file: !602, line: 715, baseType: !892, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !1061, file: !602, line: 716, baseType: !704, size: 32, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !994, file: !602, line: 744, baseType: !704, size: 32, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !994, file: !602, line: 745, baseType: !704, size: 32, offset: 224)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !994, file: !602, line: 751, baseType: !704, size: 32, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !994, file: !602, line: 753, baseType: !1071, size: 32, offset: 288)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !699, line: 1688, baseType: !704)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !994, file: !602, line: 754, baseType: !892, size: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !994, file: !602, line: 755, baseType: !697, size: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !994, file: !602, line: 757, baseType: !1008, size: 64, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !994, file: !602, line: 758, baseType: !892, size: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !994, file: !602, line: 759, baseType: !892, size: 64, offset: 576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !994, file: !602, line: 760, baseType: !704, size: 32, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !994, file: !602, line: 762, baseType: !1079, size: 64, offset: 704)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !602, line: 724, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !602, line: 720, size: 128, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !1081, file: !602, line: 722, baseType: !704, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !1081, file: !602, line: 723, baseType: !870, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !994, file: !602, line: 763, baseType: !704, size: 32, offset: 768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !994, file: !602, line: 764, baseType: !704, size: 32, offset: 800)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !990, file: !602, line: 2634, baseType: !988, size: 64, offset: 832)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !990, file: !602, line: 2635, baseType: !988, size: 64, offset: 896)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !990, file: !602, line: 2637, baseType: !704, size: 32, offset: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !990, file: !602, line: 2639, baseType: !704, size: 32, offset: 992)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !990, file: !602, line: 2640, baseType: !704, size: 32, offset: 1024)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !990, file: !602, line: 2642, baseType: !704, size: 32, offset: 1056)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !990, file: !602, line: 2651, baseType: !697, size: 64, offset: 1088)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !990, file: !602, line: 2652, baseType: !697, size: 64, offset: 1152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !990, file: !602, line: 2654, baseType: !697, size: 64, offset: 1216)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !990, file: !602, line: 2658, baseType: !704, size: 32, offset: 1280)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !990, file: !602, line: 2659, baseType: !1098, size: 64, offset: 1344)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !971, line: 59, baseType: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !869, line: 145, baseType: !798)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !990, file: !602, line: 2660, baseType: !1101, size: 64, offset: 1408)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !971, line: 47, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !869, line: 148, baseType: !798)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !990, file: !602, line: 2667, baseType: !704, size: 32, offset: 1472)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !990, file: !602, line: 2668, baseType: !1105, size: 72, offset: 1504)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 72, elements: !1106)
!1106 = !{!1107}
!1107 = !DISubrange(count: 9)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !990, file: !602, line: 2672, baseType: !704, size: 32, offset: 1600)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !990, file: !602, line: 2674, baseType: !1110, size: 320, offset: 1664)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !602, line: 1532, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !602, line: 1526, size: 320, elements: !1112)
!1112 = !{!1113, !1114, !1115}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !1111, file: !602, line: 1528, baseType: !710, size: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !1111, file: !602, line: 1529, baseType: !698, size: 8, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !1111, file: !602, line: 1530, baseType: !1116, size: 136, offset: 136)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 136, elements: !1117)
!1117 = !{!1118}
!1118 = !DISubrange(count: 17)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !990, file: !602, line: 2679, baseType: !720, size: 64, offset: 1984)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !990, file: !602, line: 2681, baseType: !720, size: 64, offset: 2048)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !990, file: !602, line: 2684, baseType: !704, size: 32, offset: 2112)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !990, file: !602, line: 2691, baseType: !704, size: 32, offset: 2144)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !990, file: !602, line: 2693, baseType: !892, size: 64, offset: 2176)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !990, file: !602, line: 2694, baseType: !892, size: 64, offset: 2240)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !990, file: !602, line: 2696, baseType: !870, size: 64, offset: 2304)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !990, file: !602, line: 2699, baseType: !1127, size: 64, offset: 2368)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !602, line: 60, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !602, line: 325, size: 11648, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1927, !1928, !1929, !1930, !1931}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !1129, file: !602, line: 327, baseType: !1127, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !1129, file: !602, line: 328, baseType: !1127, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !1129, file: !602, line: 329, baseType: !1134, size: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !602, line: 59, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !602, line: 3365, size: 72064, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1142, !1297, !1298, !1313, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1370, !1371, !1372, !1373, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1394, !1395, !1397, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1418, !1419, !1420, !1421, !1422, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1482, !1483, !1484, !1485, !1486, !1739, !1747, !1748, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1840, !1841, !1842, !1843, !1884, !1885, !1895, !1896, !1897, !1898, !1899, !1919, !1920, !1921, !1922, !1926}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !1136, file: !602, line: 3367, baseType: !704, size: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !1136, file: !602, line: 3369, baseType: !988, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !1136, file: !602, line: 3371, baseType: !1134, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !1136, file: !602, line: 3372, baseType: !1134, size: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !1136, file: !602, line: 3375, baseType: !1143, size: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !602, line: 2618, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 2542, size: 9920, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1162, !1163, !1164, !1165, !1166, !1224, !1232, !1233, !1234, !1235, !1236, !1273, !1274, !1275, !1276, !1277, !1278, !1280, !1281, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1296}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !1145, file: !602, line: 2544, baseType: !793, size: 2432)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !1145, file: !602, line: 2545, baseType: !793, size: 2432, offset: 2432)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !1145, file: !602, line: 2546, baseType: !704, size: 32, offset: 4864)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !1145, file: !602, line: 2548, baseType: !704, size: 32, offset: 4896)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !1145, file: !602, line: 2550, baseType: !704, size: 32, offset: 4928)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !1145, file: !602, line: 2551, baseType: !704, size: 32, offset: 4960)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !1145, file: !602, line: 2552, baseType: !704, size: 32, offset: 4992)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !1145, file: !602, line: 2553, baseType: !839, size: 192, offset: 5056)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !1145, file: !602, line: 2554, baseType: !839, size: 192, offset: 5248)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !1145, file: !602, line: 2555, baseType: !704, size: 32, offset: 5440)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !1145, file: !602, line: 2556, baseType: !704, size: 32, offset: 5472)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !1145, file: !602, line: 2557, baseType: !704, size: 32, offset: 5504)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !1145, file: !602, line: 2559, baseType: !704, size: 32, offset: 5536)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !1145, file: !602, line: 2560, baseType: !1161, size: 16, offset: 5568)
!1161 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !1145, file: !602, line: 2561, baseType: !870, size: 64, offset: 5632)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !1145, file: !602, line: 2562, baseType: !870, size: 64, offset: 5696)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !1145, file: !602, line: 2563, baseType: !870, size: 64, offset: 5760)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !1145, file: !602, line: 2564, baseType: !697, size: 64, offset: 5824)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !1145, file: !602, line: 2565, baseType: !1167, size: 64, offset: 5888)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !1169, line: 56, baseType: !1170)
!1169 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !1169, line: 49, size: 192, elements: !1171)
!1171 = !{!1172, !1220, !1221, !1222, !1223}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !1170, file: !1169, line: 51, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !1169, line: 42, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !1169, line: 167, size: 320, elements: !1176)
!1176 = !{!1177, !1181, !1185, !1200, !1219}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !1175, file: !1169, line: 169, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!1167, !697, !704}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !1175, file: !1169, line: 170, baseType: !1182, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{null, !1167}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !1175, file: !1169, line: 171, baseType: !1186, size: 64, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!704, !1189, !697, !1071, !704}
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !1169, line: 137, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1169, line: 131, size: 1408, elements: !1192)
!1192 = !{!1193, !1194, !1198, !1199}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !1191, file: !1169, line: 133, baseType: !1167, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !1191, file: !1169, line: 134, baseType: !1195, size: 640, offset: 64)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 640, elements: !1196)
!1196 = !{!1197}
!1197 = !DISubrange(count: 10)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !1191, file: !1169, line: 135, baseType: !1195, size: 640, offset: 704)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !1191, file: !1169, line: 136, baseType: !704, size: 32, offset: 1344)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !1175, file: !1169, line: 172, baseType: !1201, size: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!870, !1204, !1134, !988, !892, !1071, !877, !857}
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !1169, line: 154, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1169, line: 147, size: 2688, elements: !1207)
!1207 = !{!1208, !1209, !1216, !1217, !1218}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !1206, file: !1169, line: 149, baseType: !1167, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !1206, file: !1169, line: 150, baseType: !1210, size: 1280, offset: 64)
!1210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1211, size: 1280, elements: !1196)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !602, line: 41, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 37, size: 128, elements: !1213)
!1213 = !{!1214, !1215}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !1212, file: !602, line: 39, baseType: !892, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1212, file: !602, line: 40, baseType: !1071, size: 32, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !1206, file: !1169, line: 151, baseType: !1210, size: 1280, offset: 1344)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !1206, file: !1169, line: 152, baseType: !704, size: 32, offset: 2624)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !1206, file: !1169, line: 153, baseType: !1071, size: 32, offset: 2656)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1175, file: !1169, line: 173, baseType: !697, size: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !1170, file: !1169, line: 52, baseType: !703, size: 32, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !1170, file: !1169, line: 53, baseType: !703, size: 32, offset: 96)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !1170, file: !1169, line: 54, baseType: !703, size: 32, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !1170, file: !1169, line: 55, baseType: !704, size: 32, offset: 160)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !1145, file: !602, line: 2567, baseType: !1225, size: 384, offset: 5952)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !602, line: 2475, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 2470, size: 384, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1226, file: !602, line: 2471, baseType: !863, size: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !1226, file: !602, line: 2472, baseType: !863, size: 128, offset: 128)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1226, file: !602, line: 2473, baseType: !870, size: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !1226, file: !602, line: 2474, baseType: !870, size: 64, offset: 320)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !1145, file: !602, line: 2569, baseType: !704, size: 32, offset: 6336)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !1145, file: !602, line: 2570, baseType: !704, size: 32, offset: 6368)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !1145, file: !602, line: 2572, baseType: !704, size: 32, offset: 6400)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !1145, file: !602, line: 2575, baseType: !704, size: 32, offset: 6432)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !1145, file: !602, line: 2592, baseType: !1237, size: 64, offset: 6464)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !602, line: 1061, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !602, line: 1063, size: 1728, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1265, !1266, !1267, !1269, !1272}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !1239, file: !602, line: 1065, baseType: !1237, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !1239, file: !602, line: 1066, baseType: !892, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !1239, file: !602, line: 1071, baseType: !1244, size: 1344, offset: 128)
!1244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1239, file: !602, line: 1067, size: 1344, elements: !1245)
!1245 = !{!1246, !1264}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !1244, file: !602, line: 1069, baseType: !1247, size: 1344)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1248, size: 1344, elements: !1262)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !602, line: 1055, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !602, line: 1046, size: 192, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1254, !1255}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !1249, file: !602, line: 1048, baseType: !704, size: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !1249, file: !602, line: 1049, baseType: !704, size: 32, offset: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !1249, file: !602, line: 1051, baseType: !704, size: 32, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !1249, file: !602, line: 1052, baseType: !704, size: 32, offset: 96)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !1249, file: !602, line: 1054, baseType: !1256, size: 64, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !1169, line: 165, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1169, line: 161, size: 704, elements: !1259)
!1259 = !{!1260, !1261}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1258, file: !1169, line: 163, baseType: !1161, size: 16)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !1258, file: !1169, line: 164, baseType: !1195, size: 640, offset: 64)
!1262 = !{!1263}
!1263 = !DISubrange(count: 7)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !1244, file: !602, line: 1070, baseType: !839, size: 192)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !1239, file: !602, line: 1072, baseType: !704, size: 32, offset: 1472)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !1239, file: !602, line: 1073, baseType: !704, size: 32, offset: 1504)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !1239, file: !602, line: 1074, baseType: !1268, size: 64, offset: 1536)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !1239, file: !602, line: 1076, baseType: !1270, size: 16, offset: 1600)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !699, line: 1689, baseType: !1271)
!1271 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !1239, file: !602, line: 1077, baseType: !892, size: 64, offset: 1664)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !1145, file: !602, line: 2593, baseType: !704, size: 32, offset: 6528)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !1145, file: !602, line: 2594, baseType: !1237, size: 64, offset: 6592)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !1145, file: !602, line: 2595, baseType: !1237, size: 64, offset: 6656)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !1145, file: !602, line: 2596, baseType: !704, size: 32, offset: 6720)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !1145, file: !602, line: 2597, baseType: !892, size: 64, offset: 6784)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !1145, file: !602, line: 2598, baseType: !1279, size: 16, offset: 6848)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !699, line: 325, baseType: !1271)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !1145, file: !602, line: 2603, baseType: !839, size: 192, offset: 6912)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !1145, file: !602, line: 2604, baseType: !1282, size: 2048, offset: 7104)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 2048, elements: !1283)
!1283 = !{!1284}
!1284 = !DISubrange(count: 256)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !1145, file: !602, line: 2605, baseType: !697, size: 64, offset: 9152)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !1145, file: !602, line: 2606, baseType: !697, size: 64, offset: 9216)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !1145, file: !602, line: 2607, baseType: !1167, size: 64, offset: 9280)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !1145, file: !602, line: 2608, baseType: !697, size: 64, offset: 9344)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !1145, file: !602, line: 2609, baseType: !697, size: 64, offset: 9408)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !1145, file: !602, line: 2610, baseType: !697, size: 64, offset: 9472)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !1145, file: !602, line: 2611, baseType: !704, size: 32, offset: 9536)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !1145, file: !602, line: 2616, baseType: !1293, size: 256, offset: 9568)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 256, elements: !1294)
!1294 = !{!1295}
!1295 = !DISubrange(count: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !1145, file: !602, line: 2617, baseType: !697, size: 64, offset: 9856)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !1136, file: !602, line: 3378, baseType: !704, size: 32, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !1136, file: !602, line: 3381, baseType: !1299, size: 64, offset: 384)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !602, line: 61, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !602, line: 3231, size: 512, elements: !1302)
!1302 = !{!1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !1301, file: !602, line: 3233, baseType: !702, size: 8)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !1301, file: !602, line: 3234, baseType: !704, size: 32, offset: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !1301, file: !602, line: 3235, baseType: !704, size: 32, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !1301, file: !602, line: 3236, baseType: !704, size: 32, offset: 96)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !1301, file: !602, line: 3237, baseType: !704, size: 32, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !1301, file: !602, line: 3238, baseType: !1299, size: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !1301, file: !602, line: 3239, baseType: !1299, size: 64, offset: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !1301, file: !602, line: 3241, baseType: !1299, size: 64, offset: 320)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !1301, file: !602, line: 3244, baseType: !1299, size: 64, offset: 384)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !1301, file: !602, line: 3245, baseType: !1134, size: 64, offset: 448)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !1136, file: !602, line: 3383, baseType: !1314, size: 128, offset: 448)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !602, line: 31, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 26, size: 128, elements: !1316)
!1316 = !{!1317, !1318, !1319}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !1315, file: !602, line: 28, baseType: !892, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1315, file: !602, line: 29, baseType: !1071, size: 32, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !1315, file: !602, line: 30, baseType: !1071, size: 32, offset: 96)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !1136, file: !602, line: 3385, baseType: !1071, size: 32, offset: 576)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !1136, file: !602, line: 3389, baseType: !704, size: 32, offset: 608)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !1136, file: !602, line: 3394, baseType: !892, size: 64, offset: 640)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !1136, file: !602, line: 3400, baseType: !702, size: 8, offset: 704)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !1136, file: !602, line: 3401, baseType: !892, size: 64, offset: 768)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !1136, file: !602, line: 3402, baseType: !1071, size: 32, offset: 832)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !1136, file: !602, line: 3403, baseType: !1071, size: 32, offset: 864)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !1136, file: !602, line: 3404, baseType: !892, size: 64, offset: 896)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !1136, file: !602, line: 3405, baseType: !1071, size: 32, offset: 960)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !1136, file: !602, line: 3406, baseType: !1071, size: 32, offset: 992)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !1136, file: !602, line: 3408, baseType: !1331, size: 352, offset: 1024)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !602, line: 3358, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 3343, size: 352, elements: !1333)
!1333 = !{!1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !1332, file: !602, line: 3345, baseType: !704, size: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1332, file: !602, line: 3346, baseType: !704, size: 32, offset: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !1332, file: !602, line: 3347, baseType: !704, size: 32, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !1332, file: !602, line: 3348, baseType: !704, size: 32, offset: 96)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1332, file: !602, line: 3349, baseType: !704, size: 32, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !1332, file: !602, line: 3350, baseType: !704, size: 32, offset: 160)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !1332, file: !602, line: 3351, baseType: !704, size: 32, offset: 192)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !1332, file: !602, line: 3352, baseType: !704, size: 32, offset: 224)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !1332, file: !602, line: 3353, baseType: !704, size: 32, offset: 256)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !1332, file: !602, line: 3354, baseType: !704, size: 32, offset: 288)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !1332, file: !602, line: 3356, baseType: !704, size: 32, offset: 320)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !1136, file: !602, line: 3414, baseType: !892, size: 64, offset: 1408)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !1136, file: !602, line: 3416, baseType: !702, size: 8, offset: 1472)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !1136, file: !602, line: 3419, baseType: !892, size: 64, offset: 1536)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !1136, file: !602, line: 3423, baseType: !704, size: 32, offset: 1600)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !1136, file: !602, line: 3424, baseType: !704, size: 32, offset: 1632)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !1136, file: !602, line: 3425, baseType: !704, size: 32, offset: 1664)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !1136, file: !602, line: 3427, baseType: !704, size: 32, offset: 1696)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !1136, file: !602, line: 3429, baseType: !1071, size: 32, offset: 1728)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !1136, file: !602, line: 3432, baseType: !1071, size: 32, offset: 1760)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !1136, file: !602, line: 3435, baseType: !704, size: 32, offset: 1792)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !1136, file: !602, line: 3437, baseType: !704, size: 32, offset: 1824)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !1136, file: !602, line: 3445, baseType: !704, size: 32, offset: 1856)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !1136, file: !602, line: 3446, baseType: !704, size: 32, offset: 1888)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !1136, file: !602, line: 3449, baseType: !704, size: 32, offset: 1920)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !1136, file: !602, line: 3450, baseType: !704, size: 32, offset: 1952)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !1136, file: !602, line: 3451, baseType: !704, size: 32, offset: 1984)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !1136, file: !602, line: 3452, baseType: !704, size: 32, offset: 2016)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !1136, file: !602, line: 3454, baseType: !1363, size: 320, offset: 2048)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !602, line: 3330, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 3324, size: 320, elements: !1365)
!1365 = !{!1366, !1367, !1368, !1369}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !1364, file: !602, line: 3326, baseType: !704, size: 32)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !1364, file: !602, line: 3327, baseType: !704, size: 32, offset: 32)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !1364, file: !602, line: 3328, baseType: !1314, size: 128, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !1364, file: !602, line: 3329, baseType: !1314, size: 128, offset: 192)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !1136, file: !602, line: 3457, baseType: !704, size: 32, offset: 2368)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !1136, file: !602, line: 3458, baseType: !704, size: 32, offset: 2400)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !1136, file: !602, line: 3459, baseType: !697, size: 64, offset: 2432)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !1136, file: !602, line: 3460, baseType: !1374, size: 32, offset: 2496)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !602, line: 2524, baseType: !656)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !1136, file: !602, line: 3461, baseType: !704, size: 32, offset: 2528)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !1136, file: !602, line: 3462, baseType: !704, size: 32, offset: 2560)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !1136, file: !602, line: 3463, baseType: !1134, size: 64, offset: 2624)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !1136, file: !602, line: 3464, baseType: !704, size: 32, offset: 2688)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !1136, file: !602, line: 3465, baseType: !704, size: 32, offset: 2720)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !1136, file: !602, line: 3466, baseType: !704, size: 32, offset: 2752)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !1136, file: !602, line: 3467, baseType: !704, size: 32, offset: 2784)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !1136, file: !602, line: 3468, baseType: !704, size: 32, offset: 2816)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !1136, file: !602, line: 3469, baseType: !704, size: 32, offset: 2848)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !1136, file: !602, line: 3470, baseType: !704, size: 32, offset: 2880)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !1136, file: !602, line: 3471, baseType: !704, size: 32, offset: 2912)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !1136, file: !602, line: 3472, baseType: !704, size: 32, offset: 2944)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !1136, file: !602, line: 3473, baseType: !704, size: 32, offset: 2976)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !1136, file: !602, line: 3474, baseType: !704, size: 32, offset: 3008)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !1136, file: !602, line: 3475, baseType: !704, size: 32, offset: 3040)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !1136, file: !602, line: 3476, baseType: !697, size: 64, offset: 3072)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !1136, file: !602, line: 3477, baseType: !697, size: 64, offset: 3136)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !1136, file: !602, line: 3478, baseType: !1393, size: 128, offset: 3200)
!1393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 128, elements: !935)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !1136, file: !602, line: 3479, baseType: !1393, size: 128, offset: 3328)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !1136, file: !602, line: 3480, baseType: !1396, size: 256, offset: 3456)
!1396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 256, elements: !935)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !1136, file: !602, line: 3481, baseType: !1398, size: 256, offset: 3712)
!1398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 256, elements: !1053)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !1136, file: !602, line: 3483, baseType: !704, size: 32, offset: 3968)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !1136, file: !602, line: 3484, baseType: !704, size: 32, offset: 4000)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !1136, file: !602, line: 3485, baseType: !720, size: 64, offset: 4032)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !1136, file: !602, line: 3487, baseType: !720, size: 64, offset: 4096)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !1136, file: !602, line: 3490, baseType: !704, size: 32, offset: 4160)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !1136, file: !602, line: 3493, baseType: !892, size: 64, offset: 4224)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !1136, file: !602, line: 3495, baseType: !981, size: 192, offset: 4288)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !1136, file: !602, line: 3496, baseType: !981, size: 192, offset: 4480)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !1136, file: !602, line: 3497, baseType: !704, size: 32, offset: 4672)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !1136, file: !602, line: 3498, baseType: !704, size: 32, offset: 4704)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !1136, file: !602, line: 3500, baseType: !1134, size: 64, offset: 4736)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !1136, file: !602, line: 3501, baseType: !892, size: 64, offset: 4800)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !1136, file: !602, line: 3502, baseType: !1071, size: 32, offset: 4864)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !1136, file: !602, line: 3503, baseType: !1071, size: 32, offset: 4896)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !1136, file: !602, line: 3504, baseType: !704, size: 32, offset: 4928)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !1136, file: !602, line: 3505, baseType: !704, size: 32, offset: 4960)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !1136, file: !602, line: 3506, baseType: !704, size: 32, offset: 4992)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !1136, file: !602, line: 3507, baseType: !1417, size: 32, offset: 5024)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !602, line: 2530, baseType: !664)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !1136, file: !602, line: 3509, baseType: !727, size: 64, offset: 5056)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !1136, file: !602, line: 3510, baseType: !697, size: 64, offset: 5120)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !1136, file: !602, line: 3511, baseType: !704, size: 32, offset: 5184)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !1136, file: !602, line: 3512, baseType: !704, size: 32, offset: 5216)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !1136, file: !602, line: 3514, baseType: !1423, size: 64, offset: 5248)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !602, line: 2478, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !602, line: 2479, size: 704, elements: !1426)
!1426 = !{!1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !1425, file: !602, line: 2481, baseType: !870, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !1425, file: !602, line: 2483, baseType: !1423, size: 64, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !1425, file: !602, line: 2484, baseType: !1423, size: 64, offset: 128)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !1425, file: !602, line: 2485, baseType: !863, size: 128, offset: 192)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !1425, file: !602, line: 2486, baseType: !702, size: 8, offset: 320)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !1425, file: !602, line: 2487, baseType: !702, size: 8, offset: 328)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !1425, file: !602, line: 2488, baseType: !704, size: 32, offset: 352)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !1425, file: !602, line: 2489, baseType: !870, size: 64, offset: 384)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !1425, file: !602, line: 2490, baseType: !981, size: 192, offset: 448)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !1425, file: !602, line: 2491, baseType: !704, size: 32, offset: 640)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !1136, file: !602, line: 3517, baseType: !704, size: 32, offset: 5312)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !1136, file: !602, line: 3534, baseType: !704, size: 32, offset: 5344)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !1136, file: !602, line: 3535, baseType: !1314, size: 128, offset: 5376)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !1136, file: !602, line: 3537, baseType: !1071, size: 32, offset: 5504)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !1136, file: !602, line: 3543, baseType: !704, size: 32, offset: 5536)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !1136, file: !602, line: 3545, baseType: !704, size: 32, offset: 5568)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !1136, file: !602, line: 3548, baseType: !704, size: 32, offset: 5600)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !1136, file: !602, line: 3550, baseType: !1071, size: 32, offset: 5632)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !1136, file: !602, line: 3562, baseType: !704, size: 32, offset: 5664)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !1136, file: !602, line: 3562, baseType: !704, size: 32, offset: 5696)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !1136, file: !602, line: 3574, baseType: !704, size: 32, offset: 5728)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !1136, file: !602, line: 3575, baseType: !1449, size: 64, offset: 5760)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !602, line: 3225, baseType: !1451)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !602, line: 3216, size: 192, elements: !1452)
!1452 = !{!1453, !1454, !1455, !1456, !1457}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !1451, file: !602, line: 3218, baseType: !892, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !1451, file: !602, line: 3219, baseType: !1279, size: 16, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !1451, file: !602, line: 3220, baseType: !702, size: 8, offset: 80)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !1451, file: !602, line: 3222, baseType: !702, size: 8, offset: 88)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !1451, file: !602, line: 3223, baseType: !892, size: 64, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !1136, file: !602, line: 3578, baseType: !839, size: 192, offset: 5824)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !1136, file: !602, line: 3579, baseType: !702, size: 8, offset: 6016)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !1136, file: !602, line: 3581, baseType: !702, size: 8, offset: 6024)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !1136, file: !602, line: 3585, baseType: !704, size: 32, offset: 6048)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !1136, file: !602, line: 3593, baseType: !704, size: 32, offset: 6080)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !1136, file: !602, line: 3594, baseType: !704, size: 32, offset: 6112)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_top", scope: !1136, file: !602, line: 3596, baseType: !892, size: 64, offset: 6144)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_bot", scope: !1136, file: !602, line: 3597, baseType: !892, size: 64, offset: 6208)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_status", scope: !1136, file: !602, line: 3598, baseType: !704, size: 32, offset: 6272)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_cursor", scope: !1136, file: !602, line: 3602, baseType: !1314, size: 128, offset: 6336)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_virtcol", scope: !1136, file: !602, line: 3603, baseType: !1071, size: 32, offset: 6464)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topline", scope: !1136, file: !602, line: 3604, baseType: !892, size: 64, offset: 6528)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_line_count", scope: !1136, file: !602, line: 3605, baseType: !892, size: 64, offset: 6592)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topfill", scope: !1136, file: !602, line: 3607, baseType: !704, size: 32, offset: 6656)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_empty", scope: !1136, file: !602, line: 3609, baseType: !702, size: 8, offset: 6688)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "w_alt_fnum", scope: !1136, file: !602, line: 3612, baseType: !704, size: 32, offset: 6720)
