; ModuleID = 'textformat.c'
source_filename = "textformat.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!616 = distinct !DILexicalBlock(scope: !171, file: !3, line: 356, column: 6)
!617 = !DILocation(line: 360, column: 6, scope: !200)
!618 = !DILocation(line: 369, column: 21, scope: !619)
!619 = distinct !DILexicalBlock(scope: !197, file: !3, line: 369, column: 7)
!620 = !DILocation(line: 369, column: 25, scope: !619)
!621 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !622)
!622 = distinct !DILocation(line: 369, column: 28, scope: !619)
!623 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !622)
!624 = !DILocation(line: 28, column: 9, scope: !109, inlinedAt: !622)
!625 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !622)
!626 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !622)
!627 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !622)
!628 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !622)
!629 = !DILocation(line: 369, column: 7, scope: !197)
!630 = !DILocation(line: 371, column: 24, scope: !619)
!631 = !DILocation(line: 371, column: 41, scope: !619)
!632 = !DILocation(line: 371, column: 46, scope: !619)
!633 = !DILocation(line: 371, column: 6, scope: !619)
!634 = !DILocation(line: 372, column: 21, scope: !196)
!635 = !DILocation(line: 372, column: 7, scope: !197)
!636 = !DILocation(line: 374, column: 11, scope: !194)
!637 = !DILocation(line: 374, column: 17, scope: !194)
!638 = !DILocation(line: 374, column: 11, scope: !195)
!639 = !DILocation(line: 375, column: 4, scope: !194)
!640 = !DILocation(line: 378, column: 19, scope: !193)
!641 = !DILocation(line: 378, column: 23, scope: !193)
!642 = !DILocation(line: 378, column: 40, scope: !193)
!643 = !DILocation(line: 378, column: 53, scope: !193)
!644 = !DILocation(line: 378, column: 8, scope: !194)
!645 = !DILocation(line: 390, column: 8, scope: !646)
!646 = distinct !DILexicalBlock(scope: !647, file: !3, line: 389, column: 4)
!647 = distinct !DILexicalBlock(scope: !192, file: !3, line: 389, column: 4)
!648 = !DILocation(line: 380, column: 8, scope: !192)
!649 = !DILocation(line: 389, column: 30, scope: !646)
!650 = !DILocation(line: 389, column: 18, scope: !646)
!651 = !DILocation(line: 389, column: 4, scope: !647)
!652 = distinct !{!652, !651, !653}
!653 = !DILocation(line: 390, column: 29, scope: !647)
!654 = !DILocation(line: 394, column: 10, scope: !655)
!655 = distinct !DILexicalBlock(scope: !193, file: !3, line: 393, column: 7)
!656 = !DILocation(line: 401, column: 6, scope: !657)
!657 = distinct !DILexicalBlock(scope: !171, file: !3, line: 401, column: 6)
!658 = !DILocation(line: 401, column: 12, scope: !657)
!659 = !DILocation(line: 401, column: 6, scope: !171)
!660 = !DILocation(line: 405, column: 6, scope: !661)
!661 = distinct !DILexicalBlock(scope: !657, file: !3, line: 402, column: 2)
!662 = !DILocation(line: 406, column: 6, scope: !661)
!663 = !DILocation(line: 407, column: 2, scope: !661)
!664 = !DILocation(line: 412, column: 6, scope: !665)
!665 = distinct !DILexicalBlock(scope: !657, file: !3, line: 409, column: 2)
!666 = !DILocation(line: 412, column: 23, scope: !665)
!667 = !DILocation(line: 412, column: 27, scope: !665)
!668 = !DILocation(line: 413, column: 21, scope: !665)
!669 = !DILocation(line: 413, column: 12, scope: !665)
!670 = !DILocation(line: 85, column: 10, scope: !171)
!671 = !DILocation(line: 414, column: 10, scope: !672)
!672 = distinct !DILexicalBlock(scope: !665, file: !3, line: 414, column: 10)
!673 = !DILocation(line: 414, column: 27, scope: !672)
!674 = !DILocation(line: 414, column: 31, scope: !672)
!675 = !DILocation(line: 414, column: 10, scope: !665)
!676 = !DILocation(line: 415, column: 24, scope: !672)
!677 = !DILocation(line: 415, column: 3, scope: !672)
!678 = !DILocation(line: 420, column: 2, scope: !171)
!679 = !DILocation(line: 423, column: 9, scope: !171)
!680 = !DILocation(line: 425, column: 9, scope: !171)
!681 = !DILocation(line: 426, column: 9, scope: !171)
!682 = !DILocation(line: 427, column: 14, scope: !171)
!683 = !DILocation(line: 429, column: 2, scope: !171)
!684 = distinct !{!684, !277, !685}
!685 = !DILocation(line: 430, column: 5, scope: !148)
!686 = !DILocation(line: 432, column: 19, scope: !687)
!687 = distinct !DILexicalBlock(scope: !148, file: !3, line: 432, column: 9)
!688 = !DILocation(line: 432, column: 9, scope: !148)
!689 = !DILocation(line: 433, column: 2, scope: !687)
!690 = !DILocation(line: 436, column: 5, scope: !148)
!691 = !DILocation(line: 436, column: 13, scope: !148)
!692 = !DILocation(line: 436, column: 21, scope: !148)
!693 = !DILocation(line: 438, column: 10, scope: !694)
!694 = distinct !DILexicalBlock(scope: !148, file: !3, line: 438, column: 9)
!695 = !DILocation(line: 438, column: 25, scope: !694)
!696 = !DILocation(line: 438, column: 22, scope: !694)
!697 = !DILocation(line: 440, column: 2, scope: !698)
!698 = distinct !DILexicalBlock(scope: !694, file: !3, line: 439, column: 5)
!699 = !DILocation(line: 441, column: 2, scope: !698)
!700 = !DILocation(line: 442, column: 5, scope: !698)
!701 = !DILocation(line: 443, column: 1, scope: !148)
!702 = distinct !DISubprogram(name: "auto_format", scope: !3, file: !3, line: 620, type: !703, isLocal: false, isDefinition: true, scopeLine: 623, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !705)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !92, !92}
!705 = !{!706, !707, !708, !715, !716, !717, !718, !719, !720}
!706 = !DILocalVariable(name: "trailblank", arg: 1, scope: !702, file: !3, line: 621, type: !92)
!707 = !DILocalVariable(name: "prev_line", arg: 2, scope: !702, file: !3, line: 622, type: !92)
!708 = !DILocalVariable(name: "pos", scope: !702, file: !3, line: 624, type: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !6, line: 31, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 26, size: 128, elements: !711)
!711 = !{!712, !713, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !710, file: !6, line: 28, baseType: !98, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !710, file: !6, line: 29, baseType: !90, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !710, file: !6, line: 30, baseType: !90, size: 32, offset: 96)
!715 = !DILocalVariable(name: "len", scope: !702, file: !3, line: 625, type: !90)
!716 = !DILocalVariable(name: "old", scope: !702, file: !3, line: 626, type: !93)
!717 = !DILocalVariable(name: "new", scope: !702, file: !3, line: 627, type: !93)
!718 = !DILocalVariable(name: "pnew", scope: !702, file: !3, line: 627, type: !93)
!719 = !DILocalVariable(name: "wasatend", scope: !702, file: !3, line: 628, type: !92)
!720 = !DILocalVariable(name: "cc", scope: !702, file: !3, line: 629, type: !92)
!721 = !DILocation(line: 621, column: 10, scope: !702)
!722 = !DILocation(line: 622, column: 10, scope: !702)
!723 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !724)
!724 = distinct !DILocation(line: 631, column: 10, scope: !725)
!725 = distinct !DILexicalBlock(scope: !702, file: !3, line: 631, column: 9)
!726 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !724)
!727 = !DILocation(line: 28, column: 9, scope: !109, inlinedAt: !724)
!728 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !724)
!729 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !724)
!730 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !724)
!731 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !724)
!732 = !DILocation(line: 631, column: 9, scope: !702)
!733 = !DILocation(line: 634, column: 11, scope: !702)
!734 = !DILocation(line: 634, column: 19, scope: !702)
!735 = !DILocation(line: 624, column: 11, scope: !702)
!736 = !DILocation(line: 635, column: 11, scope: !702)
!737 = !DILocation(line: 626, column: 13, scope: !702)
!738 = !DILocation(line: 638, column: 5, scope: !702)
!739 = !DILocation(line: 645, column: 37, scope: !702)
!740 = !DILocation(line: 645, column: 28, scope: !702)
!741 = !DILocation(line: 645, column: 25, scope: !702)
!742 = !DILocation(line: 646, column: 9, scope: !743)
!743 = distinct !DILexicalBlock(scope: !702, file: !3, line: 646, column: 9)
!744 = !DILocation(line: 646, column: 14, scope: !743)
!745 = !DILocation(line: 646, column: 25, scope: !743)
!746 = !DILocation(line: 646, column: 21, scope: !743)
!747 = !DILocation(line: 648, column: 2, scope: !748)
!748 = distinct !DILexicalBlock(scope: !743, file: !3, line: 647, column: 5)
!749 = !DILocation(line: 649, column: 7, scope: !748)
!750 = !DILocation(line: 629, column: 10, scope: !702)
!751 = !DILocation(line: 650, column: 7, scope: !752)
!752 = distinct !DILexicalBlock(scope: !748, file: !3, line: 650, column: 6)
!753 = !DILocation(line: 650, column: 21, scope: !752)
!754 = !DILocation(line: 650, column: 24, scope: !752)
!755 = !DILocation(line: 650, column: 41, scope: !752)
!756 = !DILocation(line: 650, column: 45, scope: !752)
!757 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !758)
!758 = distinct !DILocation(line: 651, column: 11, scope: !752)
!759 = !DILocation(line: 651, column: 8, scope: !752)
!760 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !758)
!761 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !758)
!762 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !758)
!763 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !758)
!764 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !758)
!765 = !DILocation(line: 650, column: 6, scope: !748)
!766 = !DILocation(line: 652, column: 6, scope: !752)
!767 = !DILocation(line: 653, column: 7, scope: !748)
!768 = !DILocation(line: 654, column: 6, scope: !769)
!769 = distinct !DILexicalBlock(scope: !748, file: !3, line: 654, column: 6)
!770 = !DILocation(line: 654, column: 6, scope: !748)
!771 = !DILocation(line: 656, column: 6, scope: !772)
!772 = distinct !DILexicalBlock(scope: !769, file: !3, line: 655, column: 2)
!773 = !DILocation(line: 656, column: 25, scope: !772)
!774 = !DILocation(line: 657, column: 6, scope: !772)
!775 = !DILocation(line: 659, column: 2, scope: !748)
!776 = !DILocation(line: 659, column: 21, scope: !748)
!777 = !DILocation(line: 660, column: 5, scope: !748)
!778 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !779)
!779 = distinct !DILocation(line: 664, column: 9, scope: !780)
!780 = distinct !DILexicalBlock(scope: !702, file: !3, line: 664, column: 9)
!781 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !779)
!782 = !DILocation(line: 28, column: 9, scope: !109, inlinedAt: !779)
!783 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !779)
!784 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !779)
!785 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !779)
!786 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !779)
!787 = !DILocation(line: 664, column: 41, scope: !780)
!788 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !789)
!789 = distinct !DILocation(line: 664, column: 45, scope: !780)
!790 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !789)
!791 = !DILocation(line: 28, column: 9, scope: !109, inlinedAt: !789)
!792 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !789)
!793 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !789)
!794 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !789)
!795 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !789)
!796 = !DILocation(line: 665, column: 5, scope: !780)
!797 = !DILocation(line: 665, column: 8, scope: !780)
!798 = !DILocation(line: 665, column: 47, scope: !780)
!799 = !DILocation(line: 664, column: 9, scope: !702)
!800 = !DILocation(line: 671, column: 9, scope: !801)
!801 = distinct !DILexicalBlock(scope: !702, file: !3, line: 671, column: 9)
!802 = !DILocation(line: 671, column: 19, scope: !801)
!803 = !DILocation(line: 671, column: 39, scope: !801)
!804 = !DILocation(line: 671, column: 56, scope: !801)
!805 = !DILocalVariable(name: "lnum", arg: 1, scope: !806, file: !3, line: 576, type: !98)
!806 = distinct !DISubprogram(name: "paragraph_start", scope: !3, file: !3, line: 576, type: !807, isLocal: true, isDefinition: true, scopeLine: 577, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{!92, !98}
!809 = !{!805, !810, !811, !812, !813, !814, !815}
!810 = !DILocalVariable(name: "p", scope: !806, file: !3, line: 578, type: !93)
!811 = !DILocalVariable(name: "leader_len", scope: !806, file: !3, line: 579, type: !92)
!812 = !DILocalVariable(name: "leader_flags", scope: !806, file: !3, line: 580, type: !93)
!813 = !DILocalVariable(name: "next_leader_len", scope: !806, file: !3, line: 581, type: !92)
!814 = !DILocalVariable(name: "next_leader_flags", scope: !806, file: !3, line: 582, type: !93)
!815 = !DILocalVariable(name: "do_comments", scope: !806, file: !3, line: 583, type: !92)
!816 = !DILocation(line: 576, column: 26, scope: !806, inlinedAt: !817)
!817 = distinct !DILocation(line: 671, column: 23, scope: !801)
!818 = !DILocation(line: 579, column: 5, scope: !806, inlinedAt: !817)
!819 = !DILocation(line: 579, column: 10, scope: !806, inlinedAt: !817)
!820 = !DILocation(line: 580, column: 5, scope: !806, inlinedAt: !817)
!821 = !DILocation(line: 580, column: 13, scope: !806, inlinedAt: !817)
!822 = !DILocation(line: 581, column: 5, scope: !806, inlinedAt: !817)
!823 = !DILocation(line: 582, column: 5, scope: !806, inlinedAt: !817)
!824 = !DILocation(line: 585, column: 14, scope: !825, inlinedAt: !817)
!825 = distinct !DILexicalBlock(scope: !806, file: !3, line: 585, column: 9)
!826 = !DILocation(line: 585, column: 9, scope: !806, inlinedAt: !817)
!827 = !DILocation(line: 588, column: 21, scope: !806, inlinedAt: !817)
!828 = !DILocation(line: 588, column: 9, scope: !806, inlinedAt: !817)
!829 = !DILocation(line: 578, column: 13, scope: !806, inlinedAt: !817)
!830 = !DILocation(line: 589, column: 9, scope: !831, inlinedAt: !817)
!831 = distinct !DILexicalBlock(scope: !806, file: !3, line: 589, column: 9)
!832 = !DILocation(line: 589, column: 12, scope: !831, inlinedAt: !817)
!833 = !DILocation(line: 589, column: 9, scope: !806, inlinedAt: !817)
!834 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !835)
!835 = distinct !DILocation(line: 592, column: 19, scope: !806, inlinedAt: !817)
!836 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !835)
!837 = !DILocation(line: 28, column: 9, scope: !109, inlinedAt: !835)
!838 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !835)
!839 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !835)
!840 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !835)
!841 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !835)
!842 = !DILocation(line: 30, column: 5, scope: !109, inlinedAt: !835)
!843 = !DILocation(line: 583, column: 10, scope: !806, inlinedAt: !817)
!844 = !DILocation(line: 593, column: 9, scope: !845, inlinedAt: !817)
!845 = distinct !DILexicalBlock(scope: !806, file: !3, line: 593, column: 9)
!846 = !DILocation(line: 593, column: 9, scope: !806, inlinedAt: !817)
!847 = !DILocation(line: 581, column: 10, scope: !806, inlinedAt: !817)
!848 = !DILocation(line: 582, column: 13, scope: !806, inlinedAt: !817)
!849 = !DILocation(line: 596, column: 9, scope: !850, inlinedAt: !817)
!850 = distinct !DILexicalBlock(scope: !806, file: !3, line: 596, column: 9)
!851 = !DILocation(line: 596, column: 9, scope: !806, inlinedAt: !817)
!852 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !853)
!853 = distinct !DILocation(line: 599, column: 9, scope: !854, inlinedAt: !817)
!854 = distinct !DILexicalBlock(scope: !806, file: !3, line: 599, column: 9)
!855 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !853)
!856 = !DILocation(line: 28, column: 9, scope: !109, inlinedAt: !853)
!857 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !853)
!858 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !853)
!859 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !853)
!860 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !853)
!861 = !DILocation(line: 599, column: 41, scope: !854, inlinedAt: !817)
!862 = !DILocalVariable(name: "lnum", arg: 1, scope: !863, file: !3, line: 486, type: !98)
!863 = distinct !DISubprogram(name: "ends_in_white", scope: !3, file: !3, line: 486, type: !807, isLocal: true, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !864)
!864 = !{!862, !865, !866}
!865 = !DILocalVariable(name: "s", scope: !863, file: !3, line: 488, type: !93)
!866 = !DILocalVariable(name: "l", scope: !863, file: !3, line: 489, type: !100)
!867 = !DILocation(line: 486, column: 24, scope: !863, inlinedAt: !868)
!868 = distinct !DILocation(line: 599, column: 45, scope: !854, inlinedAt: !817)
!869 = !DILocation(line: 488, column: 17, scope: !863, inlinedAt: !868)
!870 = !DILocation(line: 488, column: 13, scope: !863, inlinedAt: !868)
!871 = !DILocation(line: 491, column: 9, scope: !872, inlinedAt: !868)
!872 = distinct !DILexicalBlock(scope: !863, file: !3, line: 491, column: 9)
!873 = !DILocation(line: 491, column: 12, scope: !872, inlinedAt: !868)
!874 = !DILocation(line: 491, column: 9, scope: !863, inlinedAt: !868)
!875 = !DILocation(line: 495, column: 9, scope: !863, inlinedAt: !868)
!876 = !DILocation(line: 495, column: 19, scope: !863, inlinedAt: !868)
!877 = !DILocation(line: 489, column: 12, scope: !863, inlinedAt: !868)
!878 = !DILocation(line: 496, column: 12, scope: !863, inlinedAt: !868)
!879 = !DILocation(line: 599, column: 9, scope: !806, inlinedAt: !817)
!880 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !881)
!881 = distinct !DILocation(line: 602, column: 9, scope: !882, inlinedAt: !817)
!882 = distinct !DILexicalBlock(scope: !806, file: !3, line: 602, column: 9)
!883 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !881)
!884 = !DILocation(line: 28, column: 9, scope: !109, inlinedAt: !881)
!885 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !881)
!886 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !881)
!887 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !881)
!888 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !881)
!889 = !DILocation(line: 602, column: 40, scope: !882, inlinedAt: !817)
!890 = !DILocation(line: 602, column: 44, scope: !882, inlinedAt: !817)
!891 = !DILocation(line: 602, column: 68, scope: !882, inlinedAt: !817)
!892 = !DILocation(line: 602, column: 9, scope: !806, inlinedAt: !817)
!893 = !DILocation(line: 605, column: 32, scope: !894, inlinedAt: !817)
!894 = distinct !DILexicalBlock(scope: !806, file: !3, line: 605, column: 9)
!895 = !DILocation(line: 605, column: 44, scope: !894, inlinedAt: !817)
!896 = !DILocation(line: 606, column: 8, scope: !894, inlinedAt: !817)
!897 = !DILocation(line: 606, column: 25, scope: !894, inlinedAt: !817)
!898 = !DILocation(line: 605, column: 10, scope: !894, inlinedAt: !817)
!899 = !DILocation(line: 610, column: 1, scope: !806, inlinedAt: !817)
!900 = !DILocation(line: 671, column: 9, scope: !702)
!901 = !DILocation(line: 673, column: 4, scope: !902)
!902 = distinct !DILexicalBlock(scope: !801, file: !3, line: 672, column: 5)
!903 = !DILocation(line: 673, column: 21, scope: !902)
!904 = !DILocation(line: 673, column: 2, scope: !902)
!905 = !DILocation(line: 674, column: 6, scope: !906)
!906 = distinct !DILexicalBlock(scope: !902, file: !3, line: 674, column: 6)
!907 = !DILocation(line: 674, column: 22, scope: !906)
!908 = !DILocation(line: 674, column: 6, scope: !902)
!909 = !DILocation(line: 680, column: 20, scope: !702)
!910 = !DILocation(line: 681, column: 5, scope: !702)
!911 = !DILocation(line: 682, column: 5, scope: !702)
!912 = !DILocation(line: 682, column: 13, scope: !702)
!913 = !DILocation(line: 682, column: 24, scope: !702)
!914 = !{i64 0, i64 8, !915, i64 8, i64 4, !117, i64 12, i64 4, !117}
!915 = !{!129, !129, i64 0}
!916 = !DILocation(line: 683, column: 23, scope: !702)
!917 = !DILocation(line: 685, column: 26, scope: !918)
!918 = distinct !DILexicalBlock(scope: !702, file: !3, line: 685, column: 9)
!919 = !DILocation(line: 685, column: 33, scope: !918)
!920 = !DILocation(line: 685, column: 46, scope: !918)
!921 = !{!127, !129, i64 0}
!922 = !DILocation(line: 685, column: 31, scope: !918)
!923 = !DILocation(line: 685, column: 9, scope: !702)
!924 = !DILocation(line: 688, column: 24, scope: !925)
!925 = distinct !DILexicalBlock(scope: !918, file: !3, line: 686, column: 5)
!926 = !DILocation(line: 689, column: 2, scope: !925)
!927 = !DILocation(line: 690, column: 5, scope: !925)
!928 = !DILocation(line: 692, column: 2, scope: !918)
!929 = !DILocation(line: 698, column: 19, scope: !930)
!930 = distinct !DILexicalBlock(scope: !702, file: !3, line: 698, column: 9)
!931 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !932)
!932 = distinct !DILocation(line: 698, column: 22, scope: !930)
!933 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !932)
!934 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !932)
!935 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !932)
!936 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !932)
!937 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !932)
!938 = !DILocation(line: 698, column: 9, scope: !702)
!939 = !DILocation(line: 700, column: 8, scope: !940)
!940 = distinct !DILexicalBlock(scope: !930, file: !3, line: 699, column: 5)
!941 = !DILocation(line: 627, column: 13, scope: !702)
!942 = !DILocation(line: 701, column: 17, scope: !940)
!943 = !DILocation(line: 701, column: 8, scope: !940)
!944 = !DILocation(line: 625, column: 13, scope: !702)
!945 = !DILocation(line: 702, column: 6, scope: !946)
!946 = distinct !DILexicalBlock(scope: !940, file: !3, line: 702, column: 6)
!947 = !DILocation(line: 702, column: 23, scope: !946)
!948 = !DILocation(line: 702, column: 27, scope: !946)
!949 = !DILocation(line: 702, column: 6, scope: !940)
!950 = !DILocation(line: 704, column: 31, scope: !951)
!951 = distinct !DILexicalBlock(scope: !946, file: !3, line: 703, column: 2)
!952 = !DILocation(line: 704, column: 13, scope: !951)
!953 = !DILocation(line: 627, column: 19, scope: !702)
!954 = !DILocation(line: 705, column: 6, scope: !951)
!955 = !DILocation(line: 705, column: 16, scope: !951)
!956 = !DILocation(line: 706, column: 6, scope: !951)
!957 = !DILocation(line: 706, column: 20, scope: !951)
!958 = !DILocation(line: 707, column: 17, scope: !951)
!959 = !DILocation(line: 707, column: 34, scope: !951)
!960 = !DILocation(line: 707, column: 6, scope: !951)
!961 = !DILocation(line: 710, column: 2, scope: !951)
!962 = !DILocation(line: 713, column: 6, scope: !946)
!963 = !DILocation(line: 716, column: 5, scope: !702)
!964 = !DILocation(line: 717, column: 1, scope: !702)
!965 = distinct !DISubprogram(name: "check_auto_format", scope: !3, file: !3, line: 725, type: !966, isLocal: false, isDefinition: true, scopeLine: 727, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !968)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !92}
!968 = !{!969, !970, !971}
!969 = !DILocalVariable(name: "end_insert", arg: 1, scope: !965, file: !3, line: 726, type: !92)
!970 = !DILocalVariable(name: "c", scope: !965, file: !3, line: 728, type: !92)
!971 = !DILocalVariable(name: "cc", scope: !965, file: !3, line: 729, type: !92)
!972 = !DILocation(line: 726, column: 10, scope: !965)
!973 = !DILocation(line: 728, column: 10, scope: !965)
!974 = !DILocation(line: 731, column: 9, scope: !965)
!975 = !DILocation(line: 733, column: 7, scope: !976)
!976 = distinct !DILexicalBlock(scope: !977, file: !3, line: 732, column: 5)
!977 = distinct !DILexicalBlock(scope: !965, file: !3, line: 731, column: 9)
!978 = !DILocation(line: 729, column: 10, scope: !965)
!979 = !DILocation(line: 734, column: 7, scope: !980)
!980 = distinct !DILexicalBlock(scope: !976, file: !3, line: 734, column: 6)
!981 = !DILocation(line: 734, column: 6, scope: !976)
!982 = !DILocation(line: 736, column: 6, scope: !980)
!983 = !DILocation(line: 739, column: 11, scope: !984)
!984 = distinct !DILexicalBlock(scope: !985, file: !3, line: 739, column: 10)
!985 = distinct !DILexicalBlock(scope: !980, file: !3, line: 738, column: 2)
!986 = !DILocation(line: 739, column: 10, scope: !985)
!987 = !DILocation(line: 741, column: 3, scope: !988)
!988 = distinct !DILexicalBlock(scope: !984, file: !3, line: 740, column: 6)
!989 = !DILocation(line: 742, column: 7, scope: !988)
!990 = !DILocation(line: 743, column: 3, scope: !988)
!991 = !DILocation(line: 744, column: 6, scope: !988)
!992 = !DILocation(line: 745, column: 10, scope: !985)
!993 = !DILocation(line: 748, column: 3, scope: !994)
!994 = distinct !DILexicalBlock(scope: !995, file: !3, line: 746, column: 6)
!995 = distinct !DILexicalBlock(scope: !985, file: !3, line: 745, column: 10)
!996 = !DILocation(line: 750, column: 6, scope: !994)
!997 = !DILocation(line: 753, column: 1, scope: !965)
!998 = distinct !DISubprogram(name: "format_lines", scope: !3, file: !3, line: 931, type: !999, isLocal: false, isDefinition: true, scopeLine: 934, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1001)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !98, !92}
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027}
!1002 = !DILocalVariable(name: "line_count", arg: 1, scope: !998, file: !3, line: 932, type: !98)
!1003 = !DILocalVariable(name: "avoid_fex", arg: 2, scope: !998, file: !3, line: 933, type: !92)
!1004 = !DILocalVariable(name: "max_len", scope: !998, file: !3, line: 935, type: !92)
!1005 = !DILocalVariable(name: "is_not_par", scope: !998, file: !3, line: 936, type: !92)
!1006 = !DILocalVariable(name: "next_is_not_par", scope: !998, file: !3, line: 937, type: !92)
!1007 = !DILocalVariable(name: "is_end_par", scope: !998, file: !3, line: 938, type: !92)
!1008 = !DILocalVariable(name: "prev_is_end_par", scope: !998, file: !3, line: 939, type: !92)
!1009 = !DILocalVariable(name: "next_is_start_par", scope: !998, file: !3, line: 940, type: !92)
!1010 = !DILocalVariable(name: "leader_len", scope: !998, file: !3, line: 941, type: !92)
!1011 = !DILocalVariable(name: "next_leader_len", scope: !998, file: !3, line: 942, type: !92)
!1012 = !DILocalVariable(name: "leader_flags", scope: !998, file: !3, line: 943, type: !93)
!1013 = !DILocalVariable(name: "next_leader_flags", scope: !998, file: !3, line: 944, type: !93)
!1014 = !DILocalVariable(name: "do_comments", scope: !998, file: !3, line: 945, type: !92)
!1015 = !DILocalVariable(name: "do_comments_list", scope: !998, file: !3, line: 946, type: !92)
!1016 = !DILocalVariable(name: "advance", scope: !998, file: !3, line: 947, type: !92)
!1017 = !DILocalVariable(name: "second_indent", scope: !998, file: !3, line: 948, type: !92)
!1018 = !DILocalVariable(name: "do_second_indent", scope: !998, file: !3, line: 950, type: !92)
!1019 = !DILocalVariable(name: "do_number_indent", scope: !998, file: !3, line: 951, type: !92)
!1020 = !DILocalVariable(name: "do_trail_white", scope: !998, file: !3, line: 952, type: !92)
!1021 = !DILocalVariable(name: "first_par_line", scope: !998, file: !3, line: 953, type: !92)
!1022 = !DILocalVariable(name: "smd_save", scope: !998, file: !3, line: 954, type: !92)
!1023 = !DILocalVariable(name: "count", scope: !998, file: !3, line: 955, type: !99)
!1024 = !DILocalVariable(name: "need_set_indent", scope: !998, file: !3, line: 956, type: !92)
!1025 = !DILocalVariable(name: "force_format", scope: !998, file: !3, line: 957, type: !92)
!1026 = !DILocalVariable(name: "old_State", scope: !998, file: !3, line: 958, type: !92)
!1027 = !DILocalVariable(name: "indent", scope: !1028, file: !3, line: 1125, type: !92)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 1124, column: 3)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 1123, column: 12)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 1117, column: 7)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 1111, column: 6)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 1110, column: 10)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 1021, column: 2)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 1015, column: 6)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 983, column: 5)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 982, column: 5)
!1037 = distinct !DILexicalBlock(scope: !998, file: !3, line: 982, column: 5)
!1038 = !DILocation(line: 932, column: 14, scope: !998)
!1039 = !DILocation(line: 933, column: 10, scope: !998)
!1040 = !DILocation(line: 939, column: 10, scope: !998)
!1041 = !DILocation(line: 940, column: 10, scope: !998)
!1042 = !DILocation(line: 941, column: 5, scope: !998)
!1043 = !DILocation(line: 941, column: 10, scope: !998)
!1044 = !DILocation(line: 942, column: 5, scope: !998)
!1045 = !DILocation(line: 943, column: 5, scope: !998)
!1046 = !DILocation(line: 943, column: 13, scope: !998)
!1047 = !DILocation(line: 944, column: 5, scope: !998)
!1048 = !DILocation(line: 946, column: 10, scope: !998)
!1049 = !DILocation(line: 947, column: 10, scope: !998)
!1050 = !DILocation(line: 948, column: 10, scope: !998)
!1051 = !DILocation(line: 953, column: 10, scope: !998)
!1052 = !DILocation(line: 956, column: 10, scope: !998)
!1053 = !DILocation(line: 957, column: 10, scope: !998)
!1054 = !DILocation(line: 958, column: 22, scope: !998)
!1055 = !DILocation(line: 958, column: 10, scope: !998)
!1056 = !DILocalVariable(name: "ff", arg: 1, scope: !1057, file: !3, line: 764, type: !92)
!1057 = distinct !DISubprogram(name: "comp_textwidth", scope: !3, file: !3, line: 763, type: !110, isLocal: false, isDefinition: true, scopeLine: 765, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1058)
!1058 = !{!1056, !1059}
!1059 = !DILocalVariable(name: "textwidth", scope: !1057, file: !3, line: 766, type: !92)
!1060 = !DILocation(line: 764, column: 10, scope: !1057, inlinedAt: !1061)
!1061 = distinct !DILocation(line: 961, column: 15, scope: !998)
!1062 = !DILocation(line: 768, column: 17, scope: !1057, inlinedAt: !1061)
!1063 = !DILocation(line: 768, column: 25, scope: !1057, inlinedAt: !1061)
!1064 = !{!127, !129, i64 7272}
!1065 = !DILocation(line: 766, column: 10, scope: !1057, inlinedAt: !1061)
!1066 = !DILocation(line: 769, column: 19, scope: !1067, inlinedAt: !1061)
!1067 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 769, column: 9)
!1068 = !DILocation(line: 769, column: 24, scope: !1067, inlinedAt: !1061)
!1069 = !DILocation(line: 769, column: 35, scope: !1067, inlinedAt: !1061)
!1070 = !{!127, !129, i64 7296}
!1071 = !DILocation(line: 769, column: 27, scope: !1067, inlinedAt: !1061)
!1072 = !DILocation(line: 769, column: 9, scope: !1057, inlinedAt: !1061)
!1073 = !DILocation(line: 773, column: 14, scope: !1074, inlinedAt: !1061)
!1074 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 770, column: 5)
!1075 = !DILocation(line: 773, column: 22, scope: !1074, inlinedAt: !1061)
!1076 = !{!253, !118, i64 248}
!1077 = !DILocation(line: 775, column: 6, scope: !1078, inlinedAt: !1061)
!1078 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 775, column: 6)
!1079 = !DILocation(line: 775, column: 18, scope: !1078, inlinedAt: !1061)
!1080 = !DILocation(line: 775, column: 6, scope: !1074, inlinedAt: !1061)
!1081 = !DILocation(line: 779, column: 23, scope: !1074, inlinedAt: !1061)
!1082 = !{!253, !129, i64 936}
!1083 = !DILocation(line: 779, column: 12, scope: !1074, inlinedAt: !1061)
!1084 = !DILocation(line: 782, column: 6, scope: !1085, inlinedAt: !1061)
!1085 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 782, column: 6)
!1086 = !DILocation(line: 782, column: 6, scope: !1074, inlinedAt: !1061)
!1087 = !DILocation(line: 785, column: 6, scope: !1088, inlinedAt: !1061)
!1088 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 785, column: 6)
!1089 = !DILocation(line: 785, column: 14, scope: !1088, inlinedAt: !1061)
!1090 = !{!253, !118, i64 1056}
!1091 = !DILocation(line: 785, column: 21, scope: !1088, inlinedAt: !1061)
!1092 = !DILocation(line: 785, column: 32, scope: !1088, inlinedAt: !1061)
!1093 = !{!253, !118, i64 1060}
!1094 = !DILocation(line: 785, column: 24, scope: !1088, inlinedAt: !1061)
!1095 = !DILocation(line: 785, column: 6, scope: !1074, inlinedAt: !1061)
!1096 = !DILocation(line: 786, column: 16, scope: !1088, inlinedAt: !1061)
!1097 = !DILocation(line: 786, column: 6, scope: !1088, inlinedAt: !1061)
!1098 = !DILocation(line: 788, column: 9, scope: !1057, inlinedAt: !1061)
!1099 = !DILocation(line: 792, column: 14, scope: !1100, inlinedAt: !1061)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 791, column: 5)
!1101 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 790, column: 9)
!1102 = !DILocation(line: 792, column: 22, scope: !1100, inlinedAt: !1061)
!1103 = !DILocation(line: 792, column: 30, scope: !1100, inlinedAt: !1061)
!1104 = !DILocation(line: 793, column: 6, scope: !1100, inlinedAt: !1061)
!1105 = !DILocation(line: 795, column: 5, scope: !1100, inlinedAt: !1061)
!1106 = !DILocation(line: 961, column: 36, scope: !998)
!1107 = !DILocation(line: 935, column: 10, scope: !998)
!1108 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !1109)
!1109 = distinct !DILocation(line: 964, column: 19, scope: !998)
!1110 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !1109)
!1111 = !DILocation(line: 28, column: 9, scope: !109, inlinedAt: !1109)
!1112 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !1109)
!1113 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !1109)
!1114 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !1109)
!1115 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !1109)
!1116 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !1117)
!1117 = distinct !DILocation(line: 965, column: 24, scope: !998)
!1118 = !DILocation(line: 945, column: 10, scope: !998)
!1119 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !1117)
!1120 = !DILocation(line: 28, column: 9, scope: !109, inlinedAt: !1117)
!1121 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !1117)
!1122 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !1117)
!1123 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !1117)
!1124 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !1117)
!1125 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !1126)
!1126 = distinct !DILocation(line: 966, column: 24, scope: !998)
!1127 = !DILocation(line: 950, column: 10, scope: !998)
!1128 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !1126)
!1129 = !DILocation(line: 28, column: 9, scope: !109, inlinedAt: !1126)
!1130 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !1126)
!1131 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !1126)
!1132 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !1126)
!1133 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !1126)
!1134 = !DILocation(line: 28, column: 9, scope: !116, inlinedAt: !1135)
!1135 = distinct !DILocation(line: 967, column: 22, scope: !998)
!1136 = !DILocation(line: 951, column: 10, scope: !998)
!1137 = !DILocation(line: 26, column: 23, scope: !109, inlinedAt: !1135)
!1138 = !DILocation(line: 28, column: 9, scope: !109, inlinedAt: !1135)
!1139 = !DILocation(line: 30, column: 24, scope: !109, inlinedAt: !1135)
!1140 = !DILocation(line: 30, column: 32, scope: !109, inlinedAt: !1135)
!1141 = !DILocation(line: 30, column: 13, scope: !109, inlinedAt: !1135)
!1142 = !DILocation(line: 30, column: 43, scope: !109, inlinedAt: !1135)
!1143 = !DILocation(line: 30, column: 5, scope: !109, inlinedAt: !1135)
!1144 = !DILocation(line: 952, column: 10, scope: !998)
!1145 = !DILocation(line: 970, column: 9, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !998, file: !3, line: 970, column: 9)
!1147 = !DILocation(line: 970, column: 26, scope: !1146)
!1148 = !DILocation(line: 970, column: 31, scope: !1146)
!1149 = !DILocation(line: 970, column: 9, scope: !998)
!1150 = !DILocation(line: 971, column: 51, scope: !1146)
!1151 = !DILocation(line: 971, column: 15, scope: !1146)
!1152 = !DILocation(line: 936, column: 10, scope: !998)
!1153 = !DILocation(line: 975, column: 37, scope: !998)
!1154 = !DILocation(line: 975, column: 54, scope: !998)
!1155 = !DILocation(line: 971, column: 2, scope: !1146)
!1156 = !DILocation(line: 942, column: 10, scope: !998)
!1157 = !DILocation(line: 944, column: 13, scope: !998)
!1158 = !DILocation(line: 975, column: 23, scope: !998)
!1159 = !DILocation(line: 937, column: 10, scope: !998)
!1160 = !DILocation(line: 977, column: 30, scope: !998)
!1161 = !DILocation(line: 978, column: 10, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !998, file: !3, line: 978, column: 9)
!1163 = !DILocation(line: 978, column: 24, scope: !1162)
!1164 = !DILocation(line: 978, column: 21, scope: !1162)
!1165 = !DILocation(line: 979, column: 30, scope: !1162)
!1166 = !DILocation(line: 979, column: 47, scope: !1162)
!1167 = !DILocation(line: 979, column: 52, scope: !1162)
!1168 = !DILocation(line: 486, column: 24, scope: !863, inlinedAt: !1169)
!1169 = distinct !DILocation(line: 979, column: 16, scope: !1162)
!1170 = !DILocation(line: 488, column: 17, scope: !863, inlinedAt: !1169)
!1171 = !DILocation(line: 488, column: 13, scope: !863, inlinedAt: !1169)
!1172 = !DILocation(line: 491, column: 9, scope: !872, inlinedAt: !1169)
!1173 = !DILocation(line: 491, column: 12, scope: !872, inlinedAt: !1169)
!1174 = !DILocation(line: 491, column: 9, scope: !863, inlinedAt: !1169)
!1175 = !DILocation(line: 495, column: 9, scope: !863, inlinedAt: !1169)
!1176 = !DILocation(line: 495, column: 19, scope: !863, inlinedAt: !1169)
!1177 = !DILocation(line: 489, column: 12, scope: !863, inlinedAt: !1169)
!1178 = !DILocation(line: 496, column: 12, scope: !863, inlinedAt: !1169)
!1179 = !DILocation(line: 938, column: 10, scope: !998)
!1180 = !DILocation(line: 981, column: 5, scope: !998)
!1181 = !DILocation(line: 981, column: 22, scope: !998)
!1182 = !DILocation(line: 981, column: 26, scope: !998)
!1183 = !DILocation(line: 955, column: 10, scope: !998)
!1184 = !DILocation(line: 982, column: 36, scope: !1036)
!1185 = !DILocation(line: 982, column: 41, scope: !1036)
!1186 = !DILocation(line: 1064, column: 6, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 1062, column: 10)
!1188 = !DILocation(line: 982, column: 45, scope: !1036)
!1189 = !DILocation(line: 982, column: 44, scope: !1036)
!1190 = !DILocation(line: 982, column: 5, scope: !1037)
!1191 = !DILocation(line: 985, column: 6, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 985, column: 6)
!1193 = !DILocation(line: 985, column: 6, scope: !1035)
!1194 = !DILocation(line: 987, column: 6, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1192, file: !3, line: 986, column: 2)
!1196 = !DILocation(line: 987, column: 23, scope: !1195)
!1197 = !DILocation(line: 987, column: 27, scope: !1195)
!1198 = !DILocation(line: 990, column: 19, scope: !1195)
!1199 = !DILocation(line: 991, column: 21, scope: !1195)
!1200 = !DILocation(line: 991, column: 19, scope: !1195)
!1201 = !DILocation(line: 992, column: 2, scope: !1195)
!1202 = !DILocation(line: 995, column: 12, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 995, column: 6)
!1204 = !DILocation(line: 995, column: 17, scope: !1203)
!1205 = !DILocation(line: 995, column: 20, scope: !1203)
!1206 = !DILocation(line: 995, column: 37, scope: !1203)
!1207 = !DILocation(line: 995, column: 45, scope: !1203)
!1208 = !DILocation(line: 995, column: 58, scope: !1203)
!1209 = !DILocation(line: 995, column: 42, scope: !1203)
!1210 = !DILocation(line: 995, column: 6, scope: !1035)
!1211 = !DILocation(line: 998, column: 22, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 996, column: 2)
!1213 = !DILocation(line: 999, column: 24, scope: !1212)
!1214 = !DILocation(line: 1000, column: 2, scope: !1212)
!1215 = !DILocation(line: 1003, column: 60, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 1002, column: 2)
!1217 = !DILocation(line: 1003, column: 24, scope: !1216)
!1218 = !DILocation(line: 1005, column: 10, scope: !1216)
!1219 = !DILocation(line: 1007, column: 26, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1216, file: !3, line: 1005, column: 10)
!1221 = !DILocation(line: 1007, column: 43, scope: !1220)
!1222 = !DILocation(line: 1007, column: 48, scope: !1220)
!1223 = !DILocation(line: 1007, column: 8, scope: !1220)
!1224 = !DILocation(line: 1007, column: 53, scope: !1220)
!1225 = !DILocation(line: 1006, column: 3, scope: !1220)
!1226 = !DILocation(line: 1010, column: 16, scope: !1035)
!1227 = !DILocation(line: 1010, column: 27, scope: !1035)
!1228 = !DILocation(line: 1011, column: 7, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 1011, column: 6)
!1230 = !DILocation(line: 1011, column: 18, scope: !1229)
!1231 = !DILocation(line: 1012, column: 34, scope: !1229)
!1232 = !DILocation(line: 1012, column: 51, scope: !1229)
!1233 = !DILocation(line: 486, column: 24, scope: !863, inlinedAt: !1234)
!1234 = distinct !DILocation(line: 1012, column: 20, scope: !1229)
!1235 = !DILocation(line: 488, column: 17, scope: !863, inlinedAt: !1234)
!1236 = !DILocation(line: 488, column: 13, scope: !863, inlinedAt: !1234)
!1237 = !DILocation(line: 491, column: 9, scope: !872, inlinedAt: !1234)
!1238 = !DILocation(line: 491, column: 12, scope: !872, inlinedAt: !1234)
!1239 = !DILocation(line: 491, column: 9, scope: !863, inlinedAt: !1234)
!1240 = !DILocation(line: 495, column: 9, scope: !863, inlinedAt: !1234)
!1241 = !DILocation(line: 495, column: 19, scope: !863, inlinedAt: !1234)
!1242 = !DILocation(line: 489, column: 12, scope: !863, inlinedAt: !1234)
!1243 = !DILocation(line: 496, column: 12, scope: !863, inlinedAt: !1234)
!1244 = !DILocation(line: 1012, column: 19, scope: !1229)
!1245 = !DILocation(line: 1012, column: 6, scope: !1229)
!1246 = !DILocation(line: 1015, column: 6, scope: !1035)
!1247 = !DILocation(line: 1017, column: 10, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 1016, column: 2)
!1249 = !DILocation(line: 1024, column: 10, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 1024, column: 10)
!1251 = !DILocation(line: 1026, column: 10, scope: !1250)
!1252 = !DILocation(line: 1025, column: 28, scope: !1250)
!1253 = !DILocation(line: 1025, column: 7, scope: !1250)
!1254 = !DILocation(line: 1027, column: 10, scope: !1250)
!1255 = !DILocation(line: 1027, column: 27, scope: !1250)
!1256 = !DILocation(line: 1027, column: 34, scope: !1250)
!1257 = !DILocation(line: 1027, column: 47, scope: !1250)
!1258 = !DILocation(line: 1027, column: 32, scope: !1250)
!1259 = !DILocation(line: 1024, column: 10, scope: !1033)
!1260 = !DILocation(line: 1029, column: 24, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1262, file: !3, line: 1029, column: 7)
!1262 = distinct !DILexicalBlock(scope: !1250, file: !3, line: 1028, column: 6)
!1263 = !DILocation(line: 1029, column: 28, scope: !1261)
!1264 = !DILocation(line: 1029, column: 7, scope: !1262)
!1265 = !DILocation(line: 1031, column: 30, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1267, file: !3, line: 1031, column: 11)
!1267 = distinct !DILexicalBlock(scope: !1261, file: !3, line: 1030, column: 3)
!1268 = !DILocation(line: 1031, column: 27, scope: !1266)
!1269 = !DILocation(line: 1035, column: 24, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1266, file: !3, line: 1032, column: 7)
!1271 = !DILocation(line: 1035, column: 41, scope: !1270)
!1272 = !DILocation(line: 1035, column: 46, scope: !1270)
!1273 = !DILocation(line: 1035, column: 8, scope: !1270)
!1274 = !DILocation(line: 1036, column: 7, scope: !1270)
!1275 = !DILocation(line: 1043, column: 12, scope: !1261)
!1276 = !DILocation(line: 1045, column: 30, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1278, file: !3, line: 1045, column: 11)
!1278 = distinct !DILexicalBlock(scope: !1279, file: !3, line: 1044, column: 3)
!1279 = distinct !DILexicalBlock(scope: !1261, file: !3, line: 1043, column: 12)
!1280 = !DILocation(line: 1045, column: 27, scope: !1277)
!1281 = !DILocation(line: 0, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1277, file: !3, line: 1052, column: 7)
!1283 = !DILocation(line: 1062, column: 10, scope: !1187)
!1284 = !DILocation(line: 1062, column: 27, scope: !1187)
!1285 = !DILocation(line: 1062, column: 35, scope: !1187)
!1286 = !DILocation(line: 1062, column: 48, scope: !1187)
!1287 = !DILocation(line: 1062, column: 32, scope: !1187)
!1288 = !DILocation(line: 1063, column: 7, scope: !1187)
!1289 = !DILocation(line: 1064, column: 18, scope: !1187)
!1290 = !DILocation(line: 1065, column: 9, scope: !1187)
!1291 = !DILocation(line: 1065, column: 26, scope: !1187)
!1292 = !DILocation(line: 1063, column: 11, scope: !1187)
!1293 = !DILocation(line: 1062, column: 10, scope: !1033)
!1294 = !DILocation(line: 1066, column: 3, scope: !1187)
!1295 = !DILocation(line: 1070, column: 10, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 1070, column: 10)
!1297 = !DILocation(line: 1070, column: 21, scope: !1296)
!1298 = !DILocation(line: 1072, column: 7, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1300, file: !3, line: 1072, column: 7)
!1300 = distinct !DILexicalBlock(scope: !1296, file: !3, line: 1071, column: 6)
!1301 = !DILocation(line: 1072, column: 7, scope: !1300)
!1302 = !DILocation(line: 1075, column: 24, scope: !1299)
!1303 = !DILocation(line: 1075, column: 13, scope: !1299)
!1304 = !DILocation(line: 1075, column: 7, scope: !1299)
!1305 = !DILocation(line: 1078, column: 9, scope: !1300)
!1306 = !DILocation(line: 1079, column: 3, scope: !1300)
!1307 = !DILocation(line: 1080, column: 10, scope: !1300)
!1308 = !DILocation(line: 1080, column: 27, scope: !1300)
!1309 = !DILocation(line: 1080, column: 31, scope: !1300)
!1310 = !DILocation(line: 1080, column: 46, scope: !1300)
!1311 = !DILocation(line: 1080, column: 34, scope: !1300)
!1312 = !DILocation(line: 1080, column: 3, scope: !1300)
!1313 = !DILocation(line: 1081, column: 7, scope: !1300)
!1314 = distinct !{!1314, !1312, !1315}
!1315 = !DILocation(line: 1081, column: 18, scope: !1300)
!1316 = !DILocation(line: 1084, column: 9, scope: !1300)
!1317 = !DILocation(line: 1085, column: 14, scope: !1300)
!1318 = !DILocation(line: 954, column: 10, scope: !998)
!1319 = !DILocation(line: 1086, column: 9, scope: !1300)
!1320 = !DILocation(line: 1089, column: 19, scope: !1300)
!1321 = !DILocation(line: 1089, column: 7, scope: !1300)
!1322 = !DILocation(line: 1091, column: 4, scope: !1300)
!1323 = !DILocation(line: 1087, column: 3, scope: !1300)
!1324 = !DILocation(line: 1092, column: 9, scope: !1300)
!1325 = !DILocation(line: 1093, column: 9, scope: !1300)
!1326 = !DILocation(line: 1097, column: 7, scope: !1300)
!1327 = !DILocation(line: 1101, column: 11, scope: !1328)
!1328 = distinct !DILexicalBlock(scope: !1329, file: !3, line: 1098, column: 3)
!1329 = distinct !DILexicalBlock(scope: !1300, file: !3, line: 1097, column: 7)
!1330 = !DILocation(line: 1110, column: 10, scope: !1033)
!1331 = !DILocation(line: 1113, column: 3, scope: !1031)
!1332 = !DILocation(line: 1113, column: 20, scope: !1031)
!1333 = !DILocation(line: 1113, column: 24, scope: !1031)
!1334 = !DILocation(line: 1114, column: 20, scope: !1031)
!1335 = !DILocation(line: 1114, column: 24, scope: !1031)
!1336 = !DILocation(line: 1115, column: 22, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 1115, column: 7)
!1338 = !DILocation(line: 1115, column: 25, scope: !1337)
!1339 = !DILocation(line: 1115, column: 41, scope: !1337)
!1340 = !DILocation(line: 1115, column: 7, scope: !1031)
!1341 = !DILocation(line: 1117, column: 7, scope: !1030)
!1342 = !DILocation(line: 1117, column: 23, scope: !1030)
!1343 = !DILocation(line: 1117, column: 7, scope: !1031)
!1344 = !DILocation(line: 1119, column: 23, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 1118, column: 3)
!1346 = !DILocation(line: 1119, column: 13, scope: !1345)
!1347 = !DILocation(line: 1120, column: 23, scope: !1345)
!1348 = !DILocation(line: 1120, column: 40, scope: !1345)
!1349 = !DILocation(line: 1121, column: 17, scope: !1345)
!1350 = !DILocation(line: 1121, column: 11, scope: !1345)
!1351 = !DILocation(line: 1120, column: 7, scope: !1345)
!1352 = !DILocation(line: 1122, column: 3, scope: !1345)
!1353 = !DILocation(line: 1123, column: 26, scope: !1029)
!1354 = !DILocation(line: 1123, column: 12, scope: !1030)
!1355 = !DILocation(line: 1125, column: 20, scope: !1028)
!1356 = !DILocation(line: 1125, column: 11, scope: !1028)
!1357 = !DILocation(line: 1127, column: 18, scope: !1358)
!1358 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 1127, column: 11)
!1359 = !DILocation(line: 1127, column: 11, scope: !1028)
!1360 = !DILocation(line: 1129, column: 20, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1358, file: !3, line: 1128, column: 7)
!1362 = !DILocation(line: 1129, column: 10, scope: !1361)
!1363 = !DILocation(line: 1130, column: 20, scope: !1361)
!1364 = !DILocation(line: 1130, column: 37, scope: !1361)
!1365 = !DILocation(line: 1131, column: 35, scope: !1361)
!1366 = !DILocation(line: 1131, column: 29, scope: !1361)
!1367 = !DILocation(line: 1130, column: 4, scope: !1361)
!1368 = !DILocation(line: 1132, column: 7, scope: !1361)
!1369 = !DILocation(line: 1134, column: 3, scope: !1031)
!1370 = !DILocation(line: 1134, column: 20, scope: !1031)
!1371 = !DILocation(line: 1134, column: 24, scope: !1031)
!1372 = !DILocation(line: 1135, column: 7, scope: !1373)
!1373 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 1135, column: 7)
!1374 = !DILocation(line: 1135, column: 45, scope: !1373)
!1375 = !DILocation(line: 1135, column: 7, scope: !1031)
!1376 = !DILocation(line: 1137, column: 7, scope: !1377)
!1377 = distinct !DILexicalBlock(scope: !1373, file: !3, line: 1136, column: 3)
!1378 = !DILocation(line: 1138, column: 7, scope: !1377)
!1379 = !DILocation(line: 1142, column: 7, scope: !1380)
!1380 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 1142, column: 7)
!1381 = !DILocation(line: 1142, column: 32, scope: !1380)
!1382 = !DILocation(line: 1143, column: 7, scope: !1380)
!1383 = !DILocation(line: 1148, column: 2, scope: !1035)
!1384 = !DILocation(line: 982, column: 54, scope: !1036)
!1385 = distinct !{!1385, !1190, !1386}
!1386 = !DILocation(line: 1149, column: 5, scope: !1037)
!1387 = !DILocation(line: 1150, column: 1, scope: !998)
!1388 = !DILocation(line: 764, column: 10, scope: !1057)
!1389 = !DILocation(line: 768, column: 17, scope: !1057)
!1390 = !DILocation(line: 768, column: 25, scope: !1057)
!1391 = !DILocation(line: 766, column: 10, scope: !1057)
!1392 = !DILocation(line: 769, column: 19, scope: !1067)
!1393 = !DILocation(line: 769, column: 24, scope: !1067)
!1394 = !DILocation(line: 769, column: 35, scope: !1067)
!1395 = !DILocation(line: 769, column: 27, scope: !1067)
!1396 = !DILocation(line: 769, column: 9, scope: !1057)
!1397 = !DILocation(line: 773, column: 14, scope: !1074)
!1398 = !DILocation(line: 773, column: 22, scope: !1074)
!1399 = !DILocation(line: 775, column: 6, scope: !1078)
!1400 = !DILocation(line: 775, column: 18, scope: !1078)
!1401 = !DILocation(line: 775, column: 6, scope: !1074)
!1402 = !DILocation(line: 779, column: 23, scope: !1074)
!1403 = !DILocation(line: 779, column: 12, scope: !1074)
!1404 = !DILocation(line: 782, column: 6, scope: !1085)
!1405 = !DILocation(line: 782, column: 6, scope: !1074)
!1406 = !DILocation(line: 785, column: 6, scope: !1088)
!1407 = !DILocation(line: 785, column: 14, scope: !1088)
!1408 = !DILocation(line: 785, column: 21, scope: !1088)
!1409 = !DILocation(line: 785, column: 32, scope: !1088)
!1410 = !DILocation(line: 785, column: 24, scope: !1088)
!1411 = !DILocation(line: 785, column: 6, scope: !1074)
!1412 = !DILocation(line: 786, column: 16, scope: !1088)
!1413 = !DILocation(line: 786, column: 6, scope: !1088)
!1414 = !DILocation(line: 788, column: 9, scope: !1057)
!1415 = !DILocation(line: 790, column: 9, scope: !1101)
!1416 = !DILocation(line: 790, column: 25, scope: !1101)
!1417 = !DILocation(line: 790, column: 12, scope: !1101)
!1418 = !DILocation(line: 792, column: 14, scope: !1100)
!1419 = !DILocation(line: 792, column: 22, scope: !1100)
!1420 = !DILocation(line: 792, column: 30, scope: !1100)
!1421 = !DILocation(line: 793, column: 6, scope: !1100)
!1422 = !DILocation(line: 795, column: 5, scope: !1100)
!1423 = !DILocation(line: 796, column: 5, scope: !1057)
!1424 = distinct !DISubprogram(name: "op_format", scope: !3, file: !3, line: 803, type: !1425, isLocal: false, isDefinition: true, scopeLine: 806, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1449)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{null, !1427, !92}
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "oparg_T", file: !6, line: 3785, baseType: !1429)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "oparg_S", file: !6, line: 3759, size: 1024, elements: !1430)
!1430 = !{!1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "op_type", scope: !1429, file: !6, line: 3761, baseType: !92, size: 32)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "regname", scope: !1429, file: !6, line: 3762, baseType: !92, size: 32, offset: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "motion_type", scope: !1429, file: !6, line: 3763, baseType: !92, size: 32, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "motion_force", scope: !1429, file: !6, line: 3764, baseType: !92, size: 32, offset: 96)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "use_reg_one", scope: !1429, file: !6, line: 3765, baseType: !92, size: 32, offset: 128)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "inclusive", scope: !1429, file: !6, line: 3767, baseType: !92, size: 32, offset: 160)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "end_adjusted", scope: !1429, file: !6, line: 3769, baseType: !92, size: 32, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1429, file: !6, line: 3771, baseType: !709, size: 128, offset: 256)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1429, file: !6, line: 3772, baseType: !709, size: 128, offset: 384)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_start", scope: !1429, file: !6, line: 3773, baseType: !709, size: 128, offset: 512)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "line_count", scope: !1429, file: !6, line: 3775, baseType: !99, size: 64, offset: 640)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !1429, file: !6, line: 3777, baseType: !92, size: 32, offset: 704)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "is_VIsual", scope: !1429, file: !6, line: 3779, baseType: !92, size: 32, offset: 736)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "block_mode", scope: !1429, file: !6, line: 3780, baseType: !92, size: 32, offset: 768)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "start_vcol", scope: !1429, file: !6, line: 3781, baseType: !90, size: 32, offset: 800)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "end_vcol", scope: !1429, file: !6, line: 3782, baseType: !90, size: 32, offset: 832)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "prev_opcount", scope: !1429, file: !6, line: 3783, baseType: !99, size: 64, offset: 896)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "prev_count0", scope: !1429, file: !6, line: 3784, baseType: !99, size: 64, offset: 960)
!1449 = !{!1450, !1451, !1452, !1453}
!1450 = !DILocalVariable(name: "oap", arg: 1, scope: !1424, file: !3, line: 804, type: !1427)
!1451 = !DILocalVariable(name: "keep_cursor", arg: 2, scope: !1424, file: !3, line: 805, type: !92)
!1452 = !DILocalVariable(name: "old_line_count", scope: !1424, file: !3, line: 807, type: !99)
!1453 = !DILocalVariable(name: "wp", scope: !1454, file: !3, line: 854, type: !1456)
!1454 = distinct !DILexicalBlock(scope: !1455, file: !3, line: 853, column: 5)
!1455 = distinct !DILexicalBlock(scope: !1424, file: !3, line: 852, column: 9)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !6, line: 59, baseType: !1458)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !6, line: 3365, size: 72064, elements: !1459)
!1459 = !{!1460, !1461, !2550, !2551, !2552, !2554, !2555, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2609, !2610, !2611, !2612, !2613, !2621, !2622, !2623, !2624, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2645, !2646, !2648, !2650, !2651, !2652, !2653, !2654, !2655, !2656, !2657, !2658, !2659, !2660, !2661, !2662, !2663, !2664, !2665, !2666, !2667, !2669, !2670, !2671, !2672, !2673, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2696, !2697, !2698, !2699, !2709, !2710, !2711, !2712, !2713, !2714, !2715, !2716, !2717, !2718, !2719, !2720, !2721, !2722, !2723, !2724, !2725, !2733, !2734, !2735, !2736, !2737, !2988, !2996, !2997, !2998, !2999, !3000, !3001, !3002, !3003, !3004, !3005, !3006, !3007, !3008, !3009, !3010, !3011, !3012, !3013, !3014, !3027, !3028, !3029, !3030, !3071, !3072, !3082, !3083, !3084, !3085, !3086, !3106, !3107, !3108, !3109, !3113}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !1458, file: !6, line: 3367, baseType: !92, size: 32)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !1458, file: !6, line: 3369, baseType: !1462, size: 64, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !6, line: 63, baseType: !1464)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !6, line: 2629, size: 73152, elements: !1465)
!1465 = !{!1466, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1577, !1580, !1581, !1585, !1586, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !2065, !2066, !2067, !2072, !2073, !2077, !2081, !2089, !2090, !2091, !2092, !2093, !2097, !2098, !2099, !2103, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2198, !2199, !2200, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2350, !2351, !2352, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2514, !2533, !2534, !2535, !2536, !2537, !2544, !2545, !2549}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !1464, file: !6, line: 2631, baseType: !1467, size: 832)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !6, line: 766, baseType: !1468)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !6, line: 737, size: 832, elements: !1469)
!1469 = !{!1470, !1471, !1534, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1560, !1561}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !1468, file: !6, line: 739, baseType: !98, size: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !1468, file: !6, line: 741, baseType: !1472, size: 64, offset: 64)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !6, line: 459, baseType: !1474)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !6, line: 671, size: 9856, elements: !1475)
!1475 = !{!1476, !1477, !1478, !1479, !1480, !1481, !1500, !1501, !1502, !1504, !1505, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1531, !1532, !1533}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !1474, file: !6, line: 673, baseType: !93, size: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !1474, file: !6, line: 674, baseType: !93, size: 64, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !1474, file: !6, line: 675, baseType: !92, size: 32, offset: 128)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !1474, file: !6, line: 676, baseType: !92, size: 32, offset: 160)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !1474, file: !6, line: 677, baseType: !92, size: 32, offset: 192)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !1474, file: !6, line: 678, baseType: !1482, size: 64, offset: 256)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !6, line: 458, baseType: !1484)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !6, line: 506, size: 448, elements: !1485)
!1485 = !{!1486, !1495, !1496, !1497, !1498, !1499}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !1484, file: !6, line: 508, baseType: !1487, size: 192)
!1487 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !6, line: 469, baseType: !1488)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !6, line: 471, size: 192, elements: !1489)
!1489 = !{!1490, !1492, !1493}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !1488, file: !6, line: 473, baseType: !1491, size: 64)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !1488, file: !6, line: 474, baseType: !1491, size: 64, offset: 64)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !1488, file: !6, line: 475, baseType: !1494, size: 64, offset: 128)
!1494 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !6, line: 460, baseType: !99)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !1484, file: !6, line: 511, baseType: !1482, size: 64, offset: 192)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !1484, file: !6, line: 512, baseType: !1482, size: 64, offset: 256)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !1484, file: !6, line: 513, baseType: !93, size: 64, offset: 320)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !1484, file: !6, line: 514, baseType: !92, size: 32, offset: 384)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !1484, file: !6, line: 518, baseType: !97, size: 8, offset: 416)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !1474, file: !6, line: 679, baseType: !1482, size: 64, offset: 320)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !1474, file: !6, line: 680, baseType: !1482, size: 64, offset: 384)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !1474, file: !6, line: 681, baseType: !1503, size: 32, offset: 448)
!1503 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !1474, file: !6, line: 682, baseType: !1503, size: 32, offset: 480)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !1474, file: !6, line: 683, baseType: !1506, size: 4352, offset: 512)
!1506 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !6, line: 489, baseType: !1507)
!1507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !6, line: 480, size: 4352, elements: !1508)
!1508 = !{!1509, !1511, !1512, !1514, !1518}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !1507, file: !6, line: 482, baseType: !1510, size: 64)
!1510 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !91, line: 345, baseType: !102)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !1507, file: !6, line: 484, baseType: !1510, size: 64, offset: 64)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !1507, file: !6, line: 485, baseType: !1513, size: 64, offset: 128)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !1507, file: !6, line: 487, baseType: !1515, size: 4096, offset: 192)
!1515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1491, size: 4096, elements: !1516)
!1516 = !{!1517}
!1517 = !DISubrange(count: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !1507, file: !6, line: 488, baseType: !97, size: 8, offset: 4288)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !1474, file: !6, line: 684, baseType: !1506, size: 4352, offset: 4864)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !1474, file: !6, line: 685, baseType: !1494, size: 64, offset: 9216)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !1474, file: !6, line: 686, baseType: !1494, size: 64, offset: 9280)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !1474, file: !6, line: 687, baseType: !1494, size: 64, offset: 9344)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !1474, file: !6, line: 688, baseType: !1494, size: 64, offset: 9408)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !1474, file: !6, line: 689, baseType: !1503, size: 32, offset: 9472)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !1474, file: !6, line: 690, baseType: !92, size: 32, offset: 9504)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !1474, file: !6, line: 692, baseType: !1462, size: 64, offset: 9536)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !1474, file: !6, line: 693, baseType: !1528, size: 64, offset: 9600)
!1528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 64, elements: !1529)
!1529 = !{!1530}
!1530 = !DISubrange(count: 8)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !1474, file: !6, line: 697, baseType: !93, size: 64, offset: 9664)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !1474, file: !6, line: 698, baseType: !92, size: 32, offset: 9728)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !1474, file: !6, line: 699, baseType: !1528, size: 64, offset: 9760)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !1468, file: !6, line: 743, baseType: !1535, size: 64, offset: 128)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64)
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !6, line: 717, baseType: !1537)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !6, line: 711, size: 256, elements: !1538)
!1538 = !{!1539, !1540, !1541, !1542}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !1537, file: !6, line: 713, baseType: !1494, size: 64)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !1537, file: !6, line: 714, baseType: !98, size: 64, offset: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !1537, file: !6, line: 715, baseType: !98, size: 64, offset: 128)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !1537, file: !6, line: 716, baseType: !92, size: 32, offset: 192)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !1468, file: !6, line: 744, baseType: !92, size: 32, offset: 192)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !1468, file: !6, line: 745, baseType: !92, size: 32, offset: 224)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !1468, file: !6, line: 751, baseType: !92, size: 32, offset: 256)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !1468, file: !6, line: 753, baseType: !90, size: 32, offset: 288)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !1468, file: !6, line: 754, baseType: !98, size: 64, offset: 320)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !1468, file: !6, line: 755, baseType: !93, size: 64, offset: 384)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !1468, file: !6, line: 757, baseType: !1482, size: 64, offset: 448)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !1468, file: !6, line: 758, baseType: !98, size: 64, offset: 512)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !1468, file: !6, line: 759, baseType: !98, size: 64, offset: 576)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !1468, file: !6, line: 760, baseType: !92, size: 32, offset: 640)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !1468, file: !6, line: 762, baseType: !1554, size: 64, offset: 704)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64)
!1555 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !6, line: 724, baseType: !1556)
!1556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !6, line: 720, size: 128, elements: !1557)
!1557 = !{!1558, !1559}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !1556, file: !6, line: 722, baseType: !92, size: 32)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !1556, file: !6, line: 723, baseType: !99, size: 64, offset: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !1468, file: !6, line: 763, baseType: !92, size: 32, offset: 768)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !1468, file: !6, line: 764, baseType: !92, size: 32, offset: 800)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !1464, file: !6, line: 2634, baseType: !1462, size: 64, offset: 832)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !1464, file: !6, line: 2635, baseType: !1462, size: 64, offset: 896)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !1464, file: !6, line: 2637, baseType: !92, size: 32, offset: 960)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !1464, file: !6, line: 2639, baseType: !92, size: 32, offset: 992)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !1464, file: !6, line: 2640, baseType: !92, size: 32, offset: 1024)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !1464, file: !6, line: 2642, baseType: !92, size: 32, offset: 1056)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !1464, file: !6, line: 2651, baseType: !93, size: 64, offset: 1088)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !1464, file: !6, line: 2652, baseType: !93, size: 64, offset: 1152)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !1464, file: !6, line: 2654, baseType: !93, size: 64, offset: 1216)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !1464, file: !6, line: 2658, baseType: !92, size: 32, offset: 1280)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !1464, file: !6, line: 2659, baseType: !1573, size: 64, offset: 1344)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !1574, line: 59, baseType: !1575)
!1574 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!1575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !1576, line: 145, baseType: !102)
!1576 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !1464, file: !6, line: 2660, baseType: !1578, size: 64, offset: 1408)
!1578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !1574, line: 47, baseType: !1579)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !1576, line: 148, baseType: !102)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !1464, file: !6, line: 2667, baseType: !92, size: 32, offset: 1472)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !1464, file: !6, line: 2668, baseType: !1582, size: 72, offset: 1504)
!1582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 72, elements: !1583)
!1583 = !{!1584}
!1584 = !DISubrange(count: 9)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !1464, file: !6, line: 2672, baseType: !92, size: 32, offset: 1600)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !1464, file: !6, line: 2674, baseType: !1587, size: 320, offset: 1664)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !6, line: 1532, baseType: !1588)
!1588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !6, line: 1526, size: 320, elements: !1589)
!1589 = !{!1590, !1983, !1984}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !1588, file: !6, line: 1528, baseType: !1591, size: 128)
!1591 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !6, line: 1432, baseType: !1592)
!1592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1412, size: 128, elements: !1593)
!1593 = !{!1594, !1596, !1597}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !1592, file: !6, line: 1414, baseType: !1595, size: 32)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !6, line: 1391, baseType: !5)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !1592, file: !6, line: 1415, baseType: !97, size: 8, offset: 32)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !1592, file: !6, line: 1431, baseType: !1598, size: 64, offset: 64)
!1598 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1592, file: !6, line: 1416, size: 64, elements: !1599)
!1599 = !{!1600, !1603, !1606, !1607, !1664, !1698, !1847, !1974, !1975}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !1598, file: !6, line: 1418, baseType: !1601, size: 64)
!1601 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !6, line: 1327, baseType: !1602)
!1602 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !1598, file: !6, line: 1420, baseType: !1604, size: 64)
!1604 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !6, line: 1344, baseType: !1605)
!1605 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !1598, file: !6, line: 1422, baseType: !93, size: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !1598, file: !6, line: 1423, baseType: !1608, size: 64)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64)
!1609 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !6, line: 1346, baseType: !1610)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !6, line: 1471, size: 768, elements: !1611)
!1611 = !{!1612, !1620, !1627, !1642, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !1610, file: !6, line: 1473, baseType: !1613, size: 64)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64)
!1614 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !6, line: 1446, baseType: !1615)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !6, line: 1448, size: 256, elements: !1616)
!1616 = !{!1617, !1618, !1619}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !1615, file: !6, line: 1450, baseType: !1613, size: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !1615, file: !6, line: 1451, baseType: !1613, size: 64, offset: 64)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !1615, file: !6, line: 1452, baseType: !1591, size: 128, offset: 128)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !1610, file: !6, line: 1474, baseType: !1621, size: 64, offset: 64)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64)
!1622 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !6, line: 1456, baseType: !1623)
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !6, line: 1458, size: 128, elements: !1624)
!1624 = !{!1625, !1626}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !1623, file: !6, line: 1460, baseType: !1613, size: 64)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !1623, file: !6, line: 1461, baseType: !1621, size: 64, offset: 64)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !1610, file: !6, line: 1487, baseType: !1628, size: 192, offset: 128)
!1628 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1610, file: !6, line: 1475, size: 192, elements: !1629)
!1629 = !{!1630, !1636}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !1628, file: !6, line: 1481, baseType: !1631, size: 192)
!1631 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1628, file: !6, line: 1476, size: 192, elements: !1632)
!1632 = !{!1633, !1634, !1635}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !1631, file: !6, line: 1478, baseType: !1601, size: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !1631, file: !6, line: 1479, baseType: !1601, size: 64, offset: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !1631, file: !6, line: 1480, baseType: !92, size: 32, offset: 128)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1628, file: !6, line: 1486, baseType: !1637, size: 192)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1628, file: !6, line: 1482, size: 192, elements: !1638)
!1638 = !{!1639, !1640, !1641}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !1637, file: !6, line: 1483, baseType: !1613, size: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !1637, file: !6, line: 1484, baseType: !1613, size: 64, offset: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !1637, file: !6, line: 1485, baseType: !92, size: 32, offset: 128)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !1610, file: !6, line: 1488, baseType: !1643, size: 64, offset: 320)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64)
!1644 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !6, line: 1394, baseType: !1645)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !6, line: 1395, size: 192, elements: !1646)
!1646 = !{!1647, !1648, !1651, !1652, !1653, !1654}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !1645, file: !6, line: 1396, baseType: !1595, size: 32)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !1645, file: !6, line: 1397, baseType: !1649, size: 8, offset: 32)
!1649 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !6, line: 1342, baseType: !1650)
!1650 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !1645, file: !6, line: 1398, baseType: !97, size: 8, offset: 40)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !1645, file: !6, line: 1399, baseType: !97, size: 8, offset: 48)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !1645, file: !6, line: 1400, baseType: !1643, size: 64, offset: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !1645, file: !6, line: 1401, baseType: !1655, size: 64, offset: 128)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !1610, file: !6, line: 1489, baseType: !1608, size: 64, offset: 384)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !1610, file: !6, line: 1490, baseType: !1608, size: 64, offset: 448)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !1610, file: !6, line: 1491, baseType: !1608, size: 64, offset: 512)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !1610, file: !6, line: 1492, baseType: !92, size: 32, offset: 576)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !1610, file: !6, line: 1493, baseType: !92, size: 32, offset: 608)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !1610, file: !6, line: 1494, baseType: !92, size: 32, offset: 640)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !1610, file: !6, line: 1496, baseType: !92, size: 32, offset: 672)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !1610, file: !6, line: 1497, baseType: !97, size: 8, offset: 704)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !1598, file: !6, line: 1424, baseType: !1665, size: 64)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64)
!1666 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !6, line: 1347, baseType: !1667)
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !6, line: 1545, size: 2816, elements: !1668)
!1668 = !{!1669, !1670, !1671, !1672, !1673, !1694, !1695, !1696, !1697}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !1667, file: !6, line: 1547, baseType: !97, size: 8)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !1667, file: !6, line: 1548, baseType: !97, size: 8, offset: 8)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !1667, file: !6, line: 1549, baseType: !92, size: 32, offset: 32)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !1667, file: !6, line: 1550, baseType: !92, size: 32, offset: 64)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !1667, file: !6, line: 1551, baseType: !1674, size: 2432, offset: 128)
!1674 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !6, line: 1290, baseType: !1675)
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !6, line: 1277, size: 2432, elements: !1676)
!1676 = !{!1677, !1678, !1679, !1680, !1681, !1682, !1683, !1690}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !1675, file: !6, line: 1279, baseType: !1510, size: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !1675, file: !6, line: 1281, baseType: !1510, size: 64, offset: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !1675, file: !6, line: 1282, baseType: !1510, size: 64, offset: 128)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !1675, file: !6, line: 1283, baseType: !92, size: 32, offset: 192)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !1675, file: !6, line: 1284, baseType: !92, size: 32, offset: 224)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !1675, file: !6, line: 1285, baseType: !92, size: 32, offset: 256)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !1675, file: !6, line: 1287, baseType: !1684, size: 64, offset: 320)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64)
!1685 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !6, line: 1265, baseType: !1686)
!1686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !6, line: 1261, size: 128, elements: !1687)
!1687 = !{!1688, !1689}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !1686, file: !6, line: 1263, baseType: !1510, size: 64)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !1686, file: !6, line: 1264, baseType: !93, size: 64, offset: 64)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !1675, file: !6, line: 1289, baseType: !1691, size: 2048, offset: 384)
!1691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1685, size: 2048, elements: !1692)
!1692 = !{!1693}
!1693 = !DISubrange(count: 16)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !1667, file: !6, line: 1552, baseType: !1643, size: 64, offset: 2560)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !1667, file: !6, line: 1553, baseType: !1665, size: 64, offset: 2624)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !1667, file: !6, line: 1554, baseType: !1665, size: 64, offset: 2688)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !1667, file: !6, line: 1555, baseType: !1665, size: 64, offset: 2752)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !1598, file: !6, line: 1425, baseType: !1699, size: 64)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64)
!1700 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !6, line: 1348, baseType: !1701)
!1701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !6, line: 1994, size: 832, elements: !1702)
!1702 = !{!1703, !1704, !1705, !1822, !1823, !1833, !1843, !1844, !1845, !1846}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !1701, file: !6, line: 1996, baseType: !92, size: 32)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !1701, file: !6, line: 1997, baseType: !93, size: 64, offset: 64)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !1701, file: !6, line: 1999, baseType: !1706, size: 64, offset: 128)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64)
!1707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !6, line: 1658, baseType: !1708)
!1708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1597, size: 3072, elements: !1709)
!1709 = !{!1710, !1711, !1712, !1713, !1714, !1716, !1717, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1737, !1738, !1739, !1740, !1741, !1750, !1751, !1752, !1753, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1770, !1771, !1772, !1817, !1818}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !1708, file: !6, line: 1599, baseType: !92, size: 32)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !1708, file: !6, line: 1600, baseType: !92, size: 32, offset: 32)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !1708, file: !6, line: 1601, baseType: !92, size: 32, offset: 64)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !1708, file: !6, line: 1602, baseType: !92, size: 32, offset: 96)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !1708, file: !6, line: 1603, baseType: !1715, size: 32, offset: 128)
!1715 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !6, line: 1591, baseType: !23)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !1708, file: !6, line: 1604, baseType: !92, size: 32, offset: 160)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !1708, file: !6, line: 1605, baseType: !1718, size: 192, offset: 192)
!1718 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !6, line: 55, baseType: !1719)
!1719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !6, line: 48, size: 192, elements: !1720)
!1720 = !{!1721, !1722, !1723, !1724, !1725}
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !1719, file: !6, line: 50, baseType: !92, size: 32)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !1719, file: !6, line: 51, baseType: !92, size: 32, offset: 32)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !1719, file: !6, line: 52, baseType: !92, size: 32, offset: 64)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !1719, file: !6, line: 53, baseType: !92, size: 32, offset: 96)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !1719, file: !6, line: 54, baseType: !89, size: 64, offset: 128)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !1708, file: !6, line: 1606, baseType: !1718, size: 192, offset: 384)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !1708, file: !6, line: 1609, baseType: !1655, size: 64, offset: 576)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !1708, file: !6, line: 1610, baseType: !1643, size: 64, offset: 640)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !1708, file: !6, line: 1611, baseType: !1718, size: 192, offset: 704)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !1708, file: !6, line: 1612, baseType: !1699, size: 64, offset: 896)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !1708, file: !6, line: 1615, baseType: !93, size: 64, offset: 960)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !1708, file: !6, line: 1616, baseType: !1643, size: 64, offset: 1024)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !1708, file: !6, line: 1617, baseType: !1643, size: 64, offset: 1088)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !1708, file: !6, line: 1618, baseType: !92, size: 32, offset: 1152)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !1708, file: !6, line: 1619, baseType: !1736, size: 64, offset: 1216)
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !1708, file: !6, line: 1626, baseType: !1718, size: 192, offset: 1280)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !1708, file: !6, line: 1628, baseType: !92, size: 32, offset: 1472)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !1708, file: !6, line: 1629, baseType: !92, size: 32, offset: 1504)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !1708, file: !6, line: 1631, baseType: !92, size: 32, offset: 1536)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !1708, file: !6, line: 1632, baseType: !1742, size: 128, offset: 1600)
!1742 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !91, line: 1786, baseType: !1743)
!1743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1744, line: 8, size: 128, elements: !1745)
!1744 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!1745 = !{!1746, !1748}
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1743, file: !1744, line: 10, baseType: !1747, size: 64)
!1747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !1576, line: 160, baseType: !99)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1743, file: !1744, line: 11, baseType: !1749, size: 64, offset: 64)
!1749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !1576, line: 162, baseType: !99)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !1708, file: !6, line: 1633, baseType: !1742, size: 128, offset: 1728)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !1708, file: !6, line: 1634, baseType: !1742, size: 128, offset: 1856)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !1708, file: !6, line: 1636, baseType: !1736, size: 64, offset: 1984)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !1708, file: !6, line: 1637, baseType: !1754, size: 64, offset: 2048)
!1754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !1708, file: !6, line: 1638, baseType: !1754, size: 64, offset: 2112)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !1708, file: !6, line: 1639, baseType: !1742, size: 128, offset: 2176)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !1708, file: !6, line: 1640, baseType: !1742, size: 128, offset: 2304)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !1708, file: !6, line: 1641, baseType: !1742, size: 128, offset: 2432)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !1708, file: !6, line: 1642, baseType: !92, size: 32, offset: 2560)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !1708, file: !6, line: 1643, baseType: !92, size: 32, offset: 2592)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !1708, file: !6, line: 1645, baseType: !1762, size: 192, offset: 2624)
!1762 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !6, line: 92, baseType: !1763)
!1763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 85, size: 192, elements: !1764)
!1764 = !{!1765, !1767, !1768, !1769}
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !1763, file: !6, line: 87, baseType: !1766, size: 32)
!1766 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !6, line: 62, baseType: !92)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !1763, file: !6, line: 88, baseType: !92, size: 32, offset: 32)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !1763, file: !6, line: 89, baseType: !98, size: 64, offset: 64)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !1763, file: !6, line: 91, baseType: !92, size: 32, offset: 128)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !1708, file: !6, line: 1648, baseType: !92, size: 32, offset: 2816)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !1708, file: !6, line: 1649, baseType: !92, size: 32, offset: 2848)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !1708, file: !6, line: 1651, baseType: !1773, size: 64, offset: 2880)
!1773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1774, size: 64)
!1774 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !6, line: 1582, baseType: !1775)
!1775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !6, line: 1682, size: 17280, elements: !1776)
!1776 = !{!1777, !1778, !1779, !1780, !1800, !1801, !1802, !1803, !1804, !1805, !1807, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816}
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1775, file: !6, line: 1684, baseType: !1706, size: 64)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !1775, file: !6, line: 1685, baseType: !92, size: 32, offset: 64)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !1775, file: !6, line: 1686, baseType: !92, size: 32, offset: 96)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !1775, file: !6, line: 1691, baseType: !1781, size: 4608, offset: 128)
!1781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1782, size: 4608, elements: !1798)
!1782 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1775, file: !6, line: 1687, size: 384, elements: !1783)
!1783 = !{!1784, !1794}
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1782, file: !6, line: 1689, baseType: !1785, size: 192)
!1785 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !6, line: 1519, baseType: !1786)
!1786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !6, line: 1513, size: 192, elements: !1787)
!1787 = !{!1788, !1789, !1790}
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !1786, file: !6, line: 1515, baseType: !1591, size: 128)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !1786, file: !6, line: 1516, baseType: !94, size: 8, offset: 128)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !1786, file: !6, line: 1517, baseType: !1791, size: 8, offset: 136)
!1791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8, elements: !1792)
!1792 = !{!1793}
!1793 = !DISubrange(count: 1)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "room", scope: !1782, file: !6, line: 1690, baseType: !1795, size: 160, offset: 192)
!1795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 160, elements: !1796)
!1796 = !{!1797}
!1797 = !DISubrange(count: 20)
!1798 = !{!1799}
!1799 = !DISubrange(count: 12)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars", scope: !1775, file: !6, line: 1692, baseType: !1666, size: 2816, offset: 4736)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars_var", scope: !1775, file: !6, line: 1693, baseType: !1785, size: 192, offset: 7552)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars", scope: !1775, file: !6, line: 1694, baseType: !1666, size: 2816, offset: 7744)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars_var", scope: !1775, file: !6, line: 1695, baseType: !1785, size: 192, offset: 10560)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "l_varlist", scope: !1775, file: !6, line: 1696, baseType: !1609, size: 768, offset: 10752)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "l_listitems", scope: !1775, file: !6, line: 1697, baseType: !1806, size: 5120, offset: 11520)
!1806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1614, size: 5120, elements: !1796)
