; ModuleID = 'textprop.c'
source_filename = "textprop.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!12 = !DIEnumerator(name: "VAR_SPECIAL", value: 4)
!13 = !DIEnumerator(name: "VAR_NUMBER", value: 5)
!14 = !DIEnumerator(name: "VAR_FLOAT", value: 6)
!15 = !DIEnumerator(name: "VAR_STRING", value: 7)
!16 = !DIEnumerator(name: "VAR_BLOB", value: 8)
!17 = !DIEnumerator(name: "VAR_FUNC", value: 9)
!18 = !DIEnumerator(name: "VAR_PARTIAL", value: 10)
!19 = !DIEnumerator(name: "VAR_LIST", value: 11)
!20 = !DIEnumerator(name: "VAR_DICT", value: 12)
!21 = !DIEnumerator(name: "VAR_JOB", value: 13)
!22 = !DIEnumerator(name: "VAR_CHANNEL", value: 14)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1585, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28, !29}
!25 = !DIEnumerator(name: "UF_NOT_COMPILED", value: 0)
!26 = !DIEnumerator(name: "UF_TO_BE_COMPILED", value: 1)
!27 = !DIEnumerator(name: "UF_COMPILING", value: 2)
!28 = !DIEnumerator(name: "UF_COMPILED", value: 3)
!29 = !DIEnumerator(name: "UF_COMPILE_ERROR", value: 4)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2061, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "JOB_FAILED", value: 0)
!33 = !DIEnumerator(name: "JOB_STARTED", value: 1)
!34 = !DIEnumerator(name: "JOB_ENDED", value: 2)
!35 = !DIEnumerator(name: "JOB_FINISHED", value: 3)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2140, size: 32, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "MODE_NL", value: 0)
!39 = !DIEnumerator(name: "MODE_RAW", value: 1)
!40 = !DIEnumerator(name: "MODE_JSON", value: 2)
!41 = !DIEnumerator(name: "MODE_JS", value: 3)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2148, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47, !48}
!44 = !DIEnumerator(name: "JIO_PIPE", value: 0)
!45 = !DIEnumerator(name: "JIO_NULL", value: 1)
!46 = !DIEnumerator(name: "JIO_FILE", value: 2)
!47 = !DIEnumerator(name: "JIO_BUFFER", value: 3)
!48 = !DIEnumerator(name: "JIO_OUT", value: 4)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2517, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56}
!51 = !DIEnumerator(name: "POPPOS_BOTLEFT", value: 0)
!52 = !DIEnumerator(name: "POPPOS_TOPLEFT", value: 1)
!53 = !DIEnumerator(name: "POPPOS_BOTRIGHT", value: 2)
!54 = !DIEnumerator(name: "POPPOS_TOPRIGHT", value: 3)
!55 = !DIEnumerator(name: "POPPOS_CENTER", value: 4)
!56 = !DIEnumerator(name: "POPPOS_NONE", value: 5)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 2526, size: 32, elements: !58)
!58 = !{!59, !60, !61}
!59 = !DIEnumerator(name: "POPCLOSE_NONE", value: 0)
!60 = !DIEnumerator(name: "POPCLOSE_BUTTON", value: 1)
!61 = !DIEnumerator(name: "POPCLOSE_CLICK", value: 2)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 55, size: 32, elements: !64)
!63 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkvisual.h", directory: "/home/sahil/vim/src")
!64 = !{!65, !66, !67, !68, !69, !70}
!65 = !DIEnumerator(name: "GDK_VISUAL_STATIC_GRAY", value: 0)
!66 = !DIEnumerator(name: "GDK_VISUAL_GRAYSCALE", value: 1)
!67 = !DIEnumerator(name: "GDK_VISUAL_STATIC_COLOR", value: 2)
!68 = !DIEnumerator(name: "GDK_VISUAL_PSEUDO_COLOR", value: 3)
!69 = !DIEnumerator(name: "GDK_VISUAL_TRUE_COLOR", value: 4)
!70 = !DIEnumerator(name: "GDK_VISUAL_DIRECT_COLOR", value: 5)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 118, size: 32, elements: !73)
!72 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdktypes.h", directory: "/home/sahil/vim/src")
!73 = !{!74, !75}
!74 = !DIEnumerator(name: "GDK_LSB_FIRST", value: 0)
!75 = !DIEnumerator(name: "GDK_MSB_FIRST", value: 1)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 43, size: 32, elements: !78)
!77 = !DIFile(filename: "/usr/include/gtk-2.0/gdk/gdkfont.h", directory: "/home/sahil/vim/src")
!78 = !{!79, !80}
!79 = !DIEnumerator(name: "GDK_FONT_FONT", value: 0)
!80 = !DIEnumerator(name: "GDK_FONT_FONTSET", value: 1)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 52, size: 32, elements: !83)
!82 = !DIFile(filename: "/usr/include/gtk-2.0/gtk/gtkrc.h", directory: "/home/sahil/vim/src")
!83 = !{!84, !85, !86, !87}
!84 = !DIEnumerator(name: "GTK_RC_FG", value: 1)
!85 = !DIEnumerator(name: "GTK_RC_BG", value: 2)
!86 = !DIEnumerator(name: "GTK_RC_TEXT", value: 4)
!87 = !DIEnumerator(name: "GTK_RC_BASE", value: 8)
!88 = !{!89, !90, !92, !93, !97, !98, !99, !102, !115, !124}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !95, line: 324, baseType: !96)
!95 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !95, line: 1688, baseType: !98)
!98 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 62, baseType: !101)
!100 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!101 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "proptype_T", file: !6, line: 806, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proptype_S", file: !6, line: 798, size: 192, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pt_id", scope: !104, file: !6, line: 800, baseType: !98, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pt_type", scope: !104, file: !6, line: 801, baseType: !98, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pt_hl_id", scope: !104, file: !6, line: 802, baseType: !98, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "pt_priority", scope: !104, file: !6, line: 803, baseType: !98, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pt_flags", scope: !104, file: !6, line: 804, baseType: !98, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !104, file: !6, line: 805, baseType: !112, size: 8, offset: 160)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "textprop_T", file: !6, line: 790, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "textprop_S", file: !6, line: 783, size: 160, elements: !118)
!118 = !{!119, !120, !121, !122, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_col", scope: !117, file: !6, line: 785, baseType: !97, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_len", scope: !117, file: !6, line: 786, baseType: !97, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_id", scope: !117, file: !6, line: 787, baseType: !98, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_type", scope: !117, file: !6, line: 788, baseType: !98, size: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !117, file: !6, line: 789, baseType: !98, size: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !6, line: 1290, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !6, line: 1277, size: 2432, elements: !127)
!127 = !{!128, !130, !131, !132, !133, !134, !135, !142}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !126, file: !6, line: 1279, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !95, line: 345, baseType: !101)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !126, file: !6, line: 1281, baseType: !129, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !126, file: !6, line: 1282, baseType: !129, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !126, file: !6, line: 1283, baseType: !98, size: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !126, file: !6, line: 1284, baseType: !98, size: 32, offset: 224)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !126, file: !6, line: 1285, baseType: !98, size: 32, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !126, file: !6, line: 1287, baseType: !136, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !6, line: 1265, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !6, line: 1261, size: 128, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !138, file: !6, line: 1263, baseType: !129, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !138, file: !6, line: 1264, baseType: !93, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !126, file: !6, line: 1289, baseType: !143, size: 2048, offset: 384)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 2048, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 16)
!146 = !{!147, !0, !1826, !1831, !1836, !1838}
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "textprop", scope: !149, file: !3, line: 889, type: !116, isLocal: true, isDefinition: true)
!149 = distinct !DISubprogram(name: "f_prop_remove", scope: !3, file: !3, line: 812, type: !150, isLocal: false, isDefinition: true, scopeLine: 813, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1792)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !6, line: 1432, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1412, size: 128, elements: !155)
!155 = !{!156, !158, !159}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !154, file: !6, line: 1414, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !6, line: 1391, baseType: !5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !154, file: !6, line: 1415, baseType: !91, size: 8, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !154, file: !6, line: 1431, baseType: !160, size: 64, offset: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !154, file: !6, line: 1416, size: 64, elements: !161)
!161 = !{!162, !165, !168, !169, !226, !240, !387, !1783, !1784}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !160, file: !6, line: 1418, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !6, line: 1327, baseType: !164)
!164 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !160, file: !6, line: 1420, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !6, line: 1344, baseType: !167)
!167 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !160, file: !6, line: 1422, baseType: !93, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !160, file: !6, line: 1423, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !6, line: 1346, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !6, line: 1471, size: 768, elements: !173)
!173 = !{!174, !182, !189, !204, !218, !219, !220, !221, !222, !223, !224, !225}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !172, file: !6, line: 1473, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !6, line: 1446, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !6, line: 1448, size: 256, elements: !178)
!178 = !{!179, !180, !181}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !177, file: !6, line: 1450, baseType: !175, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !177, file: !6, line: 1451, baseType: !175, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !177, file: !6, line: 1452, baseType: !153, size: 128, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !172, file: !6, line: 1474, baseType: !183, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !6, line: 1456, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !6, line: 1458, size: 128, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !185, file: !6, line: 1460, baseType: !175, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !185, file: !6, line: 1461, baseType: !183, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !172, file: !6, line: 1487, baseType: !190, size: 192, offset: 128)
!190 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !172, file: !6, line: 1475, size: 192, elements: !191)
!191 = !{!192, !198}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !190, file: !6, line: 1481, baseType: !193, size: 192)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !190, file: !6, line: 1476, size: 192, elements: !194)
!194 = !{!195, !196, !197}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !193, file: !6, line: 1478, baseType: !163, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !193, file: !6, line: 1479, baseType: !163, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !193, file: !6, line: 1480, baseType: !98, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !190, file: !6, line: 1486, baseType: !199, size: 192)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !190, file: !6, line: 1482, size: 192, elements: !200)
!200 = !{!201, !202, !203}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !199, file: !6, line: 1483, baseType: !175, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !199, file: !6, line: 1484, baseType: !175, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !199, file: !6, line: 1485, baseType: !98, size: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !172, file: !6, line: 1488, baseType: !205, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !6, line: 1394, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !6, line: 1395, size: 192, elements: !208)
!208 = !{!209, !210, !213, !214, !215, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !207, file: !6, line: 1396, baseType: !157, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !207, file: !6, line: 1397, baseType: !211, size: 8, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !6, line: 1342, baseType: !212)
!212 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !207, file: !6, line: 1398, baseType: !91, size: 8, offset: 40)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !207, file: !6, line: 1399, baseType: !91, size: 8, offset: 48)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !207, file: !6, line: 1400, baseType: !205, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !207, file: !6, line: 1401, baseType: !217, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !172, file: !6, line: 1489, baseType: !170, size: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !172, file: !6, line: 1490, baseType: !170, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !172, file: !6, line: 1491, baseType: !170, size: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !172, file: !6, line: 1492, baseType: !98, size: 32, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !172, file: !6, line: 1493, baseType: !98, size: 32, offset: 608)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !172, file: !6, line: 1494, baseType: !98, size: 32, offset: 640)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !172, file: !6, line: 1496, baseType: !98, size: 32, offset: 672)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !172, file: !6, line: 1497, baseType: !91, size: 8, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !160, file: !6, line: 1424, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !6, line: 1347, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !6, line: 1545, size: 2816, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !229, file: !6, line: 1547, baseType: !91, size: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !229, file: !6, line: 1548, baseType: !91, size: 8, offset: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !229, file: !6, line: 1549, baseType: !98, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !229, file: !6, line: 1550, baseType: !98, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !229, file: !6, line: 1551, baseType: !125, size: 2432, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !229, file: !6, line: 1552, baseType: !205, size: 64, offset: 2560)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !229, file: !6, line: 1553, baseType: !227, size: 64, offset: 2624)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !229, file: !6, line: 1554, baseType: !227, size: 64, offset: 2688)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !229, file: !6, line: 1555, baseType: !227, size: 64, offset: 2752)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !160, file: !6, line: 1425, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !6, line: 1348, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !6, line: 1994, size: 832, elements: !244)
!244 = !{!245, !246, !247, !362, !363, !373, !383, !384, !385, !386}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !243, file: !6, line: 1996, baseType: !98, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !243, file: !6, line: 1997, baseType: !93, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !243, file: !6, line: 1999, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !6, line: 1658, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1597, size: 3072, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !258, !259, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !279, !280, !281, !282, !283, !293, !294, !295, !296, !298, !299, !300, !301, !302, !303, !304, !314, !315, !316, !357, !358}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !250, file: !6, line: 1599, baseType: !98, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !250, file: !6, line: 1600, baseType: !98, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !250, file: !6, line: 1601, baseType: !98, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !250, file: !6, line: 1602, baseType: !98, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !250, file: !6, line: 1603, baseType: !257, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !6, line: 1591, baseType: !23)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !250, file: !6, line: 1604, baseType: !98, size: 32, offset: 160)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !250, file: !6, line: 1605, baseType: !260, size: 192, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !6, line: 55, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !6, line: 48, size: 192, elements: !262)
!262 = !{!263, !264, !265, !266, !267}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !261, file: !6, line: 50, baseType: !98, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !261, file: !6, line: 51, baseType: !98, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !261, file: !6, line: 52, baseType: !98, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !261, file: !6, line: 53, baseType: !98, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !261, file: !6, line: 54, baseType: !89, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !250, file: !6, line: 1606, baseType: !260, size: 192, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !250, file: !6, line: 1609, baseType: !217, size: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !250, file: !6, line: 1610, baseType: !205, size: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !250, file: !6, line: 1611, baseType: !260, size: 192, offset: 704)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !250, file: !6, line: 1612, baseType: !241, size: 64, offset: 896)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !250, file: !6, line: 1615, baseType: !93, size: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !250, file: !6, line: 1616, baseType: !205, size: 64, offset: 1024)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !250, file: !6, line: 1617, baseType: !205, size: 64, offset: 1088)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !250, file: !6, line: 1618, baseType: !98, size: 32, offset: 1152)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !250, file: !6, line: 1619, baseType: !278, size: 64, offset: 1216)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !250, file: !6, line: 1626, baseType: !260, size: 192, offset: 1280)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !250, file: !6, line: 1628, baseType: !98, size: 32, offset: 1472)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !250, file: !6, line: 1629, baseType: !98, size: 32, offset: 1504)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !250, file: !6, line: 1631, baseType: !98, size: 32, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !250, file: !6, line: 1632, baseType: !284, size: 128, offset: 1600)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !95, line: 1786, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !286, line: 8, size: 128, elements: !287)
!286 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!287 = !{!288, !291}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !285, file: !286, line: 10, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !290, line: 160, baseType: !92)
!290 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !285, file: !286, line: 11, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !290, line: 162, baseType: !92)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !250, file: !6, line: 1633, baseType: !284, size: 128, offset: 1728)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !250, file: !6, line: 1634, baseType: !284, size: 128, offset: 1856)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !250, file: !6, line: 1636, baseType: !278, size: 64, offset: 1984)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !250, file: !6, line: 1637, baseType: !297, size: 64, offset: 2048)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !250, file: !6, line: 1638, baseType: !297, size: 64, offset: 2112)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !250, file: !6, line: 1639, baseType: !284, size: 128, offset: 2176)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !250, file: !6, line: 1640, baseType: !284, size: 128, offset: 2304)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !250, file: !6, line: 1641, baseType: !284, size: 128, offset: 2432)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !250, file: !6, line: 1642, baseType: !98, size: 32, offset: 2560)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !250, file: !6, line: 1643, baseType: !98, size: 32, offset: 2592)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !250, file: !6, line: 1645, baseType: !305, size: 192, offset: 2624)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !6, line: 92, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 85, size: 192, elements: !307)
!307 = !{!308, !310, !311, !313}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !306, file: !6, line: 87, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !6, line: 62, baseType: !98)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !306, file: !6, line: 88, baseType: !98, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !306, file: !6, line: 89, baseType: !312, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !95, line: 1687, baseType: !92)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !306, file: !6, line: 91, baseType: !98, size: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !250, file: !6, line: 1648, baseType: !98, size: 32, offset: 2816)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !250, file: !6, line: 1649, baseType: !98, size: 32, offset: 2848)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !250, file: !6, line: 1651, baseType: !317, size: 64, offset: 2880)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !6, line: 1582, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !6, line: 1682, size: 17280, elements: !320)
!320 = !{!321, !322, !323, !324, !341, !342, !343, !344, !345, !346, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !319, file: !6, line: 1684, baseType: !248, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !319, file: !6, line: 1685, baseType: !98, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !319, file: !6, line: 1686, baseType: !98, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !319, file: !6, line: 1691, baseType: !325, size: 4608, offset: 128)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 4608, elements: !339)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !319, file: !6, line: 1687, size: 384, elements: !327)
!327 = !{!328, !335}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !326, file: !6, line: 1689, baseType: !329, size: 192)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !6, line: 1519, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !6, line: 1513, size: 192, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !330, file: !6, line: 1515, baseType: !153, size: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !330, file: !6, line: 1516, baseType: !94, size: 8, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !330, file: !6, line: 1517, baseType: !112, size: 8, offset: 136)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "room", scope: !326, file: !6, line: 1690, baseType: !336, size: 160, offset: 192)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 160, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 20)
!339 = !{!340}
!340 = !DISubrange(count: 12)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars", scope: !319, file: !6, line: 1692, baseType: !228, size: 2816, offset: 4736)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars_var", scope: !319, file: !6, line: 1693, baseType: !329, size: 192, offset: 7552)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars", scope: !319, file: !6, line: 1694, baseType: !228, size: 2816, offset: 7744)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars_var", scope: !319, file: !6, line: 1695, baseType: !329, size: 192, offset: 10560)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "l_varlist", scope: !319, file: !6, line: 1696, baseType: !171, size: 768, offset: 10752)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "l_listitems", scope: !319, file: !6, line: 1697, baseType: !347, size: 5120, offset: 11520)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 5120, elements: !337)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rettv", scope: !319, file: !6, line: 1698, baseType: !152, size: 64, offset: 16640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !319, file: !6, line: 1699, baseType: !312, size: 64, offset: 16704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dbg_tick", scope: !319, file: !6, line: 1700, baseType: !98, size: 32, offset: 16768)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !319, file: !6, line: 1701, baseType: !98, size: 32, offset: 16800)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "prof_child", scope: !319, file: !6, line: 1703, baseType: !284, size: 128, offset: 16832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !319, file: !6, line: 1705, baseType: !317, size: 64, offset: 16960)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fc_refcount", scope: !319, file: !6, line: 1709, baseType: !98, size: 32, offset: 17024)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fc_copyID", scope: !319, file: !6, line: 1711, baseType: !98, size: 32, offset: 17056)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fc_funcs", scope: !319, file: !6, line: 1712, baseType: !260, size: 192, offset: 17088)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name_exp", scope: !250, file: !6, line: 1653, baseType: !93, size: 64, offset: 2944)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name", scope: !250, file: !6, line: 1655, baseType: !359, size: 32, offset: 3008)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 32, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 4)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pt_auto", scope: !243, file: !6, line: 2001, baseType: !98, size: 32, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pt_outer", scope: !243, file: !6, line: 2005, baseType: !364, size: 256, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "outer_T", file: !6, line: 1986, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_S", file: !6, line: 1987, size: 256, elements: !366)
!366 = !{!367, !369, !370, !372}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "out_stack", scope: !365, file: !6, line: 1988, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame_idx", scope: !365, file: !6, line: 1989, baseType: !98, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "out_up", scope: !365, file: !6, line: 1990, baseType: !371, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "out_up_is_copy", scope: !365, file: !6, line: 1991, baseType: !98, size: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pt_funcstack", scope: !243, file: !6, line: 2007, baseType: !374, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "funcstack_T", file: !6, line: 1984, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcstack_S", file: !6, line: 1972, size: 320, elements: !377)
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ga", scope: !376, file: !6, line: 1974, baseType: !260, size: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fs_var_offset", scope: !376, file: !6, line: 1978, baseType: !98, size: 32, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fs_refcount", scope: !376, file: !6, line: 1981, baseType: !98, size: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fs_min_refcount", scope: !376, file: !6, line: 1982, baseType: !98, size: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "fs_copyID", scope: !376, file: !6, line: 1983, baseType: !98, size: 32, offset: 288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argc", scope: !243, file: !6, line: 2010, baseType: !98, size: 32, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argv", scope: !243, file: !6, line: 2011, baseType: !152, size: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pt_dict", scope: !243, file: !6, line: 2013, baseType: !227, size: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pt_copyID", scope: !243, file: !6, line: 2014, baseType: !98, size: 32, offset: 768)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !160, file: !6, line: 1427, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !6, line: 1365, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !6, line: 2072, size: 1024, elements: !391)
!391 = !{!392, !393, !394, !398, !399, !400, !402, !403, !404, !405, !412, !1683, !1684, !1685, !1781}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !390, file: !6, line: 2074, baseType: !388, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !390, file: !6, line: 2075, baseType: !388, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !390, file: !6, line: 2077, baseType: !395, size: 32, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !396, line: 97, baseType: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !290, line: 154, baseType: !98)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !390, file: !6, line: 2083, baseType: !93, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !390, file: !6, line: 2084, baseType: !93, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !390, file: !6, line: 2085, baseType: !401, size: 32, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !6, line: 2067, baseType: !30)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !390, file: !6, line: 2086, baseType: !93, size: 64, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !390, file: !6, line: 2088, baseType: !93, size: 64, offset: 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !390, file: !6, line: 2093, baseType: !98, size: 32, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !390, file: !6, line: 2094, baseType: !406, size: 192, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !6, line: 1360, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1356, size: 192, elements: !408)
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !407, file: !6, line: 1357, baseType: !93, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !407, file: !6, line: 1358, baseType: !241, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !407, file: !6, line: 1359, baseType: !98, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !390, file: !6, line: 2096, baseType: !413, size: 64, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !6, line: 63, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !6, line: 2629, size: 73152, elements: !416)
!416 = !{!417, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !525, !528, !529, !533, !534, !544, !545, !546, !547, !548, !549, !550, !551, !1357, !1358, !1359, !1364, !1365, !1366, !1370, !1378, !1379, !1380, !1381, !1382, !1384, !1385, !1386, !1387, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1666, !1667, !1668, !1669, !1670, !1677, !1678, !1682}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !415, file: !6, line: 2631, baseType: !418, size: 832)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !6, line: 766, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !6, line: 737, size: 832, elements: !420)
!420 = !{!421, !422, !484, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !510, !511}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !419, file: !6, line: 739, baseType: !312, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !419, file: !6, line: 741, baseType: !423, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !6, line: 459, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !6, line: 671, size: 9856, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !451, !452, !453, !455, !456, !469, !470, !471, !472, !473, !474, !475, !476, !477, !481, !482, !483}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !425, file: !6, line: 673, baseType: !93, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !425, file: !6, line: 674, baseType: !93, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !425, file: !6, line: 675, baseType: !98, size: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !425, file: !6, line: 676, baseType: !98, size: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !425, file: !6, line: 677, baseType: !98, size: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !425, file: !6, line: 678, baseType: !433, size: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !6, line: 458, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !6, line: 506, size: 448, elements: !436)
!436 = !{!437, !446, !447, !448, !449, !450}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !435, file: !6, line: 508, baseType: !438, size: 192)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !6, line: 469, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !6, line: 471, size: 192, elements: !440)
!440 = !{!441, !443, !444}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !439, file: !6, line: 473, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !439, file: !6, line: 474, baseType: !442, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !439, file: !6, line: 475, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !6, line: 460, baseType: !92)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !435, file: !6, line: 511, baseType: !433, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !435, file: !6, line: 512, baseType: !433, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !435, file: !6, line: 513, baseType: !93, size: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !435, file: !6, line: 514, baseType: !98, size: 32, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !435, file: !6, line: 518, baseType: !91, size: 8, offset: 416)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !425, file: !6, line: 679, baseType: !433, size: 64, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !425, file: !6, line: 680, baseType: !433, size: 64, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !425, file: !6, line: 681, baseType: !454, size: 32, offset: 448)
!454 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !425, file: !6, line: 682, baseType: !454, size: 32, offset: 480)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !425, file: !6, line: 683, baseType: !457, size: 4352, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !6, line: 489, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !6, line: 480, size: 4352, elements: !459)
!459 = !{!460, !461, !462, !464, !468}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !458, file: !6, line: 482, baseType: !129, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !458, file: !6, line: 484, baseType: !129, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !458, file: !6, line: 485, baseType: !463, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !458, file: !6, line: 487, baseType: !465, size: 4096, offset: 192)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 4096, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !458, file: !6, line: 488, baseType: !91, size: 8, offset: 4288)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !425, file: !6, line: 684, baseType: !457, size: 4352, offset: 4864)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !425, file: !6, line: 685, baseType: !445, size: 64, offset: 9216)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !425, file: !6, line: 686, baseType: !445, size: 64, offset: 9280)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !425, file: !6, line: 687, baseType: !445, size: 64, offset: 9344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !425, file: !6, line: 688, baseType: !445, size: 64, offset: 9408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !425, file: !6, line: 689, baseType: !454, size: 32, offset: 9472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !425, file: !6, line: 690, baseType: !98, size: 32, offset: 9504)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !425, file: !6, line: 692, baseType: !413, size: 64, offset: 9536)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !425, file: !6, line: 693, baseType: !478, size: 64, offset: 9600)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 64, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !425, file: !6, line: 697, baseType: !93, size: 64, offset: 9664)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !425, file: !6, line: 698, baseType: !98, size: 32, offset: 9728)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !425, file: !6, line: 699, baseType: !478, size: 64, offset: 9760)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !419, file: !6, line: 743, baseType: !485, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !6, line: 717, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !6, line: 711, size: 256, elements: !488)
!488 = !{!489, !490, !491, !492}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !487, file: !6, line: 713, baseType: !445, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !487, file: !6, line: 714, baseType: !312, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !487, file: !6, line: 715, baseType: !312, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !487, file: !6, line: 716, baseType: !98, size: 32, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !419, file: !6, line: 744, baseType: !98, size: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !419, file: !6, line: 745, baseType: !98, size: 32, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !419, file: !6, line: 751, baseType: !98, size: 32, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !419, file: !6, line: 753, baseType: !97, size: 32, offset: 288)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !419, file: !6, line: 754, baseType: !312, size: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !419, file: !6, line: 755, baseType: !93, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !419, file: !6, line: 757, baseType: !433, size: 64, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !419, file: !6, line: 758, baseType: !312, size: 64, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !419, file: !6, line: 759, baseType: !312, size: 64, offset: 576)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !419, file: !6, line: 760, baseType: !98, size: 32, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !419, file: !6, line: 762, baseType: !504, size: 64, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !6, line: 724, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !6, line: 720, size: 128, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !506, file: !6, line: 722, baseType: !98, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !506, file: !6, line: 723, baseType: !92, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !419, file: !6, line: 763, baseType: !98, size: 32, offset: 768)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !419, file: !6, line: 764, baseType: !98, size: 32, offset: 800)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !415, file: !6, line: 2634, baseType: !413, size: 64, offset: 832)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !415, file: !6, line: 2635, baseType: !413, size: 64, offset: 896)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !415, file: !6, line: 2637, baseType: !98, size: 32, offset: 960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !415, file: !6, line: 2639, baseType: !98, size: 32, offset: 992)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !415, file: !6, line: 2640, baseType: !98, size: 32, offset: 1024)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !415, file: !6, line: 2642, baseType: !98, size: 32, offset: 1056)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !415, file: !6, line: 2651, baseType: !93, size: 64, offset: 1088)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !415, file: !6, line: 2652, baseType: !93, size: 64, offset: 1152)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !415, file: !6, line: 2654, baseType: !93, size: 64, offset: 1216)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !415, file: !6, line: 2658, baseType: !98, size: 32, offset: 1280)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !415, file: !6, line: 2659, baseType: !523, size: 64, offset: 1344)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !396, line: 59, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !290, line: 145, baseType: !101)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !415, file: !6, line: 2660, baseType: !526, size: 64, offset: 1408)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !396, line: 47, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !290, line: 148, baseType: !101)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !415, file: !6, line: 2667, baseType: !98, size: 32, offset: 1472)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !415, file: !6, line: 2668, baseType: !530, size: 72, offset: 1504)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 72, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 9)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !415, file: !6, line: 2672, baseType: !98, size: 32, offset: 1600)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !415, file: !6, line: 2674, baseType: !535, size: 320, offset: 1664)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !6, line: 1532, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !6, line: 1526, size: 320, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !536, file: !6, line: 1528, baseType: !153, size: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !536, file: !6, line: 1529, baseType: !94, size: 8, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !536, file: !6, line: 1530, baseType: !541, size: 136, offset: 136)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 136, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 17)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !415, file: !6, line: 2679, baseType: !163, size: 64, offset: 1984)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !415, file: !6, line: 2681, baseType: !163, size: 64, offset: 2048)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !415, file: !6, line: 2684, baseType: !98, size: 32, offset: 2112)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !415, file: !6, line: 2691, baseType: !98, size: 32, offset: 2144)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !415, file: !6, line: 2693, baseType: !312, size: 64, offset: 2176)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !415, file: !6, line: 2694, baseType: !312, size: 64, offset: 2240)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !415, file: !6, line: 2696, baseType: !92, size: 64, offset: 2304)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !415, file: !6, line: 2699, baseType: !552, size: 64, offset: 2368)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !6, line: 60, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !6, line: 325, size: 11648, elements: !555)
!555 = !{!556, !557, !558, !1352, !1353, !1354, !1355, !1356}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !554, file: !6, line: 327, baseType: !552, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !554, file: !6, line: 328, baseType: !552, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !554, file: !6, line: 329, baseType: !559, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !6, line: 59, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !6, line: 3365, size: 72064, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !722, !723, !738, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !795, !796, !797, !798, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !819, !820, !822, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !843, !844, !845, !846, !847, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !907, !908, !909, !910, !911, !1164, !1172, !1173, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1265, !1266, !1267, !1268, !1309, !1310, !1320, !1321, !1322, !1323, !1324, !1344, !1345, !1346, !1347, !1351}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !561, file: !6, line: 3367, baseType: !98, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !561, file: !6, line: 3369, baseType: !413, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !561, file: !6, line: 3371, baseType: !559, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !561, file: !6, line: 3372, baseType: !559, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !561, file: !6, line: 3375, baseType: !568, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !6, line: 2618, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2542, size: 9920, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !587, !588, !589, !590, !591, !649, !657, !658, !659, !660, !661, !698, !699, !700, !701, !702, !703, !705, !706, !710, !711, !712, !713, !714, !715, !716, !717, !721}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !570, file: !6, line: 2544, baseType: !125, size: 2432)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !570, file: !6, line: 2545, baseType: !125, size: 2432, offset: 2432)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !570, file: !6, line: 2546, baseType: !98, size: 32, offset: 4864)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !570, file: !6, line: 2548, baseType: !98, size: 32, offset: 4896)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !570, file: !6, line: 2550, baseType: !98, size: 32, offset: 4928)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !570, file: !6, line: 2551, baseType: !98, size: 32, offset: 4960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !570, file: !6, line: 2552, baseType: !98, size: 32, offset: 4992)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !570, file: !6, line: 2553, baseType: !260, size: 192, offset: 5056)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !570, file: !6, line: 2554, baseType: !260, size: 192, offset: 5248)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !570, file: !6, line: 2555, baseType: !98, size: 32, offset: 5440)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !570, file: !6, line: 2556, baseType: !98, size: 32, offset: 5472)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !570, file: !6, line: 2557, baseType: !98, size: 32, offset: 5504)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !570, file: !6, line: 2559, baseType: !98, size: 32, offset: 5536)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !570, file: !6, line: 2560, baseType: !586, size: 16, offset: 5568)
!586 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !570, file: !6, line: 2561, baseType: !92, size: 64, offset: 5632)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !570, file: !6, line: 2562, baseType: !92, size: 64, offset: 5696)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !570, file: !6, line: 2563, baseType: !92, size: 64, offset: 5760)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !570, file: !6, line: 2564, baseType: !93, size: 64, offset: 5824)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !570, file: !6, line: 2565, baseType: !592, size: 64, offset: 5888)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !594, line: 56, baseType: !595)
!594 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !594, line: 49, size: 192, elements: !596)
!596 = !{!597, !645, !646, !647, !648}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !595, file: !594, line: 51, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !594, line: 42, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !594, line: 167, size: 320, elements: !601)
!601 = !{!602, !606, !610, !625, !644}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !600, file: !594, line: 169, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!592, !93, !98}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !600, file: !594, line: 170, baseType: !607, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !592}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !600, file: !594, line: 171, baseType: !611, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!98, !614, !93, !97, !98}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !594, line: 137, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !594, line: 131, size: 1408, elements: !617)
!617 = !{!618, !619, !623, !624}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !616, file: !594, line: 133, baseType: !592, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !616, file: !594, line: 134, baseType: !620, size: 640, offset: 64)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 640, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 10)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !616, file: !594, line: 135, baseType: !620, size: 640, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !616, file: !594, line: 136, baseType: !98, size: 32, offset: 1344)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !600, file: !594, line: 172, baseType: !626, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!92, !629, !559, !413, !312, !97, !297, !278}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !594, line: 154, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !594, line: 147, size: 2688, elements: !632)
!632 = !{!633, !634, !641, !642, !643}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !631, file: !594, line: 149, baseType: !592, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !631, file: !594, line: 150, baseType: !635, size: 1280, offset: 64)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 1280, elements: !621)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !6, line: 41, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 37, size: 128, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !637, file: !6, line: 39, baseType: !312, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !637, file: !6, line: 40, baseType: !97, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !631, file: !594, line: 151, baseType: !635, size: 1280, offset: 1344)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !631, file: !594, line: 152, baseType: !98, size: 32, offset: 2624)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !631, file: !594, line: 153, baseType: !97, size: 32, offset: 2656)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !600, file: !594, line: 173, baseType: !93, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !595, file: !594, line: 52, baseType: !454, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !595, file: !594, line: 53, baseType: !454, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !595, file: !594, line: 54, baseType: !454, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !595, file: !594, line: 55, baseType: !98, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !570, file: !6, line: 2567, baseType: !650, size: 384, offset: 5952)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !6, line: 2475, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2470, size: 384, elements: !652)
!652 = !{!653, !654, !655, !656}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !651, file: !6, line: 2471, baseType: !284, size: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !651, file: !6, line: 2472, baseType: !284, size: 128, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !651, file: !6, line: 2473, baseType: !92, size: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !651, file: !6, line: 2474, baseType: !92, size: 64, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !570, file: !6, line: 2569, baseType: !98, size: 32, offset: 6336)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !570, file: !6, line: 2570, baseType: !98, size: 32, offset: 6368)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !570, file: !6, line: 2572, baseType: !98, size: 32, offset: 6400)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !570, file: !6, line: 2575, baseType: !98, size: 32, offset: 6432)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !570, file: !6, line: 2592, baseType: !662, size: 64, offset: 6464)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !6, line: 1061, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !6, line: 1063, size: 1728, elements: !665)
!665 = !{!666, !667, !668, !690, !691, !692, !694, !697}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !664, file: !6, line: 1065, baseType: !662, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !664, file: !6, line: 1066, baseType: !312, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !664, file: !6, line: 1071, baseType: !669, size: 1344, offset: 128)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !664, file: !6, line: 1067, size: 1344, elements: !670)
!670 = !{!671, !689}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !669, file: !6, line: 1069, baseType: !672, size: 1344)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 1344, elements: !687)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !6, line: 1055, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !6, line: 1046, size: 192, elements: !675)
!675 = !{!676, !677, !678, !679, !680}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !674, file: !6, line: 1048, baseType: !98, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !674, file: !6, line: 1049, baseType: !98, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !674, file: !6, line: 1051, baseType: !98, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !674, file: !6, line: 1052, baseType: !98, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !674, file: !6, line: 1054, baseType: !681, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !594, line: 165, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !594, line: 161, size: 704, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !683, file: !594, line: 163, baseType: !586, size: 16)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !683, file: !594, line: 164, baseType: !620, size: 640, offset: 64)
!687 = !{!688}
!688 = !DISubrange(count: 7)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !669, file: !6, line: 1070, baseType: !260, size: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !664, file: !6, line: 1072, baseType: !98, size: 32, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !664, file: !6, line: 1073, baseType: !98, size: 32, offset: 1504)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !664, file: !6, line: 1074, baseType: !693, size: 64, offset: 1536)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !664, file: !6, line: 1076, baseType: !695, size: 16, offset: 1600)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !95, line: 1689, baseType: !696)
!696 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !664, file: !6, line: 1077, baseType: !312, size: 64, offset: 1664)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !570, file: !6, line: 2593, baseType: !98, size: 32, offset: 6528)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !570, file: !6, line: 2594, baseType: !662, size: 64, offset: 6592)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !570, file: !6, line: 2595, baseType: !662, size: 64, offset: 6656)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !570, file: !6, line: 2596, baseType: !98, size: 32, offset: 6720)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !570, file: !6, line: 2597, baseType: !312, size: 64, offset: 6784)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !570, file: !6, line: 2598, baseType: !704, size: 16, offset: 6848)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !95, line: 325, baseType: !696)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !570, file: !6, line: 2603, baseType: !260, size: 192, offset: 6912)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !570, file: !6, line: 2604, baseType: !707, size: 2048, offset: 7104)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 2048, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !570, file: !6, line: 2605, baseType: !93, size: 64, offset: 9152)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !570, file: !6, line: 2606, baseType: !93, size: 64, offset: 9216)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !570, file: !6, line: 2607, baseType: !592, size: 64, offset: 9280)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !570, file: !6, line: 2608, baseType: !93, size: 64, offset: 9344)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !570, file: !6, line: 2609, baseType: !93, size: 64, offset: 9408)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !570, file: !6, line: 2610, baseType: !93, size: 64, offset: 9472)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !570, file: !6, line: 2611, baseType: !98, size: 32, offset: 9536)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !570, file: !6, line: 2616, baseType: !718, size: 256, offset: 9568)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 256, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !570, file: !6, line: 2617, baseType: !93, size: 64, offset: 9856)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !561, file: !6, line: 3378, baseType: !98, size: 32, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !561, file: !6, line: 3381, baseType: !724, size: 64, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !6, line: 61, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !6, line: 3231, size: 512, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !726, file: !6, line: 3233, baseType: !91, size: 8)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !726, file: !6, line: 3234, baseType: !98, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !726, file: !6, line: 3235, baseType: !98, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !726, file: !6, line: 3236, baseType: !98, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !726, file: !6, line: 3237, baseType: !98, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !726, file: !6, line: 3238, baseType: !724, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !726, file: !6, line: 3239, baseType: !724, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !726, file: !6, line: 3241, baseType: !724, size: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !726, file: !6, line: 3244, baseType: !724, size: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !726, file: !6, line: 3245, baseType: !559, size: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !561, file: !6, line: 3383, baseType: !739, size: 128, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !6, line: 31, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 26, size: 128, elements: !741)
!741 = !{!742, !743, !744}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !740, file: !6, line: 28, baseType: !312, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !740, file: !6, line: 29, baseType: !97, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !740, file: !6, line: 30, baseType: !97, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !561, file: !6, line: 3385, baseType: !97, size: 32, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !561, file: !6, line: 3389, baseType: !98, size: 32, offset: 608)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !561, file: !6, line: 3394, baseType: !312, size: 64, offset: 640)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !561, file: !6, line: 3400, baseType: !91, size: 8, offset: 704)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !561, file: !6, line: 3401, baseType: !312, size: 64, offset: 768)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !561, file: !6, line: 3402, baseType: !97, size: 32, offset: 832)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !561, file: !6, line: 3403, baseType: !97, size: 32, offset: 864)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !561, file: !6, line: 3404, baseType: !312, size: 64, offset: 896)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !561, file: !6, line: 3405, baseType: !97, size: 32, offset: 960)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !561, file: !6, line: 3406, baseType: !97, size: 32, offset: 992)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !561, file: !6, line: 3408, baseType: !756, size: 352, offset: 1024)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !6, line: 3358, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3343, size: 352, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !757, file: !6, line: 3345, baseType: !98, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !757, file: !6, line: 3346, baseType: !98, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !757, file: !6, line: 3347, baseType: !98, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !757, file: !6, line: 3348, baseType: !98, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !757, file: !6, line: 3349, baseType: !98, size: 32, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !757, file: !6, line: 3350, baseType: !98, size: 32, offset: 160)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !757, file: !6, line: 3351, baseType: !98, size: 32, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !757, file: !6, line: 3352, baseType: !98, size: 32, offset: 224)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !757, file: !6, line: 3353, baseType: !98, size: 32, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !757, file: !6, line: 3354, baseType: !98, size: 32, offset: 288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !757, file: !6, line: 3356, baseType: !98, size: 32, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !561, file: !6, line: 3414, baseType: !312, size: 64, offset: 1408)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !561, file: !6, line: 3416, baseType: !91, size: 8, offset: 1472)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !561, file: !6, line: 3419, baseType: !312, size: 64, offset: 1536)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !561, file: !6, line: 3423, baseType: !98, size: 32, offset: 1600)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !561, file: !6, line: 3424, baseType: !98, size: 32, offset: 1632)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !561, file: !6, line: 3425, baseType: !98, size: 32, offset: 1664)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !561, file: !6, line: 3427, baseType: !98, size: 32, offset: 1696)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !561, file: !6, line: 3429, baseType: !97, size: 32, offset: 1728)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !561, file: !6, line: 3432, baseType: !97, size: 32, offset: 1760)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !561, file: !6, line: 3435, baseType: !98, size: 32, offset: 1792)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !561, file: !6, line: 3437, baseType: !98, size: 32, offset: 1824)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !561, file: !6, line: 3445, baseType: !98, size: 32, offset: 1856)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !561, file: !6, line: 3446, baseType: !98, size: 32, offset: 1888)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !561, file: !6, line: 3449, baseType: !98, size: 32, offset: 1920)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !561, file: !6, line: 3450, baseType: !98, size: 32, offset: 1952)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !561, file: !6, line: 3451, baseType: !98, size: 32, offset: 1984)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !561, file: !6, line: 3452, baseType: !98, size: 32, offset: 2016)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !561, file: !6, line: 3454, baseType: !788, size: 320, offset: 2048)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !6, line: 3330, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3324, size: 320, elements: !790)
!790 = !{!791, !792, !793, !794}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !789, file: !6, line: 3326, baseType: !98, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !789, file: !6, line: 3327, baseType: !98, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !789, file: !6, line: 3328, baseType: !739, size: 128, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !789, file: !6, line: 3329, baseType: !739, size: 128, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !561, file: !6, line: 3457, baseType: !98, size: 32, offset: 2368)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !561, file: !6, line: 3458, baseType: !98, size: 32, offset: 2400)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !561, file: !6, line: 3459, baseType: !93, size: 64, offset: 2432)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !561, file: !6, line: 3460, baseType: !799, size: 32, offset: 2496)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !6, line: 2524, baseType: !49)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !561, file: !6, line: 3461, baseType: !98, size: 32, offset: 2528)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !561, file: !6, line: 3462, baseType: !98, size: 32, offset: 2560)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !561, file: !6, line: 3463, baseType: !559, size: 64, offset: 2624)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !561, file: !6, line: 3464, baseType: !98, size: 32, offset: 2688)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !561, file: !6, line: 3465, baseType: !98, size: 32, offset: 2720)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !561, file: !6, line: 3466, baseType: !98, size: 32, offset: 2752)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !561, file: !6, line: 3467, baseType: !98, size: 32, offset: 2784)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !561, file: !6, line: 3468, baseType: !98, size: 32, offset: 2816)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !561, file: !6, line: 3469, baseType: !98, size: 32, offset: 2848)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !561, file: !6, line: 3470, baseType: !98, size: 32, offset: 2880)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !561, file: !6, line: 3471, baseType: !98, size: 32, offset: 2912)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !561, file: !6, line: 3472, baseType: !98, size: 32, offset: 2944)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !561, file: !6, line: 3473, baseType: !98, size: 32, offset: 2976)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !561, file: !6, line: 3474, baseType: !98, size: 32, offset: 3008)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !561, file: !6, line: 3475, baseType: !98, size: 32, offset: 3040)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !561, file: !6, line: 3476, baseType: !93, size: 64, offset: 3072)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !561, file: !6, line: 3477, baseType: !93, size: 64, offset: 3136)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !561, file: !6, line: 3478, baseType: !818, size: 128, offset: 3200)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !360)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !561, file: !6, line: 3479, baseType: !818, size: 128, offset: 3328)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !561, file: !6, line: 3480, baseType: !821, size: 256, offset: 3456)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 256, elements: !360)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !561, file: !6, line: 3481, baseType: !823, size: 256, offset: 3712)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 256, elements: !479)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !561, file: !6, line: 3483, baseType: !98, size: 32, offset: 3968)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !561, file: !6, line: 3484, baseType: !98, size: 32, offset: 4000)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !561, file: !6, line: 3485, baseType: !163, size: 64, offset: 4032)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !561, file: !6, line: 3487, baseType: !163, size: 64, offset: 4096)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !561, file: !6, line: 3490, baseType: !98, size: 32, offset: 4160)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !561, file: !6, line: 3493, baseType: !312, size: 64, offset: 4224)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !561, file: !6, line: 3495, baseType: !406, size: 192, offset: 4288)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !561, file: !6, line: 3496, baseType: !406, size: 192, offset: 4480)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !561, file: !6, line: 3497, baseType: !98, size: 32, offset: 4672)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !561, file: !6, line: 3498, baseType: !98, size: 32, offset: 4704)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !561, file: !6, line: 3500, baseType: !559, size: 64, offset: 4736)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !561, file: !6, line: 3501, baseType: !312, size: 64, offset: 4800)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !561, file: !6, line: 3502, baseType: !97, size: 32, offset: 4864)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !561, file: !6, line: 3503, baseType: !97, size: 32, offset: 4896)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !561, file: !6, line: 3504, baseType: !98, size: 32, offset: 4928)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !561, file: !6, line: 3505, baseType: !98, size: 32, offset: 4960)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !561, file: !6, line: 3506, baseType: !98, size: 32, offset: 4992)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !561, file: !6, line: 3507, baseType: !842, size: 32, offset: 5024)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !6, line: 2530, baseType: !57)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !561, file: !6, line: 3509, baseType: !170, size: 64, offset: 5056)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !561, file: !6, line: 3510, baseType: !93, size: 64, offset: 5120)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !561, file: !6, line: 3511, baseType: !98, size: 32, offset: 5184)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !561, file: !6, line: 3512, baseType: !98, size: 32, offset: 5216)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !561, file: !6, line: 3514, baseType: !848, size: 64, offset: 5248)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !6, line: 2478, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !6, line: 2479, size: 704, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !850, file: !6, line: 2481, baseType: !92, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !850, file: !6, line: 2483, baseType: !848, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !850, file: !6, line: 2484, baseType: !848, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !850, file: !6, line: 2485, baseType: !284, size: 128, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !850, file: !6, line: 2486, baseType: !91, size: 8, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !850, file: !6, line: 2487, baseType: !91, size: 8, offset: 328)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !850, file: !6, line: 2488, baseType: !98, size: 32, offset: 352)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !850, file: !6, line: 2489, baseType: !92, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !850, file: !6, line: 2490, baseType: !406, size: 192, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !850, file: !6, line: 2491, baseType: !98, size: 32, offset: 640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !561, file: !6, line: 3517, baseType: !98, size: 32, offset: 5312)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !561, file: !6, line: 3534, baseType: !98, size: 32, offset: 5344)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !561, file: !6, line: 3535, baseType: !739, size: 128, offset: 5376)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !561, file: !6, line: 3537, baseType: !97, size: 32, offset: 5504)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !561, file: !6, line: 3543, baseType: !98, size: 32, offset: 5536)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !561, file: !6, line: 3545, baseType: !98, size: 32, offset: 5568)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !561, file: !6, line: 3548, baseType: !98, size: 32, offset: 5600)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !561, file: !6, line: 3550, baseType: !97, size: 32, offset: 5632)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !561, file: !6, line: 3562, baseType: !98, size: 32, offset: 5664)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !561, file: !6, line: 3562, baseType: !98, size: 32, offset: 5696)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !561, file: !6, line: 3574, baseType: !98, size: 32, offset: 5728)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !561, file: !6, line: 3575, baseType: !874, size: 64, offset: 5760)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !6, line: 3225, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !6, line: 3216, size: 192, elements: !877)
!877 = !{!878, !879, !880, !881, !882}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !876, file: !6, line: 3218, baseType: !312, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !876, file: !6, line: 3219, baseType: !704, size: 16, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !876, file: !6, line: 3220, baseType: !91, size: 8, offset: 80)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !876, file: !6, line: 3222, baseType: !91, size: 8, offset: 88)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !876, file: !6, line: 3223, baseType: !312, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !561, file: !6, line: 3578, baseType: !260, size: 192, offset: 5824)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !561, file: !6, line: 3579, baseType: !91, size: 8, offset: 6016)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !561, file: !6, line: 3581, baseType: !91, size: 8, offset: 6024)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !561, file: !6, line: 3585, baseType: !98, size: 32, offset: 6048)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !561, file: !6, line: 3593, baseType: !98, size: 32, offset: 6080)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !561, file: !6, line: 3594, baseType: !98, size: 32, offset: 6112)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_top", scope: !561, file: !6, line: 3596, baseType: !312, size: 64, offset: 6144)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_bot", scope: !561, file: !6, line: 3597, baseType: !312, size: 64, offset: 6208)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_status", scope: !561, file: !6, line: 3598, baseType: !98, size: 32, offset: 6272)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_cursor", scope: !561, file: !6, line: 3602, baseType: !739, size: 128, offset: 6336)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_virtcol", scope: !561, file: !6, line: 3603, baseType: !97, size: 32, offset: 6464)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topline", scope: !561, file: !6, line: 3604, baseType: !312, size: 64, offset: 6528)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_line_count", scope: !561, file: !6, line: 3605, baseType: !312, size: 64, offset: 6592)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topfill", scope: !561, file: !6, line: 3607, baseType: !98, size: 32, offset: 6656)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_empty", scope: !561, file: !6, line: 3609, baseType: !91, size: 8, offset: 6688)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "w_alt_fnum", scope: !561, file: !6, line: 3612, baseType: !98, size: 32, offset: 6720)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "w_alist", scope: !561, file: !6, line: 3614, baseType: !900, size: 64, offset: 6784)
