; ModuleID = 'typval.c'
source_filename = "typval.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sctx_T = type { i32, i32, i64, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mybuf", scope: !2, file: !3, line: 389, type: !1805, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "tv_get_string", scope: !3, file: !3, line: 387, type: !4, isLocal: false, isDefinition: true, scopeLine: 388, flags: DIFlagPrototyped, isOptimized: true, unit: !1767, variables: !1830)
!3 = !DIFile(filename: "typval.c", directory: "/home/sahil/vim/src")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !10}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !8, line: 324, baseType: !9)
!8 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!9 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !12, line: 1432, baseType: !13)
!12 = !DIFile(filename: "./structs.h", directory: "/home/sahil/vim/src")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 1412, size: 128, elements: !14)
!14 = !{!15, !34, !36}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !13, file: !12, line: 1414, baseType: !16, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !12, line: 1391, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 1374, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!19 = !DIEnumerator(name: "VAR_UNKNOWN", value: 0)
!20 = !DIEnumerator(name: "VAR_ANY", value: 1)
!21 = !DIEnumerator(name: "VAR_VOID", value: 2)
!22 = !DIEnumerator(name: "VAR_BOOL", value: 3)
!23 = !DIEnumerator(name: "VAR_SPECIAL", value: 4)
!24 = !DIEnumerator(name: "VAR_NUMBER", value: 5)
!25 = !DIEnumerator(name: "VAR_FLOAT", value: 6)
!26 = !DIEnumerator(name: "VAR_STRING", value: 7)
!27 = !DIEnumerator(name: "VAR_BLOB", value: 8)
!28 = !DIEnumerator(name: "VAR_FUNC", value: 9)
!29 = !DIEnumerator(name: "VAR_PARTIAL", value: 10)
!30 = !DIEnumerator(name: "VAR_LIST", value: 11)
!31 = !DIEnumerator(name: "VAR_DICT", value: 12)
!32 = !DIEnumerator(name: "VAR_JOB", value: 13)
!33 = !DIEnumerator(name: "VAR_CHANNEL", value: 14)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !13, file: !12, line: 1415, baseType: !35, size: 8, offset: 32)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !13, file: !12, line: 1431, baseType: !37, size: 64, offset: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !13, file: !12, line: 1416, size: 64, elements: !38)
!38 = !{!39, !42, !45, !46, !104, !140, !299, !1758, !1759}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !37, file: !12, line: 1418, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !12, line: 1327, baseType: !41)
!41 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !37, file: !12, line: 1420, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !12, line: 1344, baseType: !44)
!44 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !37, file: !12, line: 1422, baseType: !6, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !37, file: !12, line: 1423, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !12, line: 1346, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !12, line: 1471, size: 768, elements: !50)
!50 = !{!51, !59, !66, !82, !96, !97, !98, !99, !100, !101, !102, !103}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !49, file: !12, line: 1473, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !12, line: 1446, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !12, line: 1448, size: 256, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !54, file: !12, line: 1450, baseType: !52, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !54, file: !12, line: 1451, baseType: !52, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !54, file: !12, line: 1452, baseType: !11, size: 128, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !49, file: !12, line: 1474, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !12, line: 1456, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !12, line: 1458, size: 128, elements: !63)
!63 = !{!64, !65}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !62, file: !12, line: 1460, baseType: !52, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !62, file: !12, line: 1461, baseType: !60, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !49, file: !12, line: 1487, baseType: !67, size: 192, offset: 128)
!67 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !49, file: !12, line: 1475, size: 192, elements: !68)
!68 = !{!69, !76}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !67, file: !12, line: 1481, baseType: !70, size: 192)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !12, line: 1476, size: 192, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !70, file: !12, line: 1478, baseType: !40, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !70, file: !12, line: 1479, baseType: !40, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !70, file: !12, line: 1480, baseType: !75, size: 32, offset: 128)
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !67, file: !12, line: 1486, baseType: !77, size: 192)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !12, line: 1482, size: 192, elements: !78)
!78 = !{!79, !80, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !77, file: !12, line: 1483, baseType: !52, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !77, file: !12, line: 1484, baseType: !52, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !77, file: !12, line: 1485, baseType: !75, size: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !49, file: !12, line: 1488, baseType: !83, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !12, line: 1394, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !12, line: 1395, size: 192, elements: !86)
!86 = !{!87, !88, !91, !92, !93, !94}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !85, file: !12, line: 1396, baseType: !16, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !85, file: !12, line: 1397, baseType: !89, size: 8, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !12, line: 1342, baseType: !90)
!90 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !85, file: !12, line: 1398, baseType: !35, size: 8, offset: 40)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !85, file: !12, line: 1399, baseType: !35, size: 8, offset: 48)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !85, file: !12, line: 1400, baseType: !83, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !85, file: !12, line: 1401, baseType: !95, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !49, file: !12, line: 1489, baseType: !47, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !49, file: !12, line: 1490, baseType: !47, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !49, file: !12, line: 1491, baseType: !47, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !49, file: !12, line: 1492, baseType: !75, size: 32, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !49, file: !12, line: 1493, baseType: !75, size: 32, offset: 608)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !49, file: !12, line: 1494, baseType: !75, size: 32, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !49, file: !12, line: 1496, baseType: !75, size: 32, offset: 672)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !49, file: !12, line: 1497, baseType: !35, size: 8, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !37, file: !12, line: 1424, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !12, line: 1347, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !12, line: 1545, size: 2816, elements: !108)
!108 = !{!109, !110, !111, !112, !113, !136, !137, !138, !139}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !107, file: !12, line: 1547, baseType: !35, size: 8)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !107, file: !12, line: 1548, baseType: !35, size: 8, offset: 8)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !107, file: !12, line: 1549, baseType: !75, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !107, file: !12, line: 1550, baseType: !75, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !107, file: !12, line: 1551, baseType: !114, size: 2432, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !12, line: 1290, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !12, line: 1277, size: 2432, elements: !116)
!116 = !{!117, !120, !121, !122, !123, !124, !125, !132}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !115, file: !12, line: 1279, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !8, line: 345, baseType: !119)
!119 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !115, file: !12, line: 1281, baseType: !118, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !115, file: !12, line: 1282, baseType: !118, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !115, file: !12, line: 1283, baseType: !75, size: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !115, file: !12, line: 1284, baseType: !75, size: 32, offset: 224)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !115, file: !12, line: 1285, baseType: !75, size: 32, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !115, file: !12, line: 1287, baseType: !126, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !12, line: 1265, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !12, line: 1261, size: 128, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !128, file: !12, line: 1263, baseType: !118, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !128, file: !12, line: 1264, baseType: !6, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !115, file: !12, line: 1289, baseType: !133, size: 2048, offset: 384)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 2048, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 16)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !107, file: !12, line: 1552, baseType: !83, size: 64, offset: 2560)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !107, file: !12, line: 1553, baseType: !105, size: 64, offset: 2624)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !107, file: !12, line: 1554, baseType: !105, size: 64, offset: 2688)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !107, file: !12, line: 1555, baseType: !105, size: 64, offset: 2752)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !37, file: !12, line: 1425, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !12, line: 1348, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !12, line: 1994, size: 832, elements: !144)
!144 = !{!145, !146, !147, !274, !275, !285, !295, !296, !297, !298}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !143, file: !12, line: 1996, baseType: !75, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !143, file: !12, line: 1997, baseType: !6, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !143, file: !12, line: 1999, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !12, line: 1658, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 1597, size: 3072, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !165, !166, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !187, !188, !189, !190, !191, !202, !203, !204, !205, !207, !208, !209, !210, !211, !212, !213, !223, !224, !225, !269, !270}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !150, file: !12, line: 1599, baseType: !75, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !150, file: !12, line: 1600, baseType: !75, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !150, file: !12, line: 1601, baseType: !75, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !150, file: !12, line: 1602, baseType: !75, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !150, file: !12, line: 1603, baseType: !157, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !12, line: 1591, baseType: !158)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 1585, size: 32, elements: !159)
!159 = !{!160, !161, !162, !163, !164}
!160 = !DIEnumerator(name: "UF_NOT_COMPILED", value: 0)
!161 = !DIEnumerator(name: "UF_TO_BE_COMPILED", value: 1)
!162 = !DIEnumerator(name: "UF_COMPILING", value: 2)
!163 = !DIEnumerator(name: "UF_COMPILED", value: 3)
!164 = !DIEnumerator(name: "UF_COMPILE_ERROR", value: 4)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !150, file: !12, line: 1604, baseType: !75, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !150, file: !12, line: 1605, baseType: !167, size: 192, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !12, line: 55, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !12, line: 48, size: 192, elements: !169)
!169 = !{!170, !171, !172, !173, !174}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !168, file: !12, line: 50, baseType: !75, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !168, file: !12, line: 51, baseType: !75, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !168, file: !12, line: 52, baseType: !75, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !168, file: !12, line: 53, baseType: !75, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !168, file: !12, line: 54, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !150, file: !12, line: 1606, baseType: !167, size: 192, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !150, file: !12, line: 1609, baseType: !95, size: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !150, file: !12, line: 1610, baseType: !83, size: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !150, file: !12, line: 1611, baseType: !167, size: 192, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !150, file: !12, line: 1612, baseType: !141, size: 64, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !150, file: !12, line: 1615, baseType: !6, size: 64, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !150, file: !12, line: 1616, baseType: !83, size: 64, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !150, file: !12, line: 1617, baseType: !83, size: 64, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !150, file: !12, line: 1618, baseType: !75, size: 32, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !150, file: !12, line: 1619, baseType: !186, size: 64, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !150, file: !12, line: 1626, baseType: !167, size: 192, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !150, file: !12, line: 1628, baseType: !75, size: 32, offset: 1472)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !150, file: !12, line: 1629, baseType: !75, size: 32, offset: 1504)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !150, file: !12, line: 1631, baseType: !75, size: 32, offset: 1536)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !150, file: !12, line: 1632, baseType: !192, size: 128, offset: 1600)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !8, line: 1786, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !194, line: 8, size: 128, elements: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!195 = !{!196, !200}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !193, file: !194, line: 10, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !198, line: 160, baseType: !199)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!199 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !193, file: !194, line: 11, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !198, line: 162, baseType: !199)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !150, file: !12, line: 1633, baseType: !192, size: 128, offset: 1728)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !150, file: !12, line: 1634, baseType: !192, size: 128, offset: 1856)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !150, file: !12, line: 1636, baseType: !186, size: 64, offset: 1984)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !150, file: !12, line: 1637, baseType: !206, size: 64, offset: 2048)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !150, file: !12, line: 1638, baseType: !206, size: 64, offset: 2112)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !150, file: !12, line: 1639, baseType: !192, size: 128, offset: 2176)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !150, file: !12, line: 1640, baseType: !192, size: 128, offset: 2304)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !150, file: !12, line: 1641, baseType: !192, size: 128, offset: 2432)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !150, file: !12, line: 1642, baseType: !75, size: 32, offset: 2560)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !150, file: !12, line: 1643, baseType: !75, size: 32, offset: 2592)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !150, file: !12, line: 1645, baseType: !214, size: 192, offset: 2624)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !12, line: 92, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 85, size: 192, elements: !216)
!216 = !{!217, !219, !220, !222}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !215, file: !12, line: 87, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !12, line: 62, baseType: !75)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !215, file: !12, line: 88, baseType: !75, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !215, file: !12, line: 89, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !8, line: 1687, baseType: !199)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !215, file: !12, line: 91, baseType: !75, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !150, file: !12, line: 1648, baseType: !75, size: 32, offset: 2816)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !150, file: !12, line: 1649, baseType: !75, size: 32, offset: 2848)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !150, file: !12, line: 1651, baseType: !226, size: 64, offset: 2880)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !12, line: 1582, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !12, line: 1682, size: 17280, elements: !229)
!229 = !{!230, !231, !232, !233, !253, !254, !255, !256, !257, !258, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !228, file: !12, line: 1684, baseType: !148, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !228, file: !12, line: 1685, baseType: !75, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !228, file: !12, line: 1686, baseType: !75, size: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !228, file: !12, line: 1691, baseType: !234, size: 4608, offset: 128)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 4608, elements: !251)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !228, file: !12, line: 1687, size: 384, elements: !236)
!236 = !{!237, !247}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !235, file: !12, line: 1689, baseType: !238, size: 192)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !12, line: 1519, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !12, line: 1513, size: 192, elements: !240)
!240 = !{!241, !242, !243}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !239, file: !12, line: 1515, baseType: !11, size: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !239, file: !12, line: 1516, baseType: !7, size: 8, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !239, file: !12, line: 1517, baseType: !244, size: 8, offset: 136)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 1)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "room", scope: !235, file: !12, line: 1690, baseType: !248, size: 160, offset: 192)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 20)
!251 = !{!252}
!252 = !DISubrange(count: 12)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars", scope: !228, file: !12, line: 1692, baseType: !106, size: 2816, offset: 4736)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars_var", scope: !228, file: !12, line: 1693, baseType: !238, size: 192, offset: 7552)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars", scope: !228, file: !12, line: 1694, baseType: !106, size: 2816, offset: 7744)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars_var", scope: !228, file: !12, line: 1695, baseType: !238, size: 192, offset: 10560)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "l_varlist", scope: !228, file: !12, line: 1696, baseType: !48, size: 768, offset: 10752)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "l_listitems", scope: !228, file: !12, line: 1697, baseType: !259, size: 5120, offset: 11520)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 5120, elements: !249)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "rettv", scope: !228, file: !12, line: 1698, baseType: !10, size: 64, offset: 16640)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !228, file: !12, line: 1699, baseType: !221, size: 64, offset: 16704)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "dbg_tick", scope: !228, file: !12, line: 1700, baseType: !75, size: 32, offset: 16768)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !228, file: !12, line: 1701, baseType: !75, size: 32, offset: 16800)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prof_child", scope: !228, file: !12, line: 1703, baseType: !192, size: 128, offset: 16832)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !228, file: !12, line: 1705, baseType: !226, size: 64, offset: 16960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fc_refcount", scope: !228, file: !12, line: 1709, baseType: !75, size: 32, offset: 17024)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "fc_copyID", scope: !228, file: !12, line: 1711, baseType: !75, size: 32, offset: 17056)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fc_funcs", scope: !228, file: !12, line: 1712, baseType: !167, size: 192, offset: 17088)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name_exp", scope: !150, file: !12, line: 1653, baseType: !6, size: 64, offset: 2944)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name", scope: !150, file: !12, line: 1655, baseType: !271, size: 32, offset: 3008)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 4)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pt_auto", scope: !143, file: !12, line: 2001, baseType: !75, size: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pt_outer", scope: !143, file: !12, line: 2005, baseType: !276, size: 256, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "outer_T", file: !12, line: 1986, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_S", file: !12, line: 1987, size: 256, elements: !278)
!278 = !{!279, !281, !282, !284}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "out_stack", scope: !277, file: !12, line: 1988, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame_idx", scope: !277, file: !12, line: 1989, baseType: !75, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "out_up", scope: !277, file: !12, line: 1990, baseType: !283, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "out_up_is_copy", scope: !277, file: !12, line: 1991, baseType: !75, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pt_funcstack", scope: !143, file: !12, line: 2007, baseType: !286, size: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "funcstack_T", file: !12, line: 1984, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcstack_S", file: !12, line: 1972, size: 320, elements: !289)
!289 = !{!290, !291, !292, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ga", scope: !288, file: !12, line: 1974, baseType: !167, size: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fs_var_offset", scope: !288, file: !12, line: 1978, baseType: !75, size: 32, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fs_refcount", scope: !288, file: !12, line: 1981, baseType: !75, size: 32, offset: 224)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fs_min_refcount", scope: !288, file: !12, line: 1982, baseType: !75, size: 32, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "fs_copyID", scope: !288, file: !12, line: 1983, baseType: !75, size: 32, offset: 288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argc", scope: !143, file: !12, line: 2010, baseType: !75, size: 32, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argv", scope: !143, file: !12, line: 2011, baseType: !10, size: 64, offset: 640)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pt_dict", scope: !143, file: !12, line: 2013, baseType: !105, size: 64, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pt_copyID", scope: !143, file: !12, line: 2014, baseType: !75, size: 32, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !37, file: !12, line: 1427, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !12, line: 1365, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !12, line: 2072, size: 1024, elements: !303)
!303 = !{!304, !305, !306, !310, !311, !312, !320, !321, !322, !323, !330, !1642, !1643, !1644, !1756}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !302, file: !12, line: 2074, baseType: !300, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !302, file: !12, line: 2075, baseType: !300, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !302, file: !12, line: 2077, baseType: !307, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !308, line: 97, baseType: !309)
!308 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !198, line: 154, baseType: !75)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !302, file: !12, line: 2083, baseType: !6, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !302, file: !12, line: 2084, baseType: !6, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !302, file: !12, line: 2085, baseType: !313, size: 32, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !12, line: 2067, baseType: !314)
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 2061, size: 32, elements: !315)
!315 = !{!316, !317, !318, !319}
!316 = !DIEnumerator(name: "JOB_FAILED", value: 0)
!317 = !DIEnumerator(name: "JOB_STARTED", value: 1)
!318 = !DIEnumerator(name: "JOB_ENDED", value: 2)
!319 = !DIEnumerator(name: "JOB_FINISHED", value: 3)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !302, file: !12, line: 2086, baseType: !6, size: 64, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !302, file: !12, line: 2088, baseType: !6, size: 64, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !302, file: !12, line: 2093, baseType: !75, size: 32, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !302, file: !12, line: 2094, baseType: !324, size: 192, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !12, line: 1360, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 1356, size: 192, elements: !326)
!326 = !{!327, !328, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !325, file: !12, line: 1357, baseType: !6, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !325, file: !12, line: 1358, baseType: !141, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !325, file: !12, line: 1359, baseType: !75, size: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !302, file: !12, line: 2096, baseType: !331, size: 64, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !12, line: 63, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !12, line: 2629, size: 73152, elements: !334)
!334 = !{!335, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !444, !447, !448, !452, !453, !463, !464, !465, !466, !467, !468, !469, !470, !1315, !1316, !1317, !1322, !1323, !1324, !1328, !1336, !1337, !1338, !1339, !1340, !1342, !1343, !1344, !1345, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1589, !1590, !1591, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1625, !1626, !1627, !1628, !1629, !1636, !1637, !1641}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !333, file: !12, line: 2631, baseType: !336, size: 832)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !12, line: 766, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !12, line: 737, size: 832, elements: !338)
!338 = !{!339, !340, !402, !411, !412, !413, !414, !416, !417, !418, !419, !420, !421, !422, !429, !430}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !337, file: !12, line: 739, baseType: !221, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !337, file: !12, line: 741, baseType: !341, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !12, line: 459, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !12, line: 671, size: 9856, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !369, !370, !371, !373, !374, !387, !388, !389, !390, !391, !392, !393, !394, !395, !399, !400, !401}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !343, file: !12, line: 673, baseType: !6, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !343, file: !12, line: 674, baseType: !6, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !343, file: !12, line: 675, baseType: !75, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !343, file: !12, line: 676, baseType: !75, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !343, file: !12, line: 677, baseType: !75, size: 32, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !343, file: !12, line: 678, baseType: !351, size: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !12, line: 458, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !12, line: 506, size: 448, elements: !354)
!354 = !{!355, !364, !365, !366, !367, !368}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !353, file: !12, line: 508, baseType: !356, size: 192)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !12, line: 469, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !12, line: 471, size: 192, elements: !358)
!358 = !{!359, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !357, file: !12, line: 473, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !357, file: !12, line: 474, baseType: !360, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !357, file: !12, line: 475, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !12, line: 460, baseType: !199)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !353, file: !12, line: 511, baseType: !351, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !353, file: !12, line: 512, baseType: !351, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !353, file: !12, line: 513, baseType: !6, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !353, file: !12, line: 514, baseType: !75, size: 32, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !353, file: !12, line: 518, baseType: !35, size: 8, offset: 416)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !343, file: !12, line: 679, baseType: !351, size: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !343, file: !12, line: 680, baseType: !351, size: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !343, file: !12, line: 681, baseType: !372, size: 32, offset: 448)
!372 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !343, file: !12, line: 682, baseType: !372, size: 32, offset: 480)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !343, file: !12, line: 683, baseType: !375, size: 4352, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !12, line: 489, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !12, line: 480, size: 4352, elements: !377)
!377 = !{!378, !379, !380, !382, !386}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !376, file: !12, line: 482, baseType: !118, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !376, file: !12, line: 484, baseType: !118, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !376, file: !12, line: 485, baseType: !381, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !376, file: !12, line: 487, baseType: !383, size: 4096, offset: 192)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 4096, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !376, file: !12, line: 488, baseType: !35, size: 8, offset: 4288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !343, file: !12, line: 684, baseType: !375, size: 4352, offset: 4864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !343, file: !12, line: 685, baseType: !363, size: 64, offset: 9216)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !343, file: !12, line: 686, baseType: !363, size: 64, offset: 9280)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !343, file: !12, line: 687, baseType: !363, size: 64, offset: 9344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !343, file: !12, line: 688, baseType: !363, size: 64, offset: 9408)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !343, file: !12, line: 689, baseType: !372, size: 32, offset: 9472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !343, file: !12, line: 690, baseType: !75, size: 32, offset: 9504)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !343, file: !12, line: 692, baseType: !331, size: 64, offset: 9536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !343, file: !12, line: 693, baseType: !396, size: 64, offset: 9600)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 8)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !343, file: !12, line: 697, baseType: !6, size: 64, offset: 9664)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !343, file: !12, line: 698, baseType: !75, size: 32, offset: 9728)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !343, file: !12, line: 699, baseType: !396, size: 64, offset: 9760)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !337, file: !12, line: 743, baseType: !403, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !12, line: 717, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !12, line: 711, size: 256, elements: !406)
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !405, file: !12, line: 713, baseType: !363, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !405, file: !12, line: 714, baseType: !221, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !405, file: !12, line: 715, baseType: !221, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !405, file: !12, line: 716, baseType: !75, size: 32, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !337, file: !12, line: 744, baseType: !75, size: 32, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !337, file: !12, line: 745, baseType: !75, size: 32, offset: 224)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !337, file: !12, line: 751, baseType: !75, size: 32, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !337, file: !12, line: 753, baseType: !415, size: 32, offset: 288)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !8, line: 1688, baseType: !75)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !337, file: !12, line: 754, baseType: !221, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !337, file: !12, line: 755, baseType: !6, size: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !337, file: !12, line: 757, baseType: !351, size: 64, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !337, file: !12, line: 758, baseType: !221, size: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !337, file: !12, line: 759, baseType: !221, size: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !337, file: !12, line: 760, baseType: !75, size: 32, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !337, file: !12, line: 762, baseType: !423, size: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !12, line: 724, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !12, line: 720, size: 128, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !425, file: !12, line: 722, baseType: !75, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !425, file: !12, line: 723, baseType: !199, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !337, file: !12, line: 763, baseType: !75, size: 32, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !337, file: !12, line: 764, baseType: !75, size: 32, offset: 800)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !333, file: !12, line: 2634, baseType: !331, size: 64, offset: 832)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !333, file: !12, line: 2635, baseType: !331, size: 64, offset: 896)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !333, file: !12, line: 2637, baseType: !75, size: 32, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !333, file: !12, line: 2639, baseType: !75, size: 32, offset: 992)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !333, file: !12, line: 2640, baseType: !75, size: 32, offset: 1024)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !333, file: !12, line: 2642, baseType: !75, size: 32, offset: 1056)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !333, file: !12, line: 2651, baseType: !6, size: 64, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !333, file: !12, line: 2652, baseType: !6, size: 64, offset: 1152)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !333, file: !12, line: 2654, baseType: !6, size: 64, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !333, file: !12, line: 2658, baseType: !75, size: 32, offset: 1280)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !333, file: !12, line: 2659, baseType: !442, size: 64, offset: 1344)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !308, line: 59, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !198, line: 145, baseType: !119)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !333, file: !12, line: 2660, baseType: !445, size: 64, offset: 1408)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !308, line: 47, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !198, line: 148, baseType: !119)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !333, file: !12, line: 2667, baseType: !75, size: 32, offset: 1472)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !333, file: !12, line: 2668, baseType: !449, size: 72, offset: 1504)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 72, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 9)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !333, file: !12, line: 2672, baseType: !75, size: 32, offset: 1600)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !333, file: !12, line: 2674, baseType: !454, size: 320, offset: 1664)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !12, line: 1532, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !12, line: 1526, size: 320, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !455, file: !12, line: 1528, baseType: !11, size: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !455, file: !12, line: 1529, baseType: !7, size: 8, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !455, file: !12, line: 1530, baseType: !460, size: 136, offset: 136)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 136, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 17)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !333, file: !12, line: 2679, baseType: !40, size: 64, offset: 1984)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !333, file: !12, line: 2681, baseType: !40, size: 64, offset: 2048)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !333, file: !12, line: 2684, baseType: !75, size: 32, offset: 2112)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !333, file: !12, line: 2691, baseType: !75, size: 32, offset: 2144)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !333, file: !12, line: 2693, baseType: !221, size: 64, offset: 2176)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !333, file: !12, line: 2694, baseType: !221, size: 64, offset: 2240)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !333, file: !12, line: 2696, baseType: !199, size: 64, offset: 2304)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !333, file: !12, line: 2699, baseType: !471, size: 64, offset: 2368)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !12, line: 60, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !12, line: 325, size: 11648, elements: !474)
!474 = !{!475, !476, !477, !1310, !1311, !1312, !1313, !1314}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !473, file: !12, line: 327, baseType: !471, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !473, file: !12, line: 328, baseType: !471, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !473, file: !12, line: 329, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !12, line: 59, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !12, line: 3365, size: 72064, elements: !481)
!481 = !{!482, !483, !484, !485, !486, !641, !642, !657, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !714, !715, !716, !717, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !746, !747, !749, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !775, !776, !777, !778, !779, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !839, !840, !841, !842, !843, !1122, !1130, !1131, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1223, !1224, !1225, !1226, !1267, !1268, !1278, !1279, !1280, !1281, !1282, !1302, !1303, !1304, !1305, !1309}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !480, file: !12, line: 3367, baseType: !75, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !480, file: !12, line: 3369, baseType: !331, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !480, file: !12, line: 3371, baseType: !478, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !480, file: !12, line: 3372, baseType: !478, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !480, file: !12, line: 3375, baseType: !487, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !12, line: 2618, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 2542, size: 9920, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !506, !507, !508, !509, !510, !568, !576, !577, !578, !579, !580, !617, !618, !619, !620, !621, !622, !624, !625, !629, !630, !631, !632, !633, !634, !635, !636, !640}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !489, file: !12, line: 2544, baseType: !114, size: 2432)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !489, file: !12, line: 2545, baseType: !114, size: 2432, offset: 2432)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !489, file: !12, line: 2546, baseType: !75, size: 32, offset: 4864)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !489, file: !12, line: 2548, baseType: !75, size: 32, offset: 4896)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !489, file: !12, line: 2550, baseType: !75, size: 32, offset: 4928)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !489, file: !12, line: 2551, baseType: !75, size: 32, offset: 4960)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !489, file: !12, line: 2552, baseType: !75, size: 32, offset: 4992)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !489, file: !12, line: 2553, baseType: !167, size: 192, offset: 5056)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !489, file: !12, line: 2554, baseType: !167, size: 192, offset: 5248)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !489, file: !12, line: 2555, baseType: !75, size: 32, offset: 5440)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !489, file: !12, line: 2556, baseType: !75, size: 32, offset: 5472)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !489, file: !12, line: 2557, baseType: !75, size: 32, offset: 5504)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !489, file: !12, line: 2559, baseType: !75, size: 32, offset: 5536)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !489, file: !12, line: 2560, baseType: !505, size: 16, offset: 5568)
!505 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !489, file: !12, line: 2561, baseType: !199, size: 64, offset: 5632)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !489, file: !12, line: 2562, baseType: !199, size: 64, offset: 5696)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !489, file: !12, line: 2563, baseType: !199, size: 64, offset: 5760)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !489, file: !12, line: 2564, baseType: !6, size: 64, offset: 5824)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !489, file: !12, line: 2565, baseType: !511, size: 64, offset: 5888)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !513, line: 56, baseType: !514)
!513 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !513, line: 49, size: 192, elements: !515)
!515 = !{!516, !564, !565, !566, !567}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !514, file: !513, line: 51, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !513, line: 42, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !513, line: 167, size: 320, elements: !520)
!520 = !{!521, !525, !529, !544, !563}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !519, file: !513, line: 169, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!511, !6, !75}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !519, file: !513, line: 170, baseType: !526, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !511}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !519, file: !513, line: 171, baseType: !530, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!75, !533, !6, !415, !75}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !513, line: 137, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 131, size: 1408, elements: !536)
!536 = !{!537, !538, !542, !543}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !535, file: !513, line: 133, baseType: !511, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !535, file: !513, line: 134, baseType: !539, size: 640, offset: 64)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 640, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 10)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !535, file: !513, line: 135, baseType: !539, size: 640, offset: 704)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !535, file: !513, line: 136, baseType: !75, size: 32, offset: 1344)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !519, file: !513, line: 172, baseType: !545, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!199, !548, !478, !331, !221, !415, !206, !186}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !513, line: 154, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 147, size: 2688, elements: !551)
!551 = !{!552, !553, !560, !561, !562}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !550, file: !513, line: 149, baseType: !511, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !550, file: !513, line: 150, baseType: !554, size: 1280, offset: 64)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 1280, elements: !540)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !12, line: 41, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 37, size: 128, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !556, file: !12, line: 39, baseType: !221, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !556, file: !12, line: 40, baseType: !415, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !550, file: !513, line: 151, baseType: !554, size: 1280, offset: 1344)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !550, file: !513, line: 152, baseType: !75, size: 32, offset: 2624)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !550, file: !513, line: 153, baseType: !415, size: 32, offset: 2656)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !519, file: !513, line: 173, baseType: !6, size: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !514, file: !513, line: 52, baseType: !372, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !514, file: !513, line: 53, baseType: !372, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !514, file: !513, line: 54, baseType: !372, size: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !514, file: !513, line: 55, baseType: !75, size: 32, offset: 160)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !489, file: !12, line: 2567, baseType: !569, size: 384, offset: 5952)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !12, line: 2475, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 2470, size: 384, elements: !571)
!571 = !{!572, !573, !574, !575}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !570, file: !12, line: 2471, baseType: !192, size: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !570, file: !12, line: 2472, baseType: !192, size: 128, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !570, file: !12, line: 2473, baseType: !199, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !570, file: !12, line: 2474, baseType: !199, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !489, file: !12, line: 2569, baseType: !75, size: 32, offset: 6336)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !489, file: !12, line: 2570, baseType: !75, size: 32, offset: 6368)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !489, file: !12, line: 2572, baseType: !75, size: 32, offset: 6400)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !489, file: !12, line: 2575, baseType: !75, size: 32, offset: 6432)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !489, file: !12, line: 2592, baseType: !581, size: 64, offset: 6464)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !12, line: 1061, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !12, line: 1063, size: 1728, elements: !584)
!584 = !{!585, !586, !587, !609, !610, !611, !613, !616}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !583, file: !12, line: 1065, baseType: !581, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !583, file: !12, line: 1066, baseType: !221, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !583, file: !12, line: 1071, baseType: !588, size: 1344, offset: 128)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !583, file: !12, line: 1067, size: 1344, elements: !589)
!589 = !{!590, !608}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !588, file: !12, line: 1069, baseType: !591, size: 1344)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 1344, elements: !606)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !12, line: 1055, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !12, line: 1046, size: 192, elements: !594)
!594 = !{!595, !596, !597, !598, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !593, file: !12, line: 1048, baseType: !75, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !593, file: !12, line: 1049, baseType: !75, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !593, file: !12, line: 1051, baseType: !75, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !593, file: !12, line: 1052, baseType: !75, size: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !593, file: !12, line: 1054, baseType: !600, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !513, line: 165, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 161, size: 704, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !602, file: !513, line: 163, baseType: !505, size: 16)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !602, file: !513, line: 164, baseType: !539, size: 640, offset: 64)
!606 = !{!607}
!607 = !DISubrange(count: 7)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !588, file: !12, line: 1070, baseType: !167, size: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !583, file: !12, line: 1072, baseType: !75, size: 32, offset: 1472)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !583, file: !12, line: 1073, baseType: !75, size: 32, offset: 1504)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !583, file: !12, line: 1074, baseType: !612, size: 64, offset: 1536)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !583, file: !12, line: 1076, baseType: !614, size: 16, offset: 1600)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !8, line: 1689, baseType: !615)
!615 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !583, file: !12, line: 1077, baseType: !221, size: 64, offset: 1664)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !489, file: !12, line: 2593, baseType: !75, size: 32, offset: 6528)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !489, file: !12, line: 2594, baseType: !581, size: 64, offset: 6592)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !489, file: !12, line: 2595, baseType: !581, size: 64, offset: 6656)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !489, file: !12, line: 2596, baseType: !75, size: 32, offset: 6720)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !489, file: !12, line: 2597, baseType: !221, size: 64, offset: 6784)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !489, file: !12, line: 2598, baseType: !623, size: 16, offset: 6848)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !8, line: 325, baseType: !615)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !489, file: !12, line: 2603, baseType: !167, size: 192, offset: 6912)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !489, file: !12, line: 2604, baseType: !626, size: 2048, offset: 7104)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !489, file: !12, line: 2605, baseType: !6, size: 64, offset: 9152)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !489, file: !12, line: 2606, baseType: !6, size: 64, offset: 9216)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !489, file: !12, line: 2607, baseType: !511, size: 64, offset: 9280)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !489, file: !12, line: 2608, baseType: !6, size: 64, offset: 9344)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !489, file: !12, line: 2609, baseType: !6, size: 64, offset: 9408)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !489, file: !12, line: 2610, baseType: !6, size: 64, offset: 9472)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !489, file: !12, line: 2611, baseType: !75, size: 32, offset: 9536)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !489, file: !12, line: 2616, baseType: !637, size: 256, offset: 9568)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !489, file: !12, line: 2617, baseType: !6, size: 64, offset: 9856)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !480, file: !12, line: 3378, baseType: !75, size: 32, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !480, file: !12, line: 3381, baseType: !643, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !12, line: 61, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !12, line: 3231, size: 512, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !645, file: !12, line: 3233, baseType: !35, size: 8)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !645, file: !12, line: 3234, baseType: !75, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !645, file: !12, line: 3235, baseType: !75, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !645, file: !12, line: 3236, baseType: !75, size: 32, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !645, file: !12, line: 3237, baseType: !75, size: 32, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !645, file: !12, line: 3238, baseType: !643, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !645, file: !12, line: 3239, baseType: !643, size: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !645, file: !12, line: 3241, baseType: !643, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !645, file: !12, line: 3244, baseType: !643, size: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !645, file: !12, line: 3245, baseType: !478, size: 64, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !480, file: !12, line: 3383, baseType: !658, size: 128, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !12, line: 31, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 26, size: 128, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !659, file: !12, line: 28, baseType: !221, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !659, file: !12, line: 29, baseType: !415, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !659, file: !12, line: 30, baseType: !415, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !480, file: !12, line: 3385, baseType: !415, size: 32, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !480, file: !12, line: 3389, baseType: !75, size: 32, offset: 608)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !480, file: !12, line: 3394, baseType: !221, size: 64, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !480, file: !12, line: 3400, baseType: !35, size: 8, offset: 704)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !480, file: !12, line: 3401, baseType: !221, size: 64, offset: 768)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !480, file: !12, line: 3402, baseType: !415, size: 32, offset: 832)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !480, file: !12, line: 3403, baseType: !415, size: 32, offset: 864)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !480, file: !12, line: 3404, baseType: !221, size: 64, offset: 896)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !480, file: !12, line: 3405, baseType: !415, size: 32, offset: 960)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !480, file: !12, line: 3406, baseType: !415, size: 32, offset: 992)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !480, file: !12, line: 3408, baseType: !675, size: 352, offset: 1024)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !12, line: 3358, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 3343, size: 352, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !676, file: !12, line: 3345, baseType: !75, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !676, file: !12, line: 3346, baseType: !75, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !676, file: !12, line: 3347, baseType: !75, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !676, file: !12, line: 3348, baseType: !75, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !676, file: !12, line: 3349, baseType: !75, size: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !676, file: !12, line: 3350, baseType: !75, size: 32, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !676, file: !12, line: 3351, baseType: !75, size: 32, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !676, file: !12, line: 3352, baseType: !75, size: 32, offset: 224)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !676, file: !12, line: 3353, baseType: !75, size: 32, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !676, file: !12, line: 3354, baseType: !75, size: 32, offset: 288)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !676, file: !12, line: 3356, baseType: !75, size: 32, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !480, file: !12, line: 3414, baseType: !221, size: 64, offset: 1408)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !480, file: !12, line: 3416, baseType: !35, size: 8, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !480, file: !12, line: 3419, baseType: !221, size: 64, offset: 1536)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !480, file: !12, line: 3423, baseType: !75, size: 32, offset: 1600)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !480, file: !12, line: 3424, baseType: !75, size: 32, offset: 1632)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !480, file: !12, line: 3425, baseType: !75, size: 32, offset: 1664)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !480, file: !12, line: 3427, baseType: !75, size: 32, offset: 1696)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !480, file: !12, line: 3429, baseType: !415, size: 32, offset: 1728)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !480, file: !12, line: 3432, baseType: !415, size: 32, offset: 1760)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !480, file: !12, line: 3435, baseType: !75, size: 32, offset: 1792)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !480, file: !12, line: 3437, baseType: !75, size: 32, offset: 1824)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !480, file: !12, line: 3445, baseType: !75, size: 32, offset: 1856)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !480, file: !12, line: 3446, baseType: !75, size: 32, offset: 1888)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !480, file: !12, line: 3449, baseType: !75, size: 32, offset: 1920)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !480, file: !12, line: 3450, baseType: !75, size: 32, offset: 1952)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !480, file: !12, line: 3451, baseType: !75, size: 32, offset: 1984)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !480, file: !12, line: 3452, baseType: !75, size: 32, offset: 2016)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !480, file: !12, line: 3454, baseType: !707, size: 320, offset: 2048)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !12, line: 3330, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 3324, size: 320, elements: !709)
!709 = !{!710, !711, !712, !713}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !708, file: !12, line: 3326, baseType: !75, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !708, file: !12, line: 3327, baseType: !75, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !708, file: !12, line: 3328, baseType: !658, size: 128, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !708, file: !12, line: 3329, baseType: !658, size: 128, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !480, file: !12, line: 3457, baseType: !75, size: 32, offset: 2368)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !480, file: !12, line: 3458, baseType: !75, size: 32, offset: 2400)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !480, file: !12, line: 3459, baseType: !6, size: 64, offset: 2432)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !480, file: !12, line: 3460, baseType: !718, size: 32, offset: 2496)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !12, line: 2524, baseType: !719)
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 2517, size: 32, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726}
!721 = !DIEnumerator(name: "POPPOS_BOTLEFT", value: 0)
!722 = !DIEnumerator(name: "POPPOS_TOPLEFT", value: 1)
!723 = !DIEnumerator(name: "POPPOS_BOTRIGHT", value: 2)
!724 = !DIEnumerator(name: "POPPOS_TOPRIGHT", value: 3)
!725 = !DIEnumerator(name: "POPPOS_CENTER", value: 4)
!726 = !DIEnumerator(name: "POPPOS_NONE", value: 5)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !480, file: !12, line: 3461, baseType: !75, size: 32, offset: 2528)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !480, file: !12, line: 3462, baseType: !75, size: 32, offset: 2560)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !480, file: !12, line: 3463, baseType: !478, size: 64, offset: 2624)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !480, file: !12, line: 3464, baseType: !75, size: 32, offset: 2688)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !480, file: !12, line: 3465, baseType: !75, size: 32, offset: 2720)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !480, file: !12, line: 3466, baseType: !75, size: 32, offset: 2752)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !480, file: !12, line: 3467, baseType: !75, size: 32, offset: 2784)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !480, file: !12, line: 3468, baseType: !75, size: 32, offset: 2816)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !480, file: !12, line: 3469, baseType: !75, size: 32, offset: 2848)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !480, file: !12, line: 3470, baseType: !75, size: 32, offset: 2880)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !480, file: !12, line: 3471, baseType: !75, size: 32, offset: 2912)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !480, file: !12, line: 3472, baseType: !75, size: 32, offset: 2944)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !480, file: !12, line: 3473, baseType: !75, size: 32, offset: 2976)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !480, file: !12, line: 3474, baseType: !75, size: 32, offset: 3008)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !480, file: !12, line: 3475, baseType: !75, size: 32, offset: 3040)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !480, file: !12, line: 3476, baseType: !6, size: 64, offset: 3072)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !480, file: !12, line: 3477, baseType: !6, size: 64, offset: 3136)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !480, file: !12, line: 3478, baseType: !745, size: 128, offset: 3200)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, elements: !272)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !480, file: !12, line: 3479, baseType: !745, size: 128, offset: 3328)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !480, file: !12, line: 3480, baseType: !748, size: 256, offset: 3456)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !272)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !480, file: !12, line: 3481, baseType: !750, size: 256, offset: 3712)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 256, elements: !397)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !480, file: !12, line: 3483, baseType: !75, size: 32, offset: 3968)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !480, file: !12, line: 3484, baseType: !75, size: 32, offset: 4000)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !480, file: !12, line: 3485, baseType: !40, size: 64, offset: 4032)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !480, file: !12, line: 3487, baseType: !40, size: 64, offset: 4096)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !480, file: !12, line: 3490, baseType: !75, size: 32, offset: 4160)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !480, file: !12, line: 3493, baseType: !221, size: 64, offset: 4224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !480, file: !12, line: 3495, baseType: !324, size: 192, offset: 4288)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !480, file: !12, line: 3496, baseType: !324, size: 192, offset: 4480)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !480, file: !12, line: 3497, baseType: !75, size: 32, offset: 4672)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !480, file: !12, line: 3498, baseType: !75, size: 32, offset: 4704)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !480, file: !12, line: 3500, baseType: !478, size: 64, offset: 4736)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !480, file: !12, line: 3501, baseType: !221, size: 64, offset: 4800)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !480, file: !12, line: 3502, baseType: !415, size: 32, offset: 4864)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !480, file: !12, line: 3503, baseType: !415, size: 32, offset: 4896)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !480, file: !12, line: 3504, baseType: !75, size: 32, offset: 4928)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !480, file: !12, line: 3505, baseType: !75, size: 32, offset: 4960)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !480, file: !12, line: 3506, baseType: !75, size: 32, offset: 4992)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !480, file: !12, line: 3507, baseType: !769, size: 32, offset: 5024)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !12, line: 2530, baseType: !770)
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 2526, size: 32, elements: !771)
!771 = !{!772, !773, !774}
!772 = !DIEnumerator(name: "POPCLOSE_NONE", value: 0)
!773 = !DIEnumerator(name: "POPCLOSE_BUTTON", value: 1)
!774 = !DIEnumerator(name: "POPCLOSE_CLICK", value: 2)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !480, file: !12, line: 3509, baseType: !47, size: 64, offset: 5056)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !480, file: !12, line: 3510, baseType: !6, size: 64, offset: 5120)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !480, file: !12, line: 3511, baseType: !75, size: 32, offset: 5184)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !480, file: !12, line: 3512, baseType: !75, size: 32, offset: 5216)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !480, file: !12, line: 3514, baseType: !780, size: 64, offset: 5248)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !12, line: 2478, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !12, line: 2479, size: 704, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !782, file: !12, line: 2481, baseType: !199, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !782, file: !12, line: 2483, baseType: !780, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !782, file: !12, line: 2484, baseType: !780, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !782, file: !12, line: 2485, baseType: !192, size: 128, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !782, file: !12, line: 2486, baseType: !35, size: 8, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !782, file: !12, line: 2487, baseType: !35, size: 8, offset: 328)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !782, file: !12, line: 2488, baseType: !75, size: 32, offset: 352)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !782, file: !12, line: 2489, baseType: !199, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !782, file: !12, line: 2490, baseType: !324, size: 192, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !782, file: !12, line: 2491, baseType: !75, size: 32, offset: 640)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !480, file: !12, line: 3517, baseType: !75, size: 32, offset: 5312)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !480, file: !12, line: 3534, baseType: !75, size: 32, offset: 5344)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !480, file: !12, line: 3535, baseType: !658, size: 128, offset: 5376)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !480, file: !12, line: 3537, baseType: !415, size: 32, offset: 5504)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !480, file: !12, line: 3543, baseType: !75, size: 32, offset: 5536)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !480, file: !12, line: 3545, baseType: !75, size: 32, offset: 5568)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !480, file: !12, line: 3548, baseType: !75, size: 32, offset: 5600)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !480, file: !12, line: 3550, baseType: !415, size: 32, offset: 5632)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !480, file: !12, line: 3562, baseType: !75, size: 32, offset: 5664)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !480, file: !12, line: 3562, baseType: !75, size: 32, offset: 5696)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !480, file: !12, line: 3574, baseType: !75, size: 32, offset: 5728)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !480, file: !12, line: 3575, baseType: !806, size: 64, offset: 5760)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !12, line: 3225, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !12, line: 3216, size: 192, elements: !809)
!809 = !{!810, !811, !812, !813, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !808, file: !12, line: 3218, baseType: !221, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !808, file: !12, line: 3219, baseType: !623, size: 16, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !808, file: !12, line: 3220, baseType: !35, size: 8, offset: 80)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !808, file: !12, line: 3222, baseType: !35, size: 8, offset: 88)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !808, file: !12, line: 3223, baseType: !221, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !480, file: !12, line: 3578, baseType: !167, size: 192, offset: 5824)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !480, file: !12, line: 3579, baseType: !35, size: 8, offset: 6016)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !480, file: !12, line: 3581, baseType: !35, size: 8, offset: 6024)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !480, file: !12, line: 3585, baseType: !75, size: 32, offset: 6048)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !480, file: !12, line: 3593, baseType: !75, size: 32, offset: 6080)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !480, file: !12, line: 3594, baseType: !75, size: 32, offset: 6112)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_top", scope: !480, file: !12, line: 3596, baseType: !221, size: 64, offset: 6144)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_bot", scope: !480, file: !12, line: 3597, baseType: !221, size: 64, offset: 6208)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_status", scope: !480, file: !12, line: 3598, baseType: !75, size: 32, offset: 6272)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_cursor", scope: !480, file: !12, line: 3602, baseType: !658, size: 128, offset: 6336)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_virtcol", scope: !480, file: !12, line: 3603, baseType: !415, size: 32, offset: 6464)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topline", scope: !480, file: !12, line: 3604, baseType: !221, size: 64, offset: 6528)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_line_count", scope: !480, file: !12, line: 3605, baseType: !221, size: 64, offset: 6592)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topfill", scope: !480, file: !12, line: 3607, baseType: !75, size: 32, offset: 6656)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_empty", scope: !480, file: !12, line: 3609, baseType: !35, size: 8, offset: 6688)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "w_alt_fnum", scope: !480, file: !12, line: 3612, baseType: !75, size: 32, offset: 6720)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "w_alist", scope: !480, file: !12, line: 3614, baseType: !832, size: 64, offset: 6784)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "alist_T", file: !12, line: 863, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arglist", file: !12, line: 858, size: 256, elements: !835)
!835 = !{!836, !837, !838}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "al_ga", scope: !834, file: !12, line: 860, baseType: !167, size: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "al_refcount", scope: !834, file: !12, line: 861, baseType: !75, size: 32, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !834, file: !12, line: 862, baseType: !75, size: 32, offset: 224)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx", scope: !480, file: !12, line: 3615, baseType: !75, size: 32, offset: 6848)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx_invalid", scope: !480, file: !12, line: 3617, baseType: !75, size: 32, offset: 6880)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "w_localdir", scope: !480, file: !12, line: 3619, baseType: !6, size: 64, offset: 6912)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "w_prevdir", scope: !480, file: !12, line: 3621, baseType: !6, size: 64, offset: 6976)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "w_winbar", scope: !480, file: !12, line: 3623, baseType: !844, size: 64, offset: 7040)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "vimmenu_T", file: !12, line: 67, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VimMenu", file: !12, line: 3889, size: 1984, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !861, !862, !863, !864, !866, !867, !869, !870, !871, !872, !1119, !1120, !1121}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !846, file: !12, line: 3891, baseType: !75, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !846, file: !12, line: 3892, baseType: !75, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !846, file: !12, line: 3893, baseType: !6, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "dname", scope: !846, file: !12, line: 3894, baseType: !6, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "en_name", scope: !846, file: !12, line: 3896, baseType: !6, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "en_dname", scope: !846, file: !12, line: 3898, baseType: !6, size: 64, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic", scope: !846, file: !12, line: 3901, baseType: !75, size: 32, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "actext", scope: !846, file: !12, line: 3902, baseType: !6, size: 64, offset: 384)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !846, file: !12, line: 3903, baseType: !75, size: 32, offset: 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !846, file: !12, line: 3905, baseType: !858, size: 64, offset: 512)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !844}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "iconfile", scope: !846, file: !12, line: 3908, baseType: !6, size: 64, offset: 576)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "iconidx", scope: !846, file: !12, line: 3909, baseType: !75, size: 32, offset: 640)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "icon_builtin", scope: !846, file: !12, line: 3910, baseType: !75, size: 32, offset: 672)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "strings", scope: !846, file: !12, line: 3912, baseType: !865, size: 512, offset: 704)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, elements: !397)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "noremap", scope: !846, file: !12, line: 3913, baseType: !750, size: 256, offset: 1216)
