; ModuleID = 'userfunc.c'
source_filename = "userfunc.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.hashtable_S = type { i64, i64, i64, i32, i32, i32, %struct.hashitem_S*, [16 x %struct.hashitem_S] }
%struct.hashitem_S = type { i64, i8* }
%struct.type_S = type { i32, i8, i8, i8, %struct.type_S*, %struct.type_S** }
%struct.funccall_S = type { %struct.ufunc_T*, i32, i32, [12 x %struct.anon.7], %struct.dictvar_S, %struct.dictitem_S, %struct.dictvar_S, %struct.dictitem_S, %struct.listvar_S, [20 x %struct.listitem_S], %struct.typval_T*, i64, i32, i32, %struct.timeval, %struct.funccall_S*, i32, i32, %struct.growarray }
%struct.ufunc_T = type { i32, i32, i32, i32, i32, i32, %struct.growarray, %struct.growarray, %struct.type_S**, %struct.type_S*, %struct.growarray, %struct.partial_S*, i8*, %struct.type_S*, %struct.type_S*, i32, i32*, %struct.growarray, i32, i32, i32, %struct.timeval, %struct.timeval, %struct.timeval, i32*, %struct.timeval*, %struct.timeval*, %struct.timeval, %struct.timeval, %struct.timeval, i32, i32, %struct.sctx_T, i32, i32, %struct.funccall_S*, i8*, [4 x i8] }
%struct.partial_S = type { i32, i8*, %struct.ufunc_T*, i32, %struct.outer_S, %struct.funcstack_S*, i32, %struct.typval_T*, %struct.dictvar_S*, i32 }
%struct.outer_S = type { %struct.growarray*, i32, %struct.outer_S*, i32 }
%struct.funcstack_S = type { %struct.growarray, i32, i32, i32, i32 }
%struct.sctx_T = type { i32, i32, i64, i32 }

!842 = !DIEnumerator(name: "CMD_trewind", value: 499)
!843 = !DIEnumerator(name: "CMD_try", value: 500)
!844 = !DIEnumerator(name: "CMD_tselect", value: 501)
!845 = !DIEnumerator(name: "CMD_tunmenu", value: 502)
!846 = !DIEnumerator(name: "CMD_tunmap", value: 503)
!847 = !DIEnumerator(name: "CMD_undo", value: 504)
!848 = !DIEnumerator(name: "CMD_undojoin", value: 505)
!849 = !DIEnumerator(name: "CMD_undolist", value: 506)
!850 = !DIEnumerator(name: "CMD_unabbreviate", value: 507)
!851 = !DIEnumerator(name: "CMD_unhide", value: 508)
!852 = !DIEnumerator(name: "CMD_unlet", value: 509)
!853 = !DIEnumerator(name: "CMD_unlockvar", value: 510)
!854 = !DIEnumerator(name: "CMD_unmap", value: 511)
!855 = !DIEnumerator(name: "CMD_unmenu", value: 512)
!856 = !DIEnumerator(name: "CMD_unsilent", value: 513)
!857 = !DIEnumerator(name: "CMD_update", value: 514)
!858 = !DIEnumerator(name: "CMD_vglobal", value: 515)
!859 = !DIEnumerator(name: "CMD_var", value: 516)
!860 = !DIEnumerator(name: "CMD_version", value: 517)
!861 = !DIEnumerator(name: "CMD_verbose", value: 518)
!862 = !DIEnumerator(name: "CMD_vertical", value: 519)
!863 = !DIEnumerator(name: "CMD_visual", value: 520)
!864 = !DIEnumerator(name: "CMD_view", value: 521)
!865 = !DIEnumerator(name: "CMD_vimgrep", value: 522)
!866 = !DIEnumerator(name: "CMD_vimgrepadd", value: 523)
!867 = !DIEnumerator(name: "CMD_vim9cmd", value: 524)
!868 = !DIEnumerator(name: "CMD_vim9script", value: 525)
!869 = !DIEnumerator(name: "CMD_viusage", value: 526)
!870 = !DIEnumerator(name: "CMD_vmap", value: 527)
!871 = !DIEnumerator(name: "CMD_vmapclear", value: 528)
!872 = !DIEnumerator(name: "CMD_vmenu", value: 529)
!873 = !DIEnumerator(name: "CMD_vnoremap", value: 530)
!874 = !DIEnumerator(name: "CMD_vnew", value: 531)
!875 = !DIEnumerator(name: "CMD_vnoremenu", value: 532)
!876 = !DIEnumerator(name: "CMD_vsplit", value: 533)
!877 = !DIEnumerator(name: "CMD_vunmap", value: 534)
!878 = !DIEnumerator(name: "CMD_vunmenu", value: 535)
!879 = !DIEnumerator(name: "CMD_write", value: 536)
!880 = !DIEnumerator(name: "CMD_wNext", value: 537)
!881 = !DIEnumerator(name: "CMD_wall", value: 538)
!882 = !DIEnumerator(name: "CMD_while", value: 539)
!883 = !DIEnumerator(name: "CMD_winsize", value: 540)
!884 = !DIEnumerator(name: "CMD_wincmd", value: 541)
!885 = !DIEnumerator(name: "CMD_windo", value: 542)
!886 = !DIEnumerator(name: "CMD_winpos", value: 543)
!887 = !DIEnumerator(name: "CMD_wnext", value: 544)
!888 = !DIEnumerator(name: "CMD_wprevious", value: 545)
!889 = !DIEnumerator(name: "CMD_wq", value: 546)
!890 = !DIEnumerator(name: "CMD_wqall", value: 547)
!891 = !DIEnumerator(name: "CMD_wundo", value: 548)
!892 = !DIEnumerator(name: "CMD_wviminfo", value: 549)
!893 = !DIEnumerator(name: "CMD_xit", value: 550)
!894 = !DIEnumerator(name: "CMD_xall", value: 551)
!895 = !DIEnumerator(name: "CMD_xmap", value: 552)
!896 = !DIEnumerator(name: "CMD_xmapclear", value: 553)
!897 = !DIEnumerator(name: "CMD_xmenu", value: 554)
!898 = !DIEnumerator(name: "CMD_xnoremap", value: 555)
!899 = !DIEnumerator(name: "CMD_xnoremenu", value: 556)
!900 = !DIEnumerator(name: "CMD_xrestore", value: 557)
!901 = !DIEnumerator(name: "CMD_xunmap", value: 558)
!902 = !DIEnumerator(name: "CMD_xunmenu", value: 559)
!903 = !DIEnumerator(name: "CMD_yank", value: 560)
!904 = !DIEnumerator(name: "CMD_z", value: 561)
!905 = !DIEnumerator(name: "CMD_bang", value: 562)
!906 = !DIEnumerator(name: "CMD_pound", value: 563)
!907 = !DIEnumerator(name: "CMD_and", value: 564)
!908 = !DIEnumerator(name: "CMD_star", value: 565)
!909 = !DIEnumerator(name: "CMD_lshift", value: 566)
!910 = !DIEnumerator(name: "CMD_equal", value: 567)
!911 = !DIEnumerator(name: "CMD_rshift", value: 568)
!912 = !DIEnumerator(name: "CMD_at", value: 569)
!913 = !DIEnumerator(name: "CMD_block", value: 570)
!914 = !DIEnumerator(name: "CMD_endblock", value: 571)
!915 = !DIEnumerator(name: "CMD_tilde", value: 572)
!916 = !DIEnumerator(name: "CMD_Next", value: 573)
!917 = !DIEnumerator(name: "CMD_Print", value: 574)
!918 = !DIEnumerator(name: "CMD_X", value: 575)
!919 = !DIEnumerator(name: "CMD_SIZE", value: 576)
!920 = !DIEnumerator(name: "CMD_USER", value: -1)
!921 = !DIEnumerator(name: "CMD_USER_BUF", value: -2)
!922 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !341, line: 68, size: 32, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935}
!924 = !DIEnumerator(name: "ADDR_LINES", value: 0)
!925 = !DIEnumerator(name: "ADDR_WINDOWS", value: 1)
!926 = !DIEnumerator(name: "ADDR_ARGUMENTS", value: 2)
!927 = !DIEnumerator(name: "ADDR_LOADED_BUFFERS", value: 3)
!928 = !DIEnumerator(name: "ADDR_BUFFERS", value: 4)
!929 = !DIEnumerator(name: "ADDR_TABS", value: 5)
!930 = !DIEnumerator(name: "ADDR_TABS_RELATIVE", value: 6)
!931 = !DIEnumerator(name: "ADDR_QUICKFIX_VALID", value: 7)
!932 = !DIEnumerator(name: "ADDR_QUICKFIX", value: 8)
!933 = !DIEnumerator(name: "ADDR_UNSIGNED", value: 9)
!934 = !DIEnumerator(name: "ADDR_OTHER", value: 10)
!935 = !DIEnumerator(name: "ADDR_NONE", value: 11)
!936 = !{!937, !939, !940, !945, !2614, !2615, !947, !2657, !1008, !2497, !951, !1457, !973, !1214, !995, !2490, !1035, !2658, !1030, !1060, !2659, !2554}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !6, line: 1348, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !6, line: 1994, size: 832, elements: !943)
!943 = !{!944, !946, !950, !2589, !2590, !2600, !2610, !2611, !2612, !2613}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !942, file: !6, line: 1996, baseType: !945, size: 32)
!945 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !942, file: !6, line: 1997, baseType: !947, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !230, line: 324, baseType: !949)
!949 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !942, file: !6, line: 1999, baseType: !951, size: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !6, line: 1658, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1597, size: 3072, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !961, !962, !971, !972, !987, !988, !989, !990, !991, !992, !993, !994, !996, !997, !998, !999, !1000, !1011, !1012, !1013, !1014, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1032, !1033, !1034, !2586, !2587}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !953, file: !6, line: 1599, baseType: !945, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !953, file: !6, line: 1600, baseType: !945, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !953, file: !6, line: 1601, baseType: !945, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !953, file: !6, line: 1602, baseType: !945, size: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !953, file: !6, line: 1603, baseType: !960, size: 32, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !6, line: 1591, baseType: !23)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !953, file: !6, line: 1604, baseType: !945, size: 32, offset: 160)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !953, file: !6, line: 1605, baseType: !963, size: 192, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !6, line: 55, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !6, line: 48, size: 192, elements: !965)
!965 = !{!966, !967, !968, !969, !970}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !964, file: !6, line: 50, baseType: !945, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !964, file: !6, line: 51, baseType: !945, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !964, file: !6, line: 52, baseType: !945, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !964, file: !6, line: 53, baseType: !945, size: 32, offset: 96)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !964, file: !6, line: 54, baseType: !939, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !953, file: !6, line: 1606, baseType: !963, size: 192, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !953, file: !6, line: 1609, baseType: !973, size: 64, offset: 576)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !6, line: 1394, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !6, line: 1395, size: 192, elements: !977)
!977 = !{!978, !980, !983, !984, !985, !986}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !976, file: !6, line: 1396, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !6, line: 1391, baseType: !5)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !976, file: !6, line: 1397, baseType: !981, size: 8, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !6, line: 1342, baseType: !982)
!982 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !976, file: !6, line: 1398, baseType: !938, size: 8, offset: 40)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !976, file: !6, line: 1399, baseType: !938, size: 8, offset: 48)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !976, file: !6, line: 1400, baseType: !974, size: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !976, file: !6, line: 1401, baseType: !973, size: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !953, file: !6, line: 1610, baseType: !974, size: 64, offset: 640)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !953, file: !6, line: 1611, baseType: !963, size: 192, offset: 704)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !953, file: !6, line: 1612, baseType: !940, size: 64, offset: 896)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !953, file: !6, line: 1615, baseType: !947, size: 64, offset: 960)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !953, file: !6, line: 1616, baseType: !974, size: 64, offset: 1024)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !953, file: !6, line: 1617, baseType: !974, size: 64, offset: 1088)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !953, file: !6, line: 1618, baseType: !945, size: 32, offset: 1152)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !953, file: !6, line: 1619, baseType: !995, size: 64, offset: 1216)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !953, file: !6, line: 1626, baseType: !963, size: 192, offset: 1280)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !953, file: !6, line: 1628, baseType: !945, size: 32, offset: 1472)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !953, file: !6, line: 1629, baseType: !945, size: 32, offset: 1504)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !953, file: !6, line: 1631, baseType: !945, size: 32, offset: 1536)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !953, file: !6, line: 1632, baseType: !1001, size: 128, offset: 1600)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !230, line: 1786, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1003, line: 8, size: 128, elements: !1004)
!1003 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!1004 = !{!1005, !1009}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1002, file: !1003, line: 10, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !1007, line: 160, baseType: !1008)
!1007 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!1008 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1002, file: !1003, line: 11, baseType: !1010, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !1007, line: 162, baseType: !1008)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !953, file: !6, line: 1633, baseType: !1001, size: 128, offset: 1728)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !953, file: !6, line: 1634, baseType: !1001, size: 128, offset: 1856)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !953, file: !6, line: 1636, baseType: !995, size: 64, offset: 1984)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !953, file: !6, line: 1637, baseType: !1015, size: 64, offset: 2048)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !953, file: !6, line: 1638, baseType: !1015, size: 64, offset: 2112)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !953, file: !6, line: 1639, baseType: !1001, size: 128, offset: 2176)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !953, file: !6, line: 1640, baseType: !1001, size: 128, offset: 2304)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !953, file: !6, line: 1641, baseType: !1001, size: 128, offset: 2432)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !953, file: !6, line: 1642, baseType: !945, size: 32, offset: 2560)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !953, file: !6, line: 1643, baseType: !945, size: 32, offset: 2592)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !953, file: !6, line: 1645, baseType: !1023, size: 192, offset: 2624)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !6, line: 92, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 85, size: 192, elements: !1025)
!1025 = !{!1026, !1028, !1029, !1031}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !1024, file: !6, line: 87, baseType: !1027, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !6, line: 62, baseType: !945)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !1024, file: !6, line: 88, baseType: !945, size: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !1024, file: !6, line: 89, baseType: !1030, size: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !230, line: 1687, baseType: !1008)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !1024, file: !6, line: 91, baseType: !945, size: 32, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !953, file: !6, line: 1648, baseType: !945, size: 32, offset: 2816)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !953, file: !6, line: 1649, baseType: !945, size: 32, offset: 2848)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !953, file: !6, line: 1651, baseType: !1035, size: 64, offset: 2880)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !6, line: 1582, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !6, line: 1682, size: 17280, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !2570, !2571, !2572, !2573, !2574, !2575, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1037, file: !6, line: 1684, baseType: !951, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !1037, file: !6, line: 1685, baseType: !945, size: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !1037, file: !6, line: 1686, baseType: !945, size: 32, offset: 96)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !1037, file: !6, line: 1691, baseType: !1043, size: 4608, offset: 128)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1044, size: 4608, elements: !2568)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1037, file: !6, line: 1687, size: 384, elements: !1045)
!1045 = !{!1046, !2566}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1044, file: !6, line: 1689, baseType: !1047, size: 192)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !6, line: 1519, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !6, line: 1513, size: 192, elements: !1049)
!1049 = !{!1050, !2564, !2565}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !1048, file: !6, line: 1515, baseType: !1051, size: 128)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !6, line: 1432, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1412, size: 128, elements: !1053)
!1053 = !{!1054, !1055, !1056}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !1052, file: !6, line: 1414, baseType: !979, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !1052, file: !6, line: 1415, baseType: !938, size: 8, offset: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !1052, file: !6, line: 1431, baseType: !1057, size: 64, offset: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1052, file: !6, line: 1416, size: 64, elements: !1058)
!1058 = !{!1059, !1062, !1065, !1066, !1110, !1146, !1147, !2555, !2556}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !1057, file: !6, line: 1418, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !6, line: 1327, baseType: !1061)
!1061 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !1057, file: !6, line: 1420, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !6, line: 1344, baseType: !1064)
!1064 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !1057, file: !6, line: 1422, baseType: !947, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !1057, file: !6, line: 1423, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !6, line: 1346, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !6, line: 1471, size: 768, elements: !1070)
!1070 = !{!1071, !1079, !1086, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !1069, file: !6, line: 1473, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !6, line: 1446, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !6, line: 1448, size: 256, elements: !1075)
!1075 = !{!1076, !1077, !1078}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !1074, file: !6, line: 1450, baseType: !1072, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !1074, file: !6, line: 1451, baseType: !1072, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !1074, file: !6, line: 1452, baseType: !1051, size: 128, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !1069, file: !6, line: 1474, baseType: !1080, size: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !6, line: 1456, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !6, line: 1458, size: 128, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !1082, file: !6, line: 1460, baseType: !1072, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !1082, file: !6, line: 1461, baseType: !1080, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !1069, file: !6, line: 1487, baseType: !1087, size: 192, offset: 128)
!1087 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1069, file: !6, line: 1475, size: 192, elements: !1088)
!1088 = !{!1089, !1095}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !1087, file: !6, line: 1481, baseType: !1090, size: 192)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1087, file: !6, line: 1476, size: 192, elements: !1091)
!1091 = !{!1092, !1093, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !1090, file: !6, line: 1478, baseType: !1060, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !1090, file: !6, line: 1479, baseType: !1060, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !1090, file: !6, line: 1480, baseType: !945, size: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1087, file: !6, line: 1486, baseType: !1096, size: 192)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1087, file: !6, line: 1482, size: 192, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !1096, file: !6, line: 1483, baseType: !1072, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !1096, file: !6, line: 1484, baseType: !1072, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !1096, file: !6, line: 1485, baseType: !945, size: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !1069, file: !6, line: 1488, baseType: !974, size: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !1069, file: !6, line: 1489, baseType: !1067, size: 64, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !1069, file: !6, line: 1490, baseType: !1067, size: 64, offset: 448)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !1069, file: !6, line: 1491, baseType: !1067, size: 64, offset: 512)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !1069, file: !6, line: 1492, baseType: !945, size: 32, offset: 576)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !1069, file: !6, line: 1493, baseType: !945, size: 32, offset: 608)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !1069, file: !6, line: 1494, baseType: !945, size: 32, offset: 640)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !1069, file: !6, line: 1496, baseType: !945, size: 32, offset: 672)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !1069, file: !6, line: 1497, baseType: !938, size: 8, offset: 704)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !1057, file: !6, line: 1424, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !6, line: 1347, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !6, line: 1545, size: 2816, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1142, !1143, !1144, !1145}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !1113, file: !6, line: 1547, baseType: !938, size: 8)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !1113, file: !6, line: 1548, baseType: !938, size: 8, offset: 8)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !1113, file: !6, line: 1549, baseType: !945, size: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !1113, file: !6, line: 1550, baseType: !945, size: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !1113, file: !6, line: 1551, baseType: !1120, size: 2432, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !6, line: 1290, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !6, line: 1277, size: 2432, elements: !1122)
!1122 = !{!1123, !1126, !1127, !1128, !1129, !1130, !1131, !1138}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !1121, file: !6, line: 1279, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !230, line: 345, baseType: !1125)
!1125 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !1121, file: !6, line: 1281, baseType: !1124, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !1121, file: !6, line: 1282, baseType: !1124, size: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !1121, file: !6, line: 1283, baseType: !945, size: 32, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !1121, file: !6, line: 1284, baseType: !945, size: 32, offset: 224)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !1121, file: !6, line: 1285, baseType: !945, size: 32, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !1121, file: !6, line: 1287, baseType: !1132, size: 64, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !6, line: 1265, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !6, line: 1261, size: 128, elements: !1135)
!1135 = !{!1136, !1137}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !1134, file: !6, line: 1263, baseType: !1124, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !1134, file: !6, line: 1264, baseType: !947, size: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !1121, file: !6, line: 1289, baseType: !1139, size: 2048, offset: 384)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1133, size: 2048, elements: !1140)
!1140 = !{!1141}
!1141 = !DISubrange(count: 16)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !1113, file: !6, line: 1552, baseType: !974, size: 64, offset: 2560)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !1113, file: !6, line: 1553, baseType: !1111, size: 64, offset: 2624)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !1113, file: !6, line: 1554, baseType: !1111, size: 64, offset: 2688)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !1113, file: !6, line: 1555, baseType: !1111, size: 64, offset: 2752)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !1057, file: !6, line: 1425, baseType: !940, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !1057, file: !6, line: 1427, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !6, line: 1365, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !6, line: 2072, size: 1024, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1158, !1159, !1160, !1162, !1163, !1164, !1165, !1172, !2452, !2453, !2454, !2553}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !1150, file: !6, line: 2074, baseType: !1148, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !1150, file: !6, line: 2075, baseType: !1148, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !1150, file: !6, line: 2077, baseType: !1155, size: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !1156, line: 97, baseType: !1157)
!1156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !1007, line: 154, baseType: !945)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !1150, file: !6, line: 2083, baseType: !947, size: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !1150, file: !6, line: 2084, baseType: !947, size: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !1150, file: !6, line: 2085, baseType: !1161, size: 32, offset: 320)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !6, line: 2067, baseType: !30)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !1150, file: !6, line: 2086, baseType: !947, size: 64, offset: 384)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !1150, file: !6, line: 2088, baseType: !947, size: 64, offset: 448)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !1150, file: !6, line: 2093, baseType: !945, size: 32, offset: 512)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !1150, file: !6, line: 2094, baseType: !1166, size: 192, offset: 576)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !6, line: 1360, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1356, size: 192, elements: !1168)
!1168 = !{!1169, !1170, !1171}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !1167, file: !6, line: 1357, baseType: !947, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !1167, file: !6, line: 1358, baseType: !940, size: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !1167, file: !6, line: 1359, baseType: !945, size: 32, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !1150, file: !6, line: 2096, baseType: !1173, size: 64, offset: 768)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !6, line: 63, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !6, line: 2629, size: 73152, elements: !1176)
!1176 = !{!1177, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1286, !1289, !1290, !1294, !1295, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !2122, !2123, !2124, !2129, !2130, !2131, !2135, !2143, !2144, !2145, !2146, !2147, !2149, !2150, !2151, !2152, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2396, !2397, !2398, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2435, !2436, !2437, !2438, !2439, !2446, !2447, !2451}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !1175, file: !6, line: 2631, baseType: !1178, size: 832)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !6, line: 766, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !6, line: 737, size: 832, elements: !1180)
!1180 = !{!1181, !1182, !1244, !1253, !1254, !1255, !1256, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1271, !1272}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !1179, file: !6, line: 739, baseType: !1030, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !1179, file: !6, line: 741, baseType: !1183, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !6, line: 459, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !6, line: 671, size: 9856, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1191, !1192, !1211, !1212, !1213, !1215, !1216, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1241, !1242, !1243}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !1185, file: !6, line: 673, baseType: !947, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !1185, file: !6, line: 674, baseType: !947, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !1185, file: !6, line: 675, baseType: !945, size: 32, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !1185, file: !6, line: 676, baseType: !945, size: 32, offset: 160)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !1185, file: !6, line: 677, baseType: !945, size: 32, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !1185, file: !6, line: 678, baseType: !1193, size: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !6, line: 458, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !6, line: 506, size: 448, elements: !1196)
!1196 = !{!1197, !1206, !1207, !1208, !1209, !1210}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !1195, file: !6, line: 508, baseType: !1198, size: 192)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !6, line: 469, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !6, line: 471, size: 192, elements: !1200)
!1200 = !{!1201, !1203, !1204}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !1199, file: !6, line: 473, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !1199, file: !6, line: 474, baseType: !1202, size: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !1199, file: !6, line: 475, baseType: !1205, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !6, line: 460, baseType: !1008)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !1195, file: !6, line: 511, baseType: !1193, size: 64, offset: 192)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !1195, file: !6, line: 512, baseType: !1193, size: 64, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !1195, file: !6, line: 513, baseType: !947, size: 64, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !1195, file: !6, line: 514, baseType: !945, size: 32, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !1195, file: !6, line: 518, baseType: !938, size: 8, offset: 416)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !1185, file: !6, line: 679, baseType: !1193, size: 64, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !1185, file: !6, line: 680, baseType: !1193, size: 64, offset: 384)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !1185, file: !6, line: 681, baseType: !1214, size: 32, offset: 448)
!1214 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !1185, file: !6, line: 682, baseType: !1214, size: 32, offset: 480)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !1185, file: !6, line: 683, baseType: !1217, size: 4352, offset: 512)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !6, line: 489, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !6, line: 480, size: 4352, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1224, !1228}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !1218, file: !6, line: 482, baseType: !1124, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !1218, file: !6, line: 484, baseType: !1124, size: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !1218, file: !6, line: 485, baseType: !1223, size: 64, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !1218, file: !6, line: 487, baseType: !1225, size: 4096, offset: 192)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 4096, elements: !1226)
!1226 = !{!1227}
!1227 = !DISubrange(count: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !1218, file: !6, line: 488, baseType: !938, size: 8, offset: 4288)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !1185, file: !6, line: 684, baseType: !1217, size: 4352, offset: 4864)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !1185, file: !6, line: 685, baseType: !1205, size: 64, offset: 9216)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !1185, file: !6, line: 686, baseType: !1205, size: 64, offset: 9280)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !1185, file: !6, line: 687, baseType: !1205, size: 64, offset: 9344)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !1185, file: !6, line: 688, baseType: !1205, size: 64, offset: 9408)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !1185, file: !6, line: 689, baseType: !1214, size: 32, offset: 9472)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !1185, file: !6, line: 690, baseType: !945, size: 32, offset: 9504)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !1185, file: !6, line: 692, baseType: !1173, size: 64, offset: 9536)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !1185, file: !6, line: 693, baseType: !1238, size: 64, offset: 9600)
!1238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 64, elements: !1239)
!1239 = !{!1240}
!1240 = !DISubrange(count: 8)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !1185, file: !6, line: 697, baseType: !947, size: 64, offset: 9664)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !1185, file: !6, line: 698, baseType: !945, size: 32, offset: 9728)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !1185, file: !6, line: 699, baseType: !1238, size: 64, offset: 9760)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !1179, file: !6, line: 743, baseType: !1245, size: 64, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !6, line: 717, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !6, line: 711, size: 256, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1252}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !1247, file: !6, line: 713, baseType: !1205, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !1247, file: !6, line: 714, baseType: !1030, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !1247, file: !6, line: 715, baseType: !1030, size: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !1247, file: !6, line: 716, baseType: !945, size: 32, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !1179, file: !6, line: 744, baseType: !945, size: 32, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !1179, file: !6, line: 745, baseType: !945, size: 32, offset: 224)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !1179, file: !6, line: 751, baseType: !945, size: 32, offset: 256)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !1179, file: !6, line: 753, baseType: !1257, size: 32, offset: 288)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !230, line: 1688, baseType: !945)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !1179, file: !6, line: 754, baseType: !1030, size: 64, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !1179, file: !6, line: 755, baseType: !947, size: 64, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !1179, file: !6, line: 757, baseType: !1193, size: 64, offset: 448)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !1179, file: !6, line: 758, baseType: !1030, size: 64, offset: 512)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !1179, file: !6, line: 759, baseType: !1030, size: 64, offset: 576)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !1179, file: !6, line: 760, baseType: !945, size: 32, offset: 640)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !1179, file: !6, line: 762, baseType: !1265, size: 64, offset: 704)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !6, line: 724, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !6, line: 720, size: 128, elements: !1268)
!1268 = !{!1269, !1270}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !1267, file: !6, line: 722, baseType: !945, size: 32)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !1267, file: !6, line: 723, baseType: !1008, size: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !1179, file: !6, line: 763, baseType: !945, size: 32, offset: 768)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !1179, file: !6, line: 764, baseType: !945, size: 32, offset: 800)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !1175, file: !6, line: 2634, baseType: !1173, size: 64, offset: 832)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !1175, file: !6, line: 2635, baseType: !1173, size: 64, offset: 896)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !1175, file: !6, line: 2637, baseType: !945, size: 32, offset: 960)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !1175, file: !6, line: 2639, baseType: !945, size: 32, offset: 992)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !1175, file: !6, line: 2640, baseType: !945, size: 32, offset: 1024)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !1175, file: !6, line: 2642, baseType: !945, size: 32, offset: 1056)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !1175, file: !6, line: 2651, baseType: !947, size: 64, offset: 1088)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !1175, file: !6, line: 2652, baseType: !947, size: 64, offset: 1152)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !1175, file: !6, line: 2654, baseType: !947, size: 64, offset: 1216)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !1175, file: !6, line: 2658, baseType: !945, size: 32, offset: 1280)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !1175, file: !6, line: 2659, baseType: !1284, size: 64, offset: 1344)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !1156, line: 59, baseType: !1285)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !1007, line: 145, baseType: !1125)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !1175, file: !6, line: 2660, baseType: !1287, size: 64, offset: 1408)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !1156, line: 47, baseType: !1288)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !1007, line: 148, baseType: !1125)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !1175, file: !6, line: 2667, baseType: !945, size: 32, offset: 1472)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !1175, file: !6, line: 2668, baseType: !1291, size: 72, offset: 1504)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 72, elements: !1292)
!1292 = !{!1293}
!1293 = !DISubrange(count: 9)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !1175, file: !6, line: 2672, baseType: !945, size: 32, offset: 1600)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !1175, file: !6, line: 2674, baseType: !1296, size: 320, offset: 1664)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !6, line: 1532, baseType: !1297)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !6, line: 1526, size: 320, elements: !1298)
!1298 = !{!1299, !1300, !1301}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !1297, file: !6, line: 1528, baseType: !1051, size: 128)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !1297, file: !6, line: 1529, baseType: !948, size: 8, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !1297, file: !6, line: 1530, baseType: !1302, size: 136, offset: 136)
!1302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 136, elements: !1303)
!1303 = !{!1304}
!1304 = !DISubrange(count: 17)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !1175, file: !6, line: 2679, baseType: !1060, size: 64, offset: 1984)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !1175, file: !6, line: 2681, baseType: !1060, size: 64, offset: 2048)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !1175, file: !6, line: 2684, baseType: !945, size: 32, offset: 2112)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !1175, file: !6, line: 2691, baseType: !945, size: 32, offset: 2144)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !1175, file: !6, line: 2693, baseType: !1030, size: 64, offset: 2176)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !1175, file: !6, line: 2694, baseType: !1030, size: 64, offset: 2240)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !1175, file: !6, line: 2696, baseType: !1008, size: 64, offset: 2304)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !1175, file: !6, line: 2699, baseType: !1313, size: 64, offset: 2368)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !6, line: 60, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !6, line: 325, size: 11648, elements: !1316)
!1316 = !{!1317, !1318, !1319, !2117, !2118, !2119, !2120, !2121}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !1315, file: !6, line: 327, baseType: !1313, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !1315, file: !6, line: 328, baseType: !1313, size: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !1315, file: !6, line: 329, baseType: !1320, size: 64, offset: 128)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !6, line: 59, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !6, line: 3365, size: 72064, elements: !1323)
!1323 = !{!1324, !1325, !1326, !1327, !1328, !1483, !1484, !1499, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1556, !1557, !1558, !1559, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1582, !1583, !1585, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1606, !1607, !1608, !1609, !1610, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1670, !1671, !1672, !1673, !1674, !1927, !1935, !1936, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2028, !2029, !2030, !2031, !2072, !2073, !2085, !2086, !2087, !2088, !2089, !2109, !2110, !2111, !2112, !2116}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !1322, file: !6, line: 3367, baseType: !945, size: 32)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !1322, file: !6, line: 3369, baseType: !1173, size: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !1322, file: !6, line: 3371, baseType: !1320, size: 64, offset: 128)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !1322, file: !6, line: 3372, baseType: !1320, size: 64, offset: 192)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !1322, file: !6, line: 3375, baseType: !1329, size: 64, offset: 256)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !6, line: 2618, baseType: !1331)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2542, size: 9920, elements: !1332)
!1332 = !{!1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1348, !1349, !1350, !1351, !1352, !1410, !1418, !1419, !1420, !1421, !1422, !1459, !1460, !1461, !1462, !1463, !1464, !1466, !1467, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1482}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !1331, file: !6, line: 2544, baseType: !1120, size: 2432)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !1331, file: !6, line: 2545, baseType: !1120, size: 2432, offset: 2432)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !1331, file: !6, line: 2546, baseType: !945, size: 32, offset: 4864)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !1331, file: !6, line: 2548, baseType: !945, size: 32, offset: 4896)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !1331, file: !6, line: 2550, baseType: !945, size: 32, offset: 4928)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !1331, file: !6, line: 2551, baseType: !945, size: 32, offset: 4960)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !1331, file: !6, line: 2552, baseType: !945, size: 32, offset: 4992)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !1331, file: !6, line: 2553, baseType: !963, size: 192, offset: 5056)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !1331, file: !6, line: 2554, baseType: !963, size: 192, offset: 5248)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !1331, file: !6, line: 2555, baseType: !945, size: 32, offset: 5440)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !1331, file: !6, line: 2556, baseType: !945, size: 32, offset: 5472)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !1331, file: !6, line: 2557, baseType: !945, size: 32, offset: 5504)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !1331, file: !6, line: 2559, baseType: !945, size: 32, offset: 5536)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !1331, file: !6, line: 2560, baseType: !1347, size: 16, offset: 5568)
!1347 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !1331, file: !6, line: 2561, baseType: !1008, size: 64, offset: 5632)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !1331, file: !6, line: 2562, baseType: !1008, size: 64, offset: 5696)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !1331, file: !6, line: 2563, baseType: !1008, size: 64, offset: 5760)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !1331, file: !6, line: 2564, baseType: !947, size: 64, offset: 5824)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !1331, file: !6, line: 2565, baseType: !1353, size: 64, offset: 5888)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !1355, line: 56, baseType: !1356)
!1355 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !1355, line: 49, size: 192, elements: !1357)
!1357 = !{!1358, !1406, !1407, !1408, !1409}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !1356, file: !1355, line: 51, baseType: !1359, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !1355, line: 42, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !1355, line: 167, size: 320, elements: !1362)
!1362 = !{!1363, !1367, !1371, !1386, !1405}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !1361, file: !1355, line: 169, baseType: !1364, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!1353, !947, !945}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !1361, file: !1355, line: 170, baseType: !1368, size: 64, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{null, !1353}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !1361, file: !1355, line: 171, baseType: !1372, size: 64, offset: 128)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64)
!1373 = !DISubroutineType(types: !1374)
!1374 = !{!945, !1375, !947, !1257, !945}
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !1355, line: 137, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1355, line: 131, size: 1408, elements: !1378)
!1378 = !{!1379, !1380, !1384, !1385}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !1377, file: !1355, line: 133, baseType: !1353, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !1377, file: !1355, line: 134, baseType: !1381, size: 640, offset: 64)
!1381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 640, elements: !1382)
!1382 = !{!1383}
!1383 = !DISubrange(count: 10)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !1377, file: !1355, line: 135, baseType: !1381, size: 640, offset: 704)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !1377, file: !1355, line: 136, baseType: !945, size: 32, offset: 1344)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !1361, file: !1355, line: 172, baseType: !1387, size: 64, offset: 192)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{!1008, !1390, !1320, !1173, !1030, !1257, !1015, !995}
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !1355, line: 154, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1355, line: 147, size: 2688, elements: !1393)
!1393 = !{!1394, !1395, !1402, !1403, !1404}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !1392, file: !1355, line: 149, baseType: !1353, size: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !1392, file: !1355, line: 150, baseType: !1396, size: 1280, offset: 64)
!1396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1397, size: 1280, elements: !1382)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !6, line: 41, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 37, size: 128, elements: !1399)
!1399 = !{!1400, !1401}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !1398, file: !6, line: 39, baseType: !1030, size: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1398, file: !6, line: 40, baseType: !1257, size: 32, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !1392, file: !1355, line: 151, baseType: !1396, size: 1280, offset: 1344)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !1392, file: !1355, line: 152, baseType: !945, size: 32, offset: 2624)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !1392, file: !1355, line: 153, baseType: !1257, size: 32, offset: 2656)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1361, file: !1355, line: 173, baseType: !947, size: 64, offset: 256)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !1356, file: !1355, line: 52, baseType: !1214, size: 32, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !1356, file: !1355, line: 53, baseType: !1214, size: 32, offset: 96)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !1356, file: !1355, line: 54, baseType: !1214, size: 32, offset: 128)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !1356, file: !1355, line: 55, baseType: !945, size: 32, offset: 160)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !1331, file: !6, line: 2567, baseType: !1411, size: 384, offset: 5952)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !6, line: 2475, baseType: !1412)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2470, size: 384, elements: !1413)
!1413 = !{!1414, !1415, !1416, !1417}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1412, file: !6, line: 2471, baseType: !1001, size: 128)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !1412, file: !6, line: 2472, baseType: !1001, size: 128, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1412, file: !6, line: 2473, baseType: !1008, size: 64, offset: 256)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !1412, file: !6, line: 2474, baseType: !1008, size: 64, offset: 320)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !1331, file: !6, line: 2569, baseType: !945, size: 32, offset: 6336)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !1331, file: !6, line: 2570, baseType: !945, size: 32, offset: 6368)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !1331, file: !6, line: 2572, baseType: !945, size: 32, offset: 6400)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !1331, file: !6, line: 2575, baseType: !945, size: 32, offset: 6432)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !1331, file: !6, line: 2592, baseType: !1423, size: 64, offset: 6464)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !6, line: 1061, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !6, line: 1063, size: 1728, elements: !1426)
!1426 = !{!1427, !1428, !1429, !1451, !1452, !1453, !1455, !1458}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !1425, file: !6, line: 1065, baseType: !1423, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !1425, file: !6, line: 1066, baseType: !1030, size: 64, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !1425, file: !6, line: 1071, baseType: !1430, size: 1344, offset: 128)
!1430 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1425, file: !6, line: 1067, size: 1344, elements: !1431)
!1431 = !{!1432, !1450}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !1430, file: !6, line: 1069, baseType: !1433, size: 1344)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1434, size: 1344, elements: !1448)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !6, line: 1055, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !6, line: 1046, size: 192, elements: !1436)
!1436 = !{!1437, !1438, !1439, !1440, !1441}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !1435, file: !6, line: 1048, baseType: !945, size: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !1435, file: !6, line: 1049, baseType: !945, size: 32, offset: 32)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !1435, file: !6, line: 1051, baseType: !945, size: 32, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !1435, file: !6, line: 1052, baseType: !945, size: 32, offset: 96)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !1435, file: !6, line: 1054, baseType: !1442, size: 64, offset: 128)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !1355, line: 165, baseType: !1444)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1355, line: 161, size: 704, elements: !1445)
!1445 = !{!1446, !1447}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1444, file: !1355, line: 163, baseType: !1347, size: 16)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !1444, file: !1355, line: 164, baseType: !1381, size: 640, offset: 64)
!1448 = !{!1449}
!1449 = !DISubrange(count: 7)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !1430, file: !6, line: 1070, baseType: !963, size: 192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !1425, file: !6, line: 1072, baseType: !945, size: 32, offset: 1472)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !1425, file: !6, line: 1073, baseType: !945, size: 32, offset: 1504)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !1425, file: !6, line: 1074, baseType: !1454, size: 64, offset: 1536)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !1425, file: !6, line: 1076, baseType: !1456, size: 16, offset: 1600)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !230, line: 1689, baseType: !1457)
!1457 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !1425, file: !6, line: 1077, baseType: !1030, size: 64, offset: 1664)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !1331, file: !6, line: 2593, baseType: !945, size: 32, offset: 6528)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !1331, file: !6, line: 2594, baseType: !1423, size: 64, offset: 6592)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !1331, file: !6, line: 2595, baseType: !1423, size: 64, offset: 6656)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !1331, file: !6, line: 2596, baseType: !945, size: 32, offset: 6720)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !1331, file: !6, line: 2597, baseType: !1030, size: 64, offset: 6784)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !1331, file: !6, line: 2598, baseType: !1465, size: 16, offset: 6848)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !230, line: 325, baseType: !1457)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !1331, file: !6, line: 2603, baseType: !963, size: 192, offset: 6912)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !1331, file: !6, line: 2604, baseType: !1468, size: 2048, offset: 7104)
!1468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 2048, elements: !1469)
!1469 = !{!1470}
!1470 = !DISubrange(count: 256)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !1331, file: !6, line: 2605, baseType: !947, size: 64, offset: 9152)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !1331, file: !6, line: 2606, baseType: !947, size: 64, offset: 9216)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !1331, file: !6, line: 2607, baseType: !1353, size: 64, offset: 9280)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !1331, file: !6, line: 2608, baseType: !947, size: 64, offset: 9344)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !1331, file: !6, line: 2609, baseType: !947, size: 64, offset: 9408)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !1331, file: !6, line: 2610, baseType: !947, size: 64, offset: 9472)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !1331, file: !6, line: 2611, baseType: !945, size: 32, offset: 9536)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !1331, file: !6, line: 2616, baseType: !1479, size: 256, offset: 9568)
!1479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 256, elements: !1480)
!1480 = !{!1481}
!1481 = !DISubrange(count: 32)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !1331, file: !6, line: 2617, baseType: !947, size: 64, offset: 9856)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !1322, file: !6, line: 3378, baseType: !945, size: 32, offset: 320)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !1322, file: !6, line: 3381, baseType: !1485, size: 64, offset: 384)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64)
!1486 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !6, line: 61, baseType: !1487)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !6, line: 3231, size: 512, elements: !1488)
!1488 = !{!1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !1487, file: !6, line: 3233, baseType: !938, size: 8)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !1487, file: !6, line: 3234, baseType: !945, size: 32, offset: 32)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !1487, file: !6, line: 3235, baseType: !945, size: 32, offset: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !1487, file: !6, line: 3236, baseType: !945, size: 32, offset: 96)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !1487, file: !6, line: 3237, baseType: !945, size: 32, offset: 128)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !1487, file: !6, line: 3238, baseType: !1485, size: 64, offset: 192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !1487, file: !6, line: 3239, baseType: !1485, size: 64, offset: 256)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !1487, file: !6, line: 3241, baseType: !1485, size: 64, offset: 320)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !1487, file: !6, line: 3244, baseType: !1485, size: 64, offset: 384)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !1487, file: !6, line: 3245, baseType: !1320, size: 64, offset: 448)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !1322, file: !6, line: 3383, baseType: !1500, size: 128, offset: 448)
!1500 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !6, line: 31, baseType: !1501)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 26, size: 128, elements: !1502)
!1502 = !{!1503, !1504, !1505}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !1501, file: !6, line: 28, baseType: !1030, size: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1501, file: !6, line: 29, baseType: !1257, size: 32, offset: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !1501, file: !6, line: 30, baseType: !1257, size: 32, offset: 96)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !1322, file: !6, line: 3385, baseType: !1257, size: 32, offset: 576)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !1322, file: !6, line: 3389, baseType: !945, size: 32, offset: 608)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !1322, file: !6, line: 3394, baseType: !1030, size: 64, offset: 640)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !1322, file: !6, line: 3400, baseType: !938, size: 8, offset: 704)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !1322, file: !6, line: 3401, baseType: !1030, size: 64, offset: 768)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !1322, file: !6, line: 3402, baseType: !1257, size: 32, offset: 832)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !1322, file: !6, line: 3403, baseType: !1257, size: 32, offset: 864)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !1322, file: !6, line: 3404, baseType: !1030, size: 64, offset: 896)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !1322, file: !6, line: 3405, baseType: !1257, size: 32, offset: 960)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !1322, file: !6, line: 3406, baseType: !1257, size: 32, offset: 992)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !1322, file: !6, line: 3408, baseType: !1517, size: 352, offset: 1024)
!1517 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !6, line: 3358, baseType: !1518)
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3343, size: 352, elements: !1519)
!1519 = !{!1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !1518, file: !6, line: 3345, baseType: !945, size: 32)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1518, file: !6, line: 3346, baseType: !945, size: 32, offset: 32)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !1518, file: !6, line: 3347, baseType: !945, size: 32, offset: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !1518, file: !6, line: 3348, baseType: !945, size: 32, offset: 96)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1518, file: !6, line: 3349, baseType: !945, size: 32, offset: 128)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !1518, file: !6, line: 3350, baseType: !945, size: 32, offset: 160)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !1518, file: !6, line: 3351, baseType: !945, size: 32, offset: 192)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !1518, file: !6, line: 3352, baseType: !945, size: 32, offset: 224)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !1518, file: !6, line: 3353, baseType: !945, size: 32, offset: 256)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !1518, file: !6, line: 3354, baseType: !945, size: 32, offset: 288)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !1518, file: !6, line: 3356, baseType: !945, size: 32, offset: 320)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !1322, file: !6, line: 3414, baseType: !1030, size: 64, offset: 1408)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !1322, file: !6, line: 3416, baseType: !938, size: 8, offset: 1472)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !1322, file: !6, line: 3419, baseType: !1030, size: 64, offset: 1536)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !1322, file: !6, line: 3423, baseType: !945, size: 32, offset: 1600)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !1322, file: !6, line: 3424, baseType: !945, size: 32, offset: 1632)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !1322, file: !6, line: 3425, baseType: !945, size: 32, offset: 1664)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !1322, file: !6, line: 3427, baseType: !945, size: 32, offset: 1696)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !1322, file: !6, line: 3429, baseType: !1257, size: 32, offset: 1728)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !1322, file: !6, line: 3432, baseType: !1257, size: 32, offset: 1760)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !1322, file: !6, line: 3435, baseType: !945, size: 32, offset: 1792)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !1322, file: !6, line: 3437, baseType: !945, size: 32, offset: 1824)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !1322, file: !6, line: 3445, baseType: !945, size: 32, offset: 1856)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !1322, file: !6, line: 3446, baseType: !945, size: 32, offset: 1888)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !1322, file: !6, line: 3449, baseType: !945, size: 32, offset: 1920)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !1322, file: !6, line: 3450, baseType: !945, size: 32, offset: 1952)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !1322, file: !6, line: 3451, baseType: !945, size: 32, offset: 1984)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !1322, file: !6, line: 3452, baseType: !945, size: 32, offset: 2016)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !1322, file: !6, line: 3454, baseType: !1549, size: 320, offset: 2048)
!1549 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !6, line: 3330, baseType: !1550)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3324, size: 320, elements: !1551)
!1551 = !{!1552, !1553, !1554, !1555}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !1550, file: !6, line: 3326, baseType: !945, size: 32)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !1550, file: !6, line: 3327, baseType: !945, size: 32, offset: 32)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !1550, file: !6, line: 3328, baseType: !1500, size: 128, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !1550, file: !6, line: 3329, baseType: !1500, size: 128, offset: 192)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !1322, file: !6, line: 3457, baseType: !945, size: 32, offset: 2368)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !1322, file: !6, line: 3458, baseType: !945, size: 32, offset: 2400)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !1322, file: !6, line: 3459, baseType: !947, size: 64, offset: 2432)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !1322, file: !6, line: 3460, baseType: !1560, size: 32, offset: 2496)
!1560 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !6, line: 2524, baseType: !36)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !1322, file: !6, line: 3461, baseType: !945, size: 32, offset: 2528)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !1322, file: !6, line: 3462, baseType: !945, size: 32, offset: 2560)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !1322, file: !6, line: 3463, baseType: !1320, size: 64, offset: 2624)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !1322, file: !6, line: 3464, baseType: !945, size: 32, offset: 2688)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !1322, file: !6, line: 3465, baseType: !945, size: 32, offset: 2720)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !1322, file: !6, line: 3466, baseType: !945, size: 32, offset: 2752)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !1322, file: !6, line: 3467, baseType: !945, size: 32, offset: 2784)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !1322, file: !6, line: 3468, baseType: !945, size: 32, offset: 2816)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !1322, file: !6, line: 3469, baseType: !945, size: 32, offset: 2848)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !1322, file: !6, line: 3470, baseType: !945, size: 32, offset: 2880)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !1322, file: !6, line: 3471, baseType: !945, size: 32, offset: 2912)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !1322, file: !6, line: 3472, baseType: !945, size: 32, offset: 2944)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !1322, file: !6, line: 3473, baseType: !945, size: 32, offset: 2976)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !1322, file: !6, line: 3474, baseType: !945, size: 32, offset: 3008)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !1322, file: !6, line: 3475, baseType: !945, size: 32, offset: 3040)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !1322, file: !6, line: 3476, baseType: !947, size: 64, offset: 3072)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !1322, file: !6, line: 3477, baseType: !947, size: 64, offset: 3136)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !1322, file: !6, line: 3478, baseType: !1579, size: 128, offset: 3200)
!1579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 128, elements: !1580)
!1580 = !{!1581}
!1581 = !DISubrange(count: 4)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_border", scope: !1322, file: !6, line: 3479, baseType: !1579, size: 128, offset: 3328)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_highlight", scope: !1322, file: !6, line: 3480, baseType: !1584, size: 256, offset: 3456)
!1584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 256, elements: !1580)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "w_border_char", scope: !1322, file: !6, line: 3481, baseType: !1586, size: 256, offset: 3712)
!1586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 256, elements: !1239)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_leftoff", scope: !1322, file: !6, line: 3483, baseType: !945, size: 32, offset: 3968)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_rightoff", scope: !1322, file: !6, line: 3484, baseType: !945, size: 32, offset: 4000)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_changedtick", scope: !1322, file: !6, line: 3485, baseType: !1060, size: 64, offset: 4032)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_changedtick", scope: !1322, file: !6, line: 3487, baseType: !1060, size: 64, offset: 4096)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_topline", scope: !1322, file: !6, line: 3490, baseType: !945, size: 32, offset: 4160)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_last_curline", scope: !1322, file: !6, line: 3493, baseType: !1030, size: 64, offset: 4224)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "w_close_cb", scope: !1322, file: !6, line: 3495, baseType: !1166, size: 192, offset: 4288)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_cb", scope: !1322, file: !6, line: 3496, baseType: !1166, size: 192, offset: 4480)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_errors", scope: !1322, file: !6, line: 3497, baseType: !945, size: 32, offset: 4672)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "w_filter_mode", scope: !1322, file: !6, line: 3498, baseType: !945, size: 32, offset: 4704)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_curwin", scope: !1322, file: !6, line: 3500, baseType: !1320, size: 64, offset: 4736)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_lnum", scope: !1322, file: !6, line: 3501, baseType: !1030, size: 64, offset: 4800)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mincol", scope: !1322, file: !6, line: 3502, baseType: !1257, size: 32, offset: 4864)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_maxcol", scope: !1322, file: !6, line: 3503, baseType: !1257, size: 32, offset: 4896)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_row", scope: !1322, file: !6, line: 3504, baseType: !945, size: 32, offset: 4928)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_mincol", scope: !1322, file: !6, line: 3505, baseType: !945, size: 32, offset: 4960)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mouse_maxcol", scope: !1322, file: !6, line: 3506, baseType: !945, size: 32, offset: 4992)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_close", scope: !1322, file: !6, line: 3507, baseType: !1605, size: 32, offset: 5024)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "popclose_T", file: !6, line: 2530, baseType: !44)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask", scope: !1322, file: !6, line: 3509, baseType: !1067, size: 64, offset: 5056)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_cells", scope: !1322, file: !6, line: 3510, baseType: !947, size: 64, offset: 5120)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_height", scope: !1322, file: !6, line: 3511, baseType: !945, size: 32, offset: 5184)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_mask_width", scope: !1322, file: !6, line: 3512, baseType: !945, size: 32, offset: 5216)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_timer", scope: !1322, file: !6, line: 3514, baseType: !1611, size: 64, offset: 5248)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64)
!1612 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_T", file: !6, line: 2478, baseType: !1613)
!1613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_S", file: !6, line: 2479, size: 704, elements: !1614)
!1614 = !{!1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "tr_id", scope: !1613, file: !6, line: 2481, baseType: !1008, size: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "tr_next", scope: !1613, file: !6, line: 2483, baseType: !1611, size: 64, offset: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "tr_prev", scope: !1613, file: !6, line: 2484, baseType: !1611, size: 64, offset: 128)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "tr_due", scope: !1613, file: !6, line: 2485, baseType: !1001, size: 128, offset: 192)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "tr_firing", scope: !1613, file: !6, line: 2486, baseType: !938, size: 8, offset: 320)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "tr_paused", scope: !1613, file: !6, line: 2487, baseType: !938, size: 8, offset: 328)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "tr_repeat", scope: !1613, file: !6, line: 2488, baseType: !945, size: 32, offset: 352)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "tr_interval", scope: !1613, file: !6, line: 2489, baseType: !1008, size: 64, offset: 384)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "tr_callback", scope: !1613, file: !6, line: 2490, baseType: !1166, size: 192, offset: 448)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "tr_emsg_count", scope: !1613, file: !6, line: 2491, baseType: !945, size: 32, offset: 640)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "w_flags", scope: !1322, file: !6, line: 3517, baseType: !945, size: 32, offset: 5312)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid", scope: !1322, file: !6, line: 3534, baseType: !945, size: 32, offset: 5344)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_cursor", scope: !1322, file: !6, line: 3535, baseType: !1500, size: 128, offset: 5376)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "w_valid_leftcol", scope: !1322, file: !6, line: 3537, baseType: !1257, size: 32, offset: 5504)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_height", scope: !1322, file: !6, line: 3543, baseType: !945, size: 32, offset: 5536)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_folded", scope: !1322, file: !6, line: 3545, baseType: !945, size: 32, offset: 5568)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "w_cline_row", scope: !1322, file: !6, line: 3548, baseType: !945, size: 32, offset: 5600)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "w_virtcol", scope: !1322, file: !6, line: 3550, baseType: !1257, size: 32, offset: 5632)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "w_wrow", scope: !1322, file: !6, line: 3562, baseType: !945, size: 32, offset: 5664)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "w_wcol", scope: !1322, file: !6, line: 3562, baseType: !945, size: 32, offset: 5696)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines_valid", scope: !1322, file: !6, line: 3574, baseType: !945, size: 32, offset: 5728)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "w_lines", scope: !1322, file: !6, line: 3575, baseType: !1637, size: 64, offset: 5760)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64)
!1638 = !DIDerivedType(tag: DW_TAG_typedef, name: "wline_T", file: !6, line: 3225, baseType: !1639)
!1639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w_line", file: !6, line: 3216, size: 192, elements: !1640)
!1640 = !{!1641, !1642, !1643, !1644, !1645}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lnum", scope: !1639, file: !6, line: 3218, baseType: !1030, size: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "wl_size", scope: !1639, file: !6, line: 3219, baseType: !1465, size: 16, offset: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "wl_valid", scope: !1639, file: !6, line: 3220, baseType: !938, size: 8, offset: 80)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "wl_folded", scope: !1639, file: !6, line: 3222, baseType: !938, size: 8, offset: 88)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "wl_lastlnum", scope: !1639, file: !6, line: 3223, baseType: !1030, size: 64, offset: 128)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "w_folds", scope: !1322, file: !6, line: 3578, baseType: !963, size: 192, offset: 5824)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "w_fold_manual", scope: !1322, file: !6, line: 3579, baseType: !938, size: 8, offset: 6016)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "w_foldinvalid", scope: !1322, file: !6, line: 3581, baseType: !938, size: 8, offset: 6024)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "w_nrwidth", scope: !1322, file: !6, line: 3585, baseType: !945, size: 32, offset: 6048)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_type", scope: !1322, file: !6, line: 3593, baseType: !945, size: 32, offset: 6080)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "w_upd_rows", scope: !1322, file: !6, line: 3594, baseType: !945, size: 32, offset: 6112)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_top", scope: !1322, file: !6, line: 3596, baseType: !1030, size: 64, offset: 6144)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "w_redraw_bot", scope: !1322, file: !6, line: 3597, baseType: !1030, size: 64, offset: 6208)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "w_redr_status", scope: !1322, file: !6, line: 3598, baseType: !945, size: 32, offset: 6272)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_cursor", scope: !1322, file: !6, line: 3602, baseType: !1500, size: 128, offset: 6336)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_virtcol", scope: !1322, file: !6, line: 3603, baseType: !1257, size: 32, offset: 6464)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topline", scope: !1322, file: !6, line: 3604, baseType: !1030, size: 64, offset: 6528)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_line_count", scope: !1322, file: !6, line: 3605, baseType: !1030, size: 64, offset: 6592)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_topfill", scope: !1322, file: !6, line: 3607, baseType: !945, size: 32, offset: 6656)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "w_ru_empty", scope: !1322, file: !6, line: 3609, baseType: !938, size: 8, offset: 6688)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "w_alt_fnum", scope: !1322, file: !6, line: 3612, baseType: !945, size: 32, offset: 6720)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "w_alist", scope: !1322, file: !6, line: 3614, baseType: !1663, size: 64, offset: 6784)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64)
!1664 = !DIDerivedType(tag: DW_TAG_typedef, name: "alist_T", file: !6, line: 863, baseType: !1665)
!1665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arglist", file: !6, line: 858, size: 256, elements: !1666)
!1666 = !{!1667, !1668, !1669}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "al_ga", scope: !1665, file: !6, line: 860, baseType: !963, size: 192)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "al_refcount", scope: !1665, file: !6, line: 861, baseType: !945, size: 32, offset: 192)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1665, file: !6, line: 862, baseType: !945, size: 32, offset: 224)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx", scope: !1322, file: !6, line: 3615, baseType: !945, size: 32, offset: 6848)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "w_arg_idx_invalid", scope: !1322, file: !6, line: 3617, baseType: !945, size: 32, offset: 6880)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "w_localdir", scope: !1322, file: !6, line: 3619, baseType: !947, size: 64, offset: 6912)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "w_prevdir", scope: !1322, file: !6, line: 3621, baseType: !947, size: 64, offset: 6976)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "w_winbar", scope: !1322, file: !6, line: 3623, baseType: !1675, size: 64, offset: 7040)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64)
!1676 = !DIDerivedType(tag: DW_TAG_typedef, name: "vimmenu_T", file: !6, line: 67, baseType: !1677)
!1677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VimMenu", file: !6, line: 3889, size: 1984, elements: !1678)
!1678 = !{!1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1692, !1693, !1694, !1695, !1697, !1698, !1700, !1701, !1702, !1703, !1924, !1925, !1926}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !1677, file: !6, line: 3891, baseType: !945, size: 32)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !1677, file: !6, line: 3892, baseType: !945, size: 32, offset: 32)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1677, file: !6, line: 3893, baseType: !947, size: 64, offset: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "dname", scope: !1677, file: !6, line: 3894, baseType: !947, size: 64, offset: 128)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "en_name", scope: !1677, file: !6, line: 3896, baseType: !947, size: 64, offset: 192)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "en_dname", scope: !1677, file: !6, line: 3898, baseType: !947, size: 64, offset: 256)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic", scope: !1677, file: !6, line: 3901, baseType: !945, size: 32, offset: 320)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "actext", scope: !1677, file: !6, line: 3902, baseType: !947, size: 64, offset: 384)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !1677, file: !6, line: 3903, baseType: !945, size: 32, offset: 448)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1677, file: !6, line: 3905, baseType: !1689, size: 64, offset: 512)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{null, !1675}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "iconfile", scope: !1677, file: !6, line: 3908, baseType: !947, size: 64, offset: 576)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "iconidx", scope: !1677, file: !6, line: 3909, baseType: !945, size: 32, offset: 640)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "icon_builtin", scope: !1677, file: !6, line: 3910, baseType: !945, size: 32, offset: 672)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "strings", scope: !1677, file: !6, line: 3912, baseType: !1696, size: 512, offset: 704)
!1696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 512, elements: !1239)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "noremap", scope: !1677, file: !6, line: 3913, baseType: !1586, size: 256, offset: 1216)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !1677, file: !6, line: 3914, baseType: !1699, size: 64, offset: 1472)
!1699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 64, elements: !1239)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1677, file: !6, line: 3915, baseType: !1675, size: 64, offset: 1536)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1677, file: !6, line: 3916, baseType: !1675, size: 64, offset: 1600)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1677, file: !6, line: 3917, baseType: !1675, size: 64, offset: 1664)
