; ModuleID = 'version.c'
source_filename = "version.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!713 = !DILocalVariable(name: "sponsor", scope: !705, file: !3, line: 6858, type: !679)
!714 = !DILocalVariable(name: "p", scope: !705, file: !3, line: 6859, type: !677)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 1088, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 17)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "gui_lines", scope: !705, file: !3, line: 6884, type: !715, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "mediumVersion", scope: !2, file: !3, line: 28, type: !677, isLocal: true, isDefinition: true)
!722 = !{i32 2, !"Dwarf Version", i32 4}
!723 = !{i32 2, !"Debug Info Version", i32 3}
!724 = !{i32 1, !"wchar_size", i32 4}
!725 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!726 = distinct !DISubprogram(name: "init_longVersion", scope: !3, file: !3, line: 55, type: !727, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !729)
!727 = !DISubroutineType(types: !728)
!728 = !{null}
!729 = !{!730, !733, !734}
!730 = !DILocalVariable(name: "date_time", scope: !731, file: !3, line: 62, type: !677)
!731 = distinct !DILexicalBlock(scope: !732, file: !3, line: 58, column: 5)
!732 = distinct !DILexicalBlock(scope: !726, file: !3, line: 57, column: 9)
!733 = !DILocalVariable(name: "msg", scope: !731, file: !3, line: 64, type: !677)
!734 = !DILocalVariable(name: "len", scope: !731, file: !3, line: 65, type: !735)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !736, line: 62, baseType: !737)
!736 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!737 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!738 = !DILocation(line: 57, column: 9, scope: !732)
!739 = !{!740, !740, i64 0}
!740 = !{!"any pointer", !741, i64 0}
!741 = !{!"omnipotent char", !742, i64 0}
!742 = !{!"Simple C/C++ TBAA"}
!743 = !DILocation(line: 57, column: 21, scope: !732)
!744 = !DILocation(line: 57, column: 9, scope: !726)
!745 = !DILocation(line: 64, column: 14, scope: !731)
!746 = !DILocation(line: 64, column: 8, scope: !731)
!747 = !DILocation(line: 65, column: 15, scope: !731)
!748 = !DILocation(line: 68, column: 7, scope: !731)
!749 = !DILocation(line: 65, column: 9, scope: !731)
!750 = !DILocation(line: 70, column: 16, scope: !731)
!751 = !DILocation(line: 70, column: 14, scope: !731)
!752 = !DILocation(line: 71, column: 18, scope: !753)
!753 = distinct !DILexicalBlock(scope: !731, file: !3, line: 71, column: 6)
!754 = !DILocation(line: 71, column: 6, scope: !731)
!755 = !DILocation(line: 72, column: 18, scope: !753)
!756 = !DILocation(line: 72, column: 6, scope: !753)
!757 = !DILocation(line: 74, column: 6, scope: !753)
!758 = !DILocation(line: 77, column: 1, scope: !726)
!759 = distinct !DISubprogram(name: "highest_patch", scope: !3, file: !3, line: 6375, type: !760, isLocal: false, isDefinition: true, scopeLine: 6376, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !762)
!760 = !DISubroutineType(types: !761)
!761 = !{!679}
!762 = !{}
!763 = !DILocation(line: 6378, column: 5, scope: !759)
!764 = distinct !DISubprogram(name: "has_patch", scope: !3, file: !3, line: 6386, type: !765, isLocal: false, isDefinition: true, scopeLine: 6387, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{!679, !679}
!767 = !{!768, !769, !770, !771}
!768 = !DILocalVariable(name: "n", arg: 1, scope: !764, file: !3, line: 6386, type: !679)
!769 = !DILocalVariable(name: "h", scope: !764, file: !3, line: 6388, type: !679)
!770 = !DILocalVariable(name: "m", scope: !764, file: !3, line: 6388, type: !679)
!771 = !DILocalVariable(name: "l", scope: !764, file: !3, line: 6388, type: !679)
!772 = !DILocation(line: 6386, column: 15, scope: !764)
!773 = !DILocation(line: 6388, column: 16, scope: !764)
!774 = !DILocation(line: 6388, column: 10, scope: !764)
!775 = !DILocation(line: 6393, column: 5, scope: !764)
!776 = !DILocation(line: 6395, column: 9, scope: !777)
!777 = distinct !DILexicalBlock(scope: !764, file: !3, line: 6394, column: 5)
!778 = !DILocation(line: 6395, column: 14, scope: !777)
!779 = !DILocation(line: 6388, column: 13, scope: !764)
!780 = !DILocation(line: 6396, column: 6, scope: !781)
!781 = distinct !DILexicalBlock(scope: !777, file: !3, line: 6396, column: 6)
!782 = !{!783, !783, i64 0}
!783 = !{!"int", !741, i64 0}
!784 = !DILocation(line: 6396, column: 26, scope: !781)
!785 = !DILocation(line: 6396, column: 6, scope: !777)
!786 = !DILocation(line: 6398, column: 26, scope: !787)
!787 = distinct !DILexicalBlock(scope: !777, file: !3, line: 6398, column: 6)
!788 = !DILocation(line: 6401, column: 12, scope: !787)
!789 = !DILocation(line: 6398, column: 6, scope: !777)
!790 = !DILocation(line: 6393, column: 14, scope: !764)
!791 = distinct !{!791, !775, !792}
!792 = !DILocation(line: 6402, column: 5, scope: !764)
!793 = !DILocation(line: 6404, column: 1, scope: !764)
!794 = distinct !DISubprogram(name: "ex_version", scope: !3, file: !3, line: 6408, type: !795, isLocal: false, isDefinition: true, scopeLine: 6409, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !870)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !797}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "exarg_T", file: !6, line: 85, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exarg", file: !6, line: 1861, size: 1472, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !808, !809, !810, !811, !812, !813, !814, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !835, !836}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !799, file: !6, line: 1863, baseType: !681, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "nextcmd", scope: !799, file: !6, line: 1864, baseType: !681, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !799, file: !6, line: 1865, baseType: !681, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cmdlinep", scope: !799, file: !6, line: 1866, baseType: !680, size: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_tofree", scope: !799, file: !6, line: 1868, baseType: !681, size: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "cmdidx", scope: !799, file: !6, line: 1870, baseType: !807, size: 32, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmdidx_T", file: !6, line: 1856, baseType: !5)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "argt", scope: !799, file: !6, line: 1871, baseType: !684, size: 64, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !799, file: !6, line: 1872, baseType: !679, size: 32, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "forceit", scope: !799, file: !6, line: 1873, baseType: !679, size: 32, offset: 480)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "addr_count", scope: !799, file: !6, line: 1874, baseType: !679, size: 32, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "line1", scope: !799, file: !6, line: 1875, baseType: !685, size: 64, offset: 576)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "line2", scope: !799, file: !6, line: 1876, baseType: !685, size: 64, offset: 640)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "addr_type", scope: !799, file: !6, line: 1877, baseType: !815, size: 32, offset: 704)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmd_addr_T", file: !6, line: 81, baseType: !587)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !799, file: !6, line: 1878, baseType: !679, size: 32, offset: 736)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "do_ecmd_cmd", scope: !799, file: !6, line: 1879, baseType: !681, size: 64, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "do_ecmd_lnum", scope: !799, file: !6, line: 1880, baseType: !685, size: 64, offset: 832)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "append", scope: !799, file: !6, line: 1881, baseType: !679, size: 32, offset: 896)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "usefilter", scope: !799, file: !6, line: 1882, baseType: !679, size: 32, offset: 928)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "amount", scope: !799, file: !6, line: 1883, baseType: !679, size: 32, offset: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "regname", scope: !799, file: !6, line: 1884, baseType: !679, size: 32, offset: 992)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "force_bin", scope: !799, file: !6, line: 1885, baseType: !679, size: 32, offset: 1024)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "read_edit", scope: !799, file: !6, line: 1886, baseType: !679, size: 32, offset: 1056)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "force_ff", scope: !799, file: !6, line: 1887, baseType: !679, size: 32, offset: 1088)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "force_enc", scope: !799, file: !6, line: 1888, baseType: !679, size: 32, offset: 1120)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bad_char", scope: !799, file: !6, line: 1889, baseType: !679, size: 32, offset: 1152)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "useridx", scope: !799, file: !6, line: 1890, baseType: !679, size: 32, offset: 1184)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "errmsg", scope: !799, file: !6, line: 1891, baseType: !677, size: 64, offset: 1216)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "getline", scope: !799, file: !6, line: 1892, baseType: !831, size: 64, offset: 1280)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!681, !679, !676, !679, !834}
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "getline_opt_T", file: !602, line: 1577, baseType: !601)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !799, file: !6, line: 1893, baseType: !676, size: 64, offset: 1344)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cstack", scope: !799, file: !6, line: 1895, baseType: !837, size: 64, offset: 1408)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "cstack_T", file: !602, line: 921, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 904, size: 12672, elements: !840)
!840 = !{!841, !846, !848, !854, !855, !857, !858, !859, !860, !861, !862, !869}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "cs_flags", scope: !839, file: !602, line: 905, baseType: !842, size: 800)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 800, elements: !844)
!843 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!844 = !{!845}
!845 = !DISubrange(count: 50)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "cs_pending", scope: !839, file: !602, line: 906, baseType: !847, size: 400, offset: 800)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 400, elements: !844)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "cs_pend", scope: !839, file: !602, line: 910, baseType: !849, size: 3200, offset: 1216)
!849 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !839, file: !602, line: 907, size: 3200, elements: !850)
!850 = !{!851, !853}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "csp_rv", scope: !849, file: !602, line: 908, baseType: !852, size: 3200)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 3200, elements: !844)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "csp_ex", scope: !849, file: !602, line: 909, baseType: !852, size: 3200)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "cs_forinfo", scope: !839, file: !602, line: 911, baseType: !852, size: 3200, offset: 4416)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "cs_line", scope: !839, file: !602, line: 912, baseType: !856, size: 1600, offset: 7616)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 1600, elements: !844)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "cs_block_id", scope: !839, file: !602, line: 913, baseType: !856, size: 1600, offset: 9216)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cs_script_var_len", scope: !839, file: !602, line: 914, baseType: !856, size: 1600, offset: 10816)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "cs_idx", scope: !839, file: !602, line: 916, baseType: !679, size: 32, offset: 12416)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "cs_looplevel", scope: !839, file: !602, line: 917, baseType: !679, size: 32, offset: 12448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "cs_trylevel", scope: !839, file: !602, line: 918, baseType: !679, size: 32, offset: 12480)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "cs_emsg_silent_list", scope: !839, file: !602, line: 919, baseType: !863, size: 64, offset: 12544)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "eslist_T", file: !602, line: 891, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eslist_elem", file: !602, line: 892, size: 128, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "saved_emsg_silent", scope: !865, file: !602, line: 894, baseType: !679, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !865, file: !602, line: 895, baseType: !863, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "cs_lflags", scope: !839, file: !602, line: 920, baseType: !678, size: 8, offset: 12608)
!870 = !{!871}
!871 = !DILocalVariable(name: "eap", arg: 1, scope: !794, file: !3, line: 6408, type: !797)
!872 = !DILocation(line: 6408, column: 21, scope: !794)
!873 = !DILocation(line: 6413, column: 15, scope: !874)
!874 = distinct !DILexicalBlock(scope: !794, file: !3, line: 6413, column: 9)
!875 = !{!876, !740, i64 0}
!876 = !{!"exarg", !740, i64 0, !740, i64 8, !740, i64 16, !740, i64 24, !740, i64 32, !741, i64 40, !877, i64 48, !783, i64 56, !783, i64 60, !783, i64 64, !877, i64 72, !877, i64 80, !741, i64 88, !783, i64 92, !740, i64 96, !877, i64 104, !783, i64 112, !783, i64 116, !783, i64 120, !783, i64 124, !783, i64 128, !783, i64 132, !783, i64 136, !783, i64 140, !783, i64 144, !783, i64 148, !740, i64 152, !740, i64 160, !740, i64 168, !740, i64 176}
!877 = !{!"long", !741, i64 0}
!878 = !DILocation(line: 6413, column: 9, scope: !874)
!879 = !{!741, !741, i64 0}
!880 = !DILocation(line: 6413, column: 19, scope: !874)
!881 = !DILocation(line: 6413, column: 9, scope: !794)
!882 = !DILocation(line: 6415, column: 2, scope: !883)
!883 = distinct !DILexicalBlock(scope: !874, file: !3, line: 6414, column: 5)
!884 = !DILocation(line: 6416, column: 2, scope: !883)
!885 = !DILocation(line: 6417, column: 5, scope: !883)
!886 = !DILocation(line: 6418, column: 1, scope: !794)
!887 = distinct !DISubprogram(name: "list_version", scope: !3, file: !3, line: 6550, type: !727, isLocal: false, isDefinition: true, scopeLine: 6551, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !888)
!888 = !{!889, !890, !891}
!889 = !DILocalVariable(name: "i", scope: !887, file: !3, line: 6552, type: !679)
!890 = !DILocalVariable(name: "first", scope: !887, file: !3, line: 6553, type: !679)
!891 = !DILocalVariable(name: "s", scope: !887, file: !3, line: 6554, type: !677)
!892 = !DILocation(line: 6554, column: 11, scope: !887)
!893 = !DILocation(line: 57, column: 9, scope: !732, inlinedAt: !894)
!894 = distinct !DILocation(line: 6560, column: 5, scope: !887)
!895 = !DILocation(line: 57, column: 21, scope: !732, inlinedAt: !894)
!896 = !DILocation(line: 57, column: 9, scope: !726, inlinedAt: !894)
!897 = !DILocation(line: 64, column: 14, scope: !731, inlinedAt: !894)
!898 = !DILocation(line: 64, column: 8, scope: !731, inlinedAt: !894)
!899 = !DILocation(line: 65, column: 15, scope: !731, inlinedAt: !894)
!900 = !DILocation(line: 68, column: 7, scope: !731, inlinedAt: !894)
!901 = !DILocation(line: 65, column: 9, scope: !731, inlinedAt: !894)
!902 = !DILocation(line: 70, column: 16, scope: !731, inlinedAt: !894)
!903 = !DILocation(line: 70, column: 14, scope: !731, inlinedAt: !894)
!904 = !DILocation(line: 71, column: 18, scope: !753, inlinedAt: !894)
!905 = !DILocation(line: 71, column: 6, scope: !731, inlinedAt: !894)
!906 = !DILocation(line: 72, column: 18, scope: !753, inlinedAt: !894)
!907 = !DILocation(line: 72, column: 6, scope: !753, inlinedAt: !894)
!908 = !DILocation(line: 74, column: 6, scope: !753, inlinedAt: !894)
!909 = !DILocation(line: 6561, column: 9, scope: !887)
!910 = !DILocation(line: 6561, column: 5, scope: !887)
!911 = !DILocation(line: 6617, column: 11, scope: !912)
!912 = distinct !DILexicalBlock(scope: !913, file: !3, line: 6616, column: 5)
!913 = distinct !DILexicalBlock(scope: !887, file: !3, line: 6615, column: 9)
!914 = !DILocation(line: 6617, column: 2, scope: !912)
!915 = !DILocation(line: 6553, column: 10, scope: !887)
!916 = !DILocation(line: 6552, column: 10, scope: !887)
!917 = !DILocation(line: 6620, column: 2, scope: !912)
!918 = !DILocation(line: 6622, column: 16, scope: !919)
!919 = distinct !DILexicalBlock(scope: !920, file: !3, line: 6622, column: 10)
!920 = distinct !DILexicalBlock(scope: !912, file: !3, line: 6621, column: 2)
!921 = !DILocation(line: 6622, column: 10, scope: !920)
!922 = !DILocation(line: 6623, column: 11, scope: !919)
