; ModuleID = 'viminfo.c'
source_filename = "viminfo.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!668 = !DIEnumerator(name: "CMD_USER", value: -1)
!669 = !DIEnumerator(name: "CMD_USER_BUF", value: -2)
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 68, size: 32, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683}
!672 = !DIEnumerator(name: "ADDR_LINES", value: 0)
!673 = !DIEnumerator(name: "ADDR_WINDOWS", value: 1)
!674 = !DIEnumerator(name: "ADDR_ARGUMENTS", value: 2)
!675 = !DIEnumerator(name: "ADDR_LOADED_BUFFERS", value: 3)
!676 = !DIEnumerator(name: "ADDR_BUFFERS", value: 4)
!677 = !DIEnumerator(name: "ADDR_TABS", value: 5)
!678 = !DIEnumerator(name: "ADDR_TABS_RELATIVE", value: 6)
!679 = !DIEnumerator(name: "ADDR_QUICKFIX_VALID", value: 7)
!680 = !DIEnumerator(name: "ADDR_QUICKFIX", value: 8)
!681 = !DIEnumerator(name: "ADDR_UNSIGNED", value: 9)
!682 = !DIEnumerator(name: "ADDR_OTHER", value: 10)
!683 = !DIEnumerator(name: "ADDR_NONE", value: 11)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1572, size: 32, elements: !685)
!685 = !{!686, !687, !688, !689}
!686 = !DIEnumerator(name: "GETLINE_NONE", value: 0)
!687 = !DIEnumerator(name: "GETLINE_CONCAT_CONT", value: 1)
!688 = !DIEnumerator(name: "GETLINE_CONCAT_CONTBAR", value: 2)
!689 = !DIEnumerator(name: "GETLINE_CONCAT_ALL", value: 3)
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 29, size: 32, elements: !691)
!691 = !{!692, !693, !694}
!692 = !DIEnumerator(name: "BVAL_NR", value: 0)
!693 = !DIEnumerator(name: "BVAL_STRING", value: 1)
!694 = !DIEnumerator(name: "BVAL_EMPTY", value: 2)
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !696, line: 46, size: 32, elements: !697)
!696 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/sahil/vim/src")
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!698 = !DIEnumerator(name: "_ISupper", value: 256)
!699 = !DIEnumerator(name: "_ISlower", value: 512)
!700 = !DIEnumerator(name: "_ISalpha", value: 1024)
!701 = !DIEnumerator(name: "_ISdigit", value: 2048)
!702 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!703 = !DIEnumerator(name: "_ISspace", value: 8192)
!704 = !DIEnumerator(name: "_ISprint", value: 16384)
!705 = !DIEnumerator(name: "_ISgraph", value: 32768)
!706 = !DIEnumerator(name: "_ISblank", value: 1)
!707 = !DIEnumerator(name: "_IScntrl", value: 2)
!708 = !DIEnumerator(name: "_ISpunct", value: 4)
!709 = !DIEnumerator(name: "_ISalnum", value: 8)
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 4243, size: 32, elements: !711)
!711 = !{!712, !713, !714}
!712 = !DIEnumerator(name: "VAR_FLAVOUR_DEFAULT", value: 0)
!713 = !DIEnumerator(name: "VAR_FLAVOUR_SESSION", value: 1)
!714 = !DIEnumerator(name: "VAR_FLAVOUR_VIMINFO", value: 2)
!715 = !{!716, !717, !718, !720, !739, !744, !1242, !2395, !2405, !2406, !2414, !1409, !1185, !1972, !2400, !813, !730, !2425, !732, !2426, !1971}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!717 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "buf_T", file: !6, line: 63, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_buffer", file: !6, line: 2629, size: 73152, elements: !724)
!724 = !{!725, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !844, !847, !848, !852, !853, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !2068, !2069, !2070, !2075, !2076, !2077, !2081, !2089, !2090, !2091, !2092, !2093, !2095, !2096, !2097, !2098, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2342, !2343, !2344, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2378, !2379, !2380, !2381, !2382, !2389, !2390, !2394}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "b_ml", scope: !723, file: !6, line: 2631, baseType: !726, size: 832)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "memline_T", file: !6, line: 766, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memline", file: !6, line: 737, size: 832, elements: !728)
!728 = !{!729, !733, !800, !809, !810, !811, !812, !814, !815, !816, !817, !818, !819, !820, !827, !828}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_count", scope: !727, file: !6, line: 739, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenr_T", file: !731, line: 1687, baseType: !732)
!731 = !DIFile(filename: "./vim.h", directory: "/home/sahil/vim/src")
!732 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ml_mfp", scope: !727, file: !6, line: 741, baseType: !734, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "memfile_T", file: !6, line: 459, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memfile", file: !6, line: 671, size: 9856, elements: !737)
!737 = !{!738, !742, !743, !745, !746, !747, !766, !767, !768, !769, !770, !785, !786, !787, !788, !789, !790, !791, !792, !793, !797, !798, !799}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fname", scope: !736, file: !6, line: 673, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_u", file: !731, line: 324, baseType: !741)
!741 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "mf_ffname", scope: !736, file: !6, line: 674, baseType: !739, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mf_fd", scope: !736, file: !6, line: 675, baseType: !744, size: 32, offset: 128)
!744 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "mf_flags", scope: !736, file: !6, line: 676, baseType: !744, size: 32, offset: 160)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mf_reopen", scope: !736, file: !6, line: 677, baseType: !744, size: 32, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mf_free_first", scope: !736, file: !6, line: 678, baseType: !748, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "bhdr_T", file: !6, line: 458, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_hdr", file: !6, line: 506, size: 448, elements: !751)
!751 = !{!752, !761, !762, !763, !764, !765}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "bh_hashitem", scope: !750, file: !6, line: 508, baseType: !753, size: 192)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashitem_T", file: !6, line: 469, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashitem_S", file: !6, line: 471, size: 192, elements: !755)
!755 = !{!756, !758, !759}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_next", scope: !754, file: !6, line: 473, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_prev", scope: !754, file: !6, line: 474, baseType: !757, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mhi_key", scope: !754, file: !6, line: 475, baseType: !760, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "blocknr_T", file: !6, line: 460, baseType: !732)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bh_next", scope: !750, file: !6, line: 511, baseType: !748, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bh_prev", scope: !750, file: !6, line: 512, baseType: !748, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bh_data", scope: !750, file: !6, line: 513, baseType: !739, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bh_page_count", scope: !750, file: !6, line: 514, baseType: !744, size: 32, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "bh_flags", scope: !750, file: !6, line: 518, baseType: !719, size: 8, offset: 416)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_first", scope: !736, file: !6, line: 679, baseType: !748, size: 64, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_last", scope: !736, file: !6, line: 680, baseType: !748, size: 64, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count", scope: !736, file: !6, line: 681, baseType: !717, size: 32, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mf_used_count_max", scope: !736, file: !6, line: 682, baseType: !717, size: 32, offset: 480)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mf_hash", scope: !736, file: !6, line: 683, baseType: !771, size: 4352, offset: 512)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "mf_hashtab_T", file: !6, line: 489, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mf_hashtab_S", file: !6, line: 480, size: 4352, elements: !773)
!773 = !{!774, !777, !778, !780, !784}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mht_mask", scope: !772, file: !6, line: 482, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "long_u", file: !731, line: 345, baseType: !776)
!776 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "mht_count", scope: !772, file: !6, line: 484, baseType: !775, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mht_buckets", scope: !772, file: !6, line: 485, baseType: !779, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mht_small_buckets", scope: !772, file: !6, line: 487, baseType: !781, size: 4096, offset: 192)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 4096, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mht_fixed", scope: !772, file: !6, line: 488, baseType: !719, size: 8, offset: 4288)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "mf_trans", scope: !736, file: !6, line: 684, baseType: !771, size: 4352, offset: 4864)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_max", scope: !736, file: !6, line: 685, baseType: !760, size: 64, offset: 9216)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "mf_blocknr_min", scope: !736, file: !6, line: 686, baseType: !760, size: 64, offset: 9280)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mf_neg_count", scope: !736, file: !6, line: 687, baseType: !760, size: 64, offset: 9344)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mf_infile_count", scope: !736, file: !6, line: 688, baseType: !760, size: 64, offset: 9408)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mf_page_size", scope: !736, file: !6, line: 689, baseType: !717, size: 32, offset: 9472)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mf_dirty", scope: !736, file: !6, line: 690, baseType: !744, size: 32, offset: 9504)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mf_buffer", scope: !736, file: !6, line: 692, baseType: !721, size: 64, offset: 9536)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mf_seed", scope: !736, file: !6, line: 693, baseType: !794, size: 64, offset: 9600)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 64, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 8)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_key", scope: !736, file: !6, line: 697, baseType: !739, size: 64, offset: 9664)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_cm", scope: !736, file: !6, line: 698, baseType: !744, size: 32, offset: 9728)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "mf_old_seed", scope: !736, file: !6, line: 699, baseType: !794, size: 64, offset: 9760)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack", scope: !727, file: !6, line: 743, baseType: !801, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "infoptr_T", file: !6, line: 717, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_pointer", file: !6, line: 711, size: 256, elements: !804)
!804 = !{!805, !806, !807, !808}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ip_bnum", scope: !803, file: !6, line: 713, baseType: !760, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ip_low", scope: !803, file: !6, line: 714, baseType: !730, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ip_high", scope: !803, file: !6, line: 715, baseType: !730, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ip_index", scope: !803, file: !6, line: 716, baseType: !744, size: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_top", scope: !727, file: !6, line: 744, baseType: !744, size: 32, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ml_stack_size", scope: !727, file: !6, line: 745, baseType: !744, size: 32, offset: 224)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !727, file: !6, line: 751, baseType: !744, size: 32, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_len", scope: !727, file: !6, line: 753, baseType: !813, size: 32, offset: 288)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "colnr_T", file: !731, line: 1688, baseType: !744)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_lnum", scope: !727, file: !6, line: 754, baseType: !730, size: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ml_line_ptr", scope: !727, file: !6, line: 755, baseType: !739, size: 64, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked", scope: !727, file: !6, line: 757, baseType: !748, size: 64, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_low", scope: !727, file: !6, line: 758, baseType: !730, size: 64, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_high", scope: !727, file: !6, line: 759, baseType: !730, size: 64, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ml_locked_lineadd", scope: !727, file: !6, line: 760, baseType: !744, size: 32, offset: 640)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ml_chunksize", scope: !727, file: !6, line: 762, baseType: !821, size: 64, offset: 704)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksize_T", file: !6, line: 724, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ml_chunksize", file: !6, line: 720, size: 128, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_numlines", scope: !823, file: !6, line: 722, baseType: !744, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "mlcs_totalsize", scope: !823, file: !6, line: 723, baseType: !732, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ml_numchunks", scope: !727, file: !6, line: 763, baseType: !744, size: 32, offset: 768)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ml_usedchunks", scope: !727, file: !6, line: 764, baseType: !744, size: 32, offset: 800)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !723, file: !6, line: 2634, baseType: !721, size: 64, offset: 832)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "b_prev", scope: !723, file: !6, line: 2635, baseType: !721, size: 64, offset: 896)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "b_nwindows", scope: !723, file: !6, line: 2637, baseType: !744, size: 32, offset: 960)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "b_flags", scope: !723, file: !6, line: 2639, baseType: !744, size: 32, offset: 992)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked", scope: !723, file: !6, line: 2640, baseType: !744, size: 32, offset: 1024)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "b_locked_split", scope: !723, file: !6, line: 2642, baseType: !744, size: 32, offset: 1056)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "b_ffname", scope: !723, file: !6, line: 2651, baseType: !739, size: 64, offset: 1088)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "b_sfname", scope: !723, file: !6, line: 2652, baseType: !739, size: 64, offset: 1152)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "b_fname", scope: !723, file: !6, line: 2654, baseType: !739, size: 64, offset: 1216)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev_valid", scope: !723, file: !6, line: 2658, baseType: !744, size: 32, offset: 1280)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "b_dev", scope: !723, file: !6, line: 2659, baseType: !840, size: 64, offset: 1344)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !841, line: 59, baseType: !842)
!841 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/sahil/vim/src")
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !843, line: 145, baseType: !776)
!843 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sahil/vim/src")
!844 = !DIDerivedType(tag: DW_TAG_member, name: "b_ino", scope: !723, file: !6, line: 2660, baseType: !845, size: 64, offset: 1408)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !841, line: 47, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !843, line: 148, baseType: !776)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "b_fnum", scope: !723, file: !6, line: 2667, baseType: !744, size: 32, offset: 1472)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "b_key", scope: !723, file: !6, line: 2668, baseType: !849, size: 72, offset: 1504)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 72, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 9)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "b_changed", scope: !723, file: !6, line: 2672, baseType: !744, size: 32, offset: 1600)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "b_ct_di", scope: !723, file: !6, line: 2674, baseType: !854, size: 320, offset: 1664)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem16_T", file: !6, line: 1532, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem16_S", file: !6, line: 1526, size: 320, elements: !856)
!856 = !{!857, !1252, !1253}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !855, file: !6, line: 1528, baseType: !858, size: 128)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "typval_T", file: !6, line: 1432, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1412, size: 128, elements: !860)
!860 = !{!861, !863, !864}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !859, file: !6, line: 1414, baseType: !862, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "vartype_T", file: !6, line: 1391, baseType: !5)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "v_lock", scope: !859, file: !6, line: 1415, baseType: !719, size: 8, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "vval", scope: !859, file: !6, line: 1431, baseType: !865, size: 64, offset: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !859, file: !6, line: 1416, size: 64, elements: !866)
!866 = !{!867, !870, !873, !874, !931, !965, !1114, !1243, !1244}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "v_number", scope: !865, file: !6, line: 1418, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "varnumber_T", file: !6, line: 1327, baseType: !869)
!869 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !865, file: !6, line: 1420, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_T", file: !6, line: 1344, baseType: !872)
!872 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !865, file: !6, line: 1422, baseType: !739, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "v_list", scope: !865, file: !6, line: 1423, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_T", file: !6, line: 1346, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listvar_S", file: !6, line: 1471, size: 768, elements: !878)
!878 = !{!879, !887, !894, !909, !923, !924, !925, !926, !927, !928, !929, !930}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "lv_first", scope: !877, file: !6, line: 1473, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "listitem_T", file: !6, line: 1446, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listitem_S", file: !6, line: 1448, size: 256, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "li_next", scope: !882, file: !6, line: 1450, baseType: !880, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "li_prev", scope: !882, file: !6, line: 1451, baseType: !880, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "li_tv", scope: !882, file: !6, line: 1452, baseType: !858, size: 128, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "lv_watch", scope: !877, file: !6, line: 1474, baseType: !888, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "listwatch_T", file: !6, line: 1456, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listwatch_S", file: !6, line: 1458, size: 128, elements: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "lw_item", scope: !890, file: !6, line: 1460, baseType: !880, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "lw_next", scope: !890, file: !6, line: 1461, baseType: !888, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lv_u", scope: !877, file: !6, line: 1487, baseType: !895, size: 192, offset: 128)
!895 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !877, file: !6, line: 1475, size: 192, elements: !896)
!896 = !{!897, !903}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "nonmat", scope: !895, file: !6, line: 1481, baseType: !898, size: 192)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !895, file: !6, line: 1476, size: 192, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lv_start", scope: !898, file: !6, line: 1478, baseType: !868, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lv_end", scope: !898, file: !6, line: 1479, baseType: !868, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lv_stride", scope: !898, file: !6, line: 1480, baseType: !744, size: 32, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !895, file: !6, line: 1486, baseType: !904, size: 192)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !895, file: !6, line: 1482, size: 192, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lv_last", scope: !904, file: !6, line: 1483, baseType: !880, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx_item", scope: !904, file: !6, line: 1484, baseType: !880, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lv_idx", scope: !904, file: !6, line: 1485, baseType: !744, size: 32, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lv_type", scope: !877, file: !6, line: 1488, baseType: !910, size: 64, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "type_T", file: !6, line: 1394, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "type_S", file: !6, line: 1395, size: 192, elements: !913)
!913 = !{!914, !915, !918, !919, !920, !921}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "tt_type", scope: !912, file: !6, line: 1396, baseType: !862, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "tt_argcount", scope: !912, file: !6, line: 1397, baseType: !916, size: 8, offset: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_T", file: !6, line: 1342, baseType: !917)
!917 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "tt_min_argcount", scope: !912, file: !6, line: 1398, baseType: !719, size: 8, offset: 40)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "tt_flags", scope: !912, file: !6, line: 1399, baseType: !719, size: 8, offset: 48)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "tt_member", scope: !912, file: !6, line: 1400, baseType: !910, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tt_args", scope: !912, file: !6, line: 1401, baseType: !922, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copylist", scope: !877, file: !6, line: 1489, baseType: !875, size: 64, offset: 384)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_next", scope: !877, file: !6, line: 1490, baseType: !875, size: 64, offset: 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lv_used_prev", scope: !877, file: !6, line: 1491, baseType: !875, size: 64, offset: 512)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "lv_refcount", scope: !877, file: !6, line: 1492, baseType: !744, size: 32, offset: 576)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "lv_len", scope: !877, file: !6, line: 1493, baseType: !744, size: 32, offset: 608)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lv_with_items", scope: !877, file: !6, line: 1494, baseType: !744, size: 32, offset: 640)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "lv_copyID", scope: !877, file: !6, line: 1496, baseType: !744, size: 32, offset: 672)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "lv_lock", scope: !877, file: !6, line: 1497, baseType: !719, size: 8, offset: 704)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "v_dict", scope: !865, file: !6, line: 1424, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_T", file: !6, line: 1347, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictvar_S", file: !6, line: 1545, size: 2816, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !961, !962, !963, !964}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "dv_lock", scope: !934, file: !6, line: 1547, baseType: !719, size: 8)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dv_scope", scope: !934, file: !6, line: 1548, baseType: !719, size: 8, offset: 8)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "dv_refcount", scope: !934, file: !6, line: 1549, baseType: !744, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copyID", scope: !934, file: !6, line: 1550, baseType: !744, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "dv_hashtab", scope: !934, file: !6, line: 1551, baseType: !941, size: 2432, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashtab_T", file: !6, line: 1290, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashtable_S", file: !6, line: 1277, size: 2432, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949, !950, !957}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ht_mask", scope: !942, file: !6, line: 1279, baseType: !775, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ht_used", scope: !942, file: !6, line: 1281, baseType: !775, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ht_filled", scope: !942, file: !6, line: 1282, baseType: !775, size: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ht_changed", scope: !942, file: !6, line: 1283, baseType: !744, size: 32, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ht_locked", scope: !942, file: !6, line: 1284, baseType: !744, size: 32, offset: 224)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ht_error", scope: !942, file: !6, line: 1285, baseType: !744, size: 32, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ht_array", scope: !942, file: !6, line: 1287, baseType: !951, size: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashitem_T", file: !6, line: 1265, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashitem_S", file: !6, line: 1261, size: 128, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "hi_hash", scope: !953, file: !6, line: 1263, baseType: !775, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "hi_key", scope: !953, file: !6, line: 1264, baseType: !739, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ht_smallarray", scope: !942, file: !6, line: 1289, baseType: !958, size: 2048, offset: 384)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 2048, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 16)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "dv_type", scope: !934, file: !6, line: 1552, baseType: !910, size: 64, offset: 2560)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "dv_copydict", scope: !934, file: !6, line: 1553, baseType: !932, size: 64, offset: 2624)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_next", scope: !934, file: !6, line: 1554, baseType: !932, size: 64, offset: 2688)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "dv_used_prev", scope: !934, file: !6, line: 1555, baseType: !932, size: 64, offset: 2752)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "v_partial", scope: !865, file: !6, line: 1425, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_T", file: !6, line: 1348, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partial_S", file: !6, line: 1994, size: 832, elements: !969)
!969 = !{!970, !971, !972, !1089, !1090, !1100, !1110, !1111, !1112, !1113}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "pt_refcount", scope: !968, file: !6, line: 1996, baseType: !744, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pt_name", scope: !968, file: !6, line: 1997, baseType: !739, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pt_func", scope: !968, file: !6, line: 1999, baseType: !973, size: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "ufunc_T", file: !6, line: 1658, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1597, size: 3072, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !983, !984, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1004, !1005, !1006, !1007, !1008, !1017, !1018, !1019, !1020, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1037, !1038, !1039, !1084, !1085}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "uf_varargs", scope: !975, file: !6, line: 1599, baseType: !744, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "uf_flags", scope: !975, file: !6, line: 1600, baseType: !744, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "uf_calls", scope: !975, file: !6, line: 1601, baseType: !744, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "uf_cleared", scope: !975, file: !6, line: 1602, baseType: !744, size: 32, offset: 96)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_status", scope: !975, file: !6, line: 1603, baseType: !982, size: 32, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_status_T", file: !6, line: 1591, baseType: !23)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "uf_dfunc_idx", scope: !975, file: !6, line: 1604, baseType: !744, size: 32, offset: 160)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "uf_args", scope: !975, file: !6, line: 1605, baseType: !985, size: 192, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "garray_T", file: !6, line: 55, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "growarray", file: !6, line: 48, size: 192, elements: !987)
!987 = !{!988, !989, !990, !991, !992}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ga_len", scope: !986, file: !6, line: 50, baseType: !744, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ga_maxlen", scope: !986, file: !6, line: 51, baseType: !744, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ga_itemsize", scope: !986, file: !6, line: 52, baseType: !744, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ga_growsize", scope: !986, file: !6, line: 53, baseType: !744, size: 32, offset: 96)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ga_data", scope: !986, file: !6, line: 54, baseType: !716, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "uf_def_args", scope: !975, file: !6, line: 1606, baseType: !985, size: 192, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "uf_arg_types", scope: !975, file: !6, line: 1609, baseType: !922, size: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "uf_ret_type", scope: !975, file: !6, line: 1610, baseType: !910, size: 64, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "uf_type_list", scope: !975, file: !6, line: 1611, baseType: !985, size: 192, offset: 704)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "uf_partial", scope: !975, file: !6, line: 1612, baseType: !966, size: 64, offset: 896)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_name", scope: !975, file: !6, line: 1615, baseType: !739, size: 64, offset: 960)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "uf_va_type", scope: !975, file: !6, line: 1616, baseType: !910, size: 64, offset: 1024)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "uf_func_type", scope: !975, file: !6, line: 1617, baseType: !910, size: 64, offset: 1088)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_depth", scope: !975, file: !6, line: 1618, baseType: !744, size: 32, offset: 1152)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "uf_block_ids", scope: !975, file: !6, line: 1619, baseType: !1003, size: 64, offset: 1216)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "uf_lines", scope: !975, file: !6, line: 1626, baseType: !985, size: 192, offset: 1280)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "uf_profiling", scope: !975, file: !6, line: 1628, baseType: !744, size: 32, offset: 1472)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "uf_prof_initialized", scope: !975, file: !6, line: 1629, baseType: !744, size: 32, offset: 1504)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_count", scope: !975, file: !6, line: 1631, baseType: !744, size: 32, offset: 1536)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_total", scope: !975, file: !6, line: 1632, baseType: !1009, size: 128, offset: 1600)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "proftime_T", file: !731, line: 1786, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1011, line: 8, size: 128, elements: !1012)
!1011 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/sahil/vim/src")
!1012 = !{!1013, !1015}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1010, file: !1011, line: 10, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !843, line: 160, baseType: !732)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1010, file: !1011, line: 11, baseType: !1016, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !843, line: 162, baseType: !732)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_self", scope: !975, file: !6, line: 1633, baseType: !1009, size: 128, offset: 1728)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tm_children", scope: !975, file: !6, line: 1634, baseType: !1009, size: 128, offset: 1856)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_count", scope: !975, file: !6, line: 1636, baseType: !1003, size: 64, offset: 1984)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_total", scope: !975, file: !6, line: 1637, baseType: !1021, size: 64, offset: 2048)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_self", scope: !975, file: !6, line: 1638, baseType: !1021, size: 64, offset: 2112)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_start", scope: !975, file: !6, line: 1639, baseType: !1009, size: 128, offset: 2176)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_children", scope: !975, file: !6, line: 1640, baseType: !1009, size: 128, offset: 2304)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_wait", scope: !975, file: !6, line: 1641, baseType: !1009, size: 128, offset: 2432)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_idx", scope: !975, file: !6, line: 1642, baseType: !744, size: 32, offset: 2560)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "uf_tml_execed", scope: !975, file: !6, line: 1643, baseType: !744, size: 32, offset: 2592)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx", scope: !975, file: !6, line: 1645, baseType: !1029, size: 192, offset: 2624)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "sctx_T", file: !6, line: 92, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 85, size: 192, elements: !1031)
!1031 = !{!1032, !1034, !1035, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sid", scope: !1030, file: !6, line: 87, baseType: !1033, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "scid_T", file: !6, line: 62, baseType: !744)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "sc_seq", scope: !1030, file: !6, line: 88, baseType: !744, size: 32, offset: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sc_lnum", scope: !1030, file: !6, line: 89, baseType: !730, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "sc_version", scope: !1030, file: !6, line: 91, baseType: !744, size: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "uf_script_ctx_version", scope: !975, file: !6, line: 1648, baseType: !744, size: 32, offset: 2816)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "uf_refcount", scope: !975, file: !6, line: 1649, baseType: !744, size: 32, offset: 2848)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "uf_scoped", scope: !975, file: !6, line: 1651, baseType: !1040, size: 64, offset: 2880)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "funccall_T", file: !6, line: 1582, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funccall_S", file: !6, line: 1682, size: 17280, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1067, !1068, !1069, !1070, !1071, !1072, !1074, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1042, file: !6, line: 1684, baseType: !973, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "linenr", scope: !1042, file: !6, line: 1685, baseType: !744, size: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "returned", scope: !1042, file: !6, line: 1686, baseType: !744, size: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fixvar", scope: !1042, file: !6, line: 1691, baseType: !1048, size: 4608, offset: 128)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 4608, elements: !1065)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1042, file: !6, line: 1687, size: 384, elements: !1050)
!1050 = !{!1051, !1061}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1049, file: !6, line: 1689, baseType: !1052, size: 192)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictitem_T", file: !6, line: 1519, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dictitem_S", file: !6, line: 1513, size: 192, elements: !1054)
!1054 = !{!1055, !1056, !1057}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "di_tv", scope: !1053, file: !6, line: 1515, baseType: !858, size: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !1053, file: !6, line: 1516, baseType: !740, size: 8, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !1053, file: !6, line: 1517, baseType: !1058, size: 8, offset: 136)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 8, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 1)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "room", scope: !1049, file: !6, line: 1690, baseType: !1062, size: 160, offset: 192)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 160, elements: !1063)
!1063 = !{!1064}
!1064 = !DISubrange(count: 20)
!1065 = !{!1066}
!1066 = !DISubrange(count: 12)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars", scope: !1042, file: !6, line: 1692, baseType: !933, size: 2816, offset: 4736)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "l_vars_var", scope: !1042, file: !6, line: 1693, baseType: !1052, size: 192, offset: 7552)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars", scope: !1042, file: !6, line: 1694, baseType: !933, size: 2816, offset: 7744)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "l_avars_var", scope: !1042, file: !6, line: 1695, baseType: !1052, size: 192, offset: 10560)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "l_varlist", scope: !1042, file: !6, line: 1696, baseType: !876, size: 768, offset: 10752)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "l_listitems", scope: !1042, file: !6, line: 1697, baseType: !1073, size: 5120, offset: 11520)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 5120, elements: !1063)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "rettv", scope: !1042, file: !6, line: 1698, baseType: !1075, size: 64, offset: 16640)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !1042, file: !6, line: 1699, baseType: !730, size: 64, offset: 16704)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "dbg_tick", scope: !1042, file: !6, line: 1700, baseType: !744, size: 32, offset: 16768)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1042, file: !6, line: 1701, baseType: !744, size: 32, offset: 16800)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "prof_child", scope: !1042, file: !6, line: 1703, baseType: !1009, size: 128, offset: 16832)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !1042, file: !6, line: 1705, baseType: !1040, size: 64, offset: 16960)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "fc_refcount", scope: !1042, file: !6, line: 1709, baseType: !744, size: 32, offset: 17024)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "fc_copyID", scope: !1042, file: !6, line: 1711, baseType: !744, size: 32, offset: 17056)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "fc_funcs", scope: !1042, file: !6, line: 1712, baseType: !985, size: 192, offset: 17088)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name_exp", scope: !975, file: !6, line: 1653, baseType: !739, size: 64, offset: 2944)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "uf_name", scope: !975, file: !6, line: 1655, baseType: !1086, size: 32, offset: 3008)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 32, elements: !1087)
!1087 = !{!1088}
!1088 = !DISubrange(count: 4)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "pt_auto", scope: !968, file: !6, line: 2001, baseType: !744, size: 32, offset: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "pt_outer", scope: !968, file: !6, line: 2005, baseType: !1091, size: 256, offset: 256)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "outer_T", file: !6, line: 1986, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_S", file: !6, line: 1987, size: 256, elements: !1093)
!1093 = !{!1094, !1096, !1097, !1099}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "out_stack", scope: !1092, file: !6, line: 1988, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame_idx", scope: !1092, file: !6, line: 1989, baseType: !744, size: 32, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "out_up", scope: !1092, file: !6, line: 1990, baseType: !1098, size: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "out_up_is_copy", scope: !1092, file: !6, line: 1991, baseType: !744, size: 32, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "pt_funcstack", scope: !968, file: !6, line: 2007, baseType: !1101, size: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "funcstack_T", file: !6, line: 1984, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "funcstack_S", file: !6, line: 1972, size: 320, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ga", scope: !1103, file: !6, line: 1974, baseType: !985, size: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "fs_var_offset", scope: !1103, file: !6, line: 1978, baseType: !744, size: 32, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "fs_refcount", scope: !1103, file: !6, line: 1981, baseType: !744, size: 32, offset: 224)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "fs_min_refcount", scope: !1103, file: !6, line: 1982, baseType: !744, size: 32, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "fs_copyID", scope: !1103, file: !6, line: 1983, baseType: !744, size: 32, offset: 288)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argc", scope: !968, file: !6, line: 2010, baseType: !744, size: 32, offset: 576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pt_argv", scope: !968, file: !6, line: 2011, baseType: !1075, size: 64, offset: 640)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pt_dict", scope: !968, file: !6, line: 2013, baseType: !932, size: 64, offset: 704)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "pt_copyID", scope: !968, file: !6, line: 2014, baseType: !744, size: 32, offset: 768)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "v_job", scope: !865, file: !6, line: 1427, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_T", file: !6, line: 1365, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jobvar_S", file: !6, line: 2072, size: 1024, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1124, !1125, !1126, !1128, !1129, !1130, !1131, !1138, !1139, !1140, !1141, !1241}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "jv_next", scope: !1117, file: !6, line: 2074, baseType: !1115, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "jv_prev", scope: !1117, file: !6, line: 2075, baseType: !1115, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "jv_pid", scope: !1117, file: !6, line: 2077, baseType: !1122, size: 32, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !841, line: 97, baseType: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !843, line: 154, baseType: !744)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_in", scope: !1117, file: !6, line: 2083, baseType: !739, size: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "jv_tty_out", scope: !1117, file: !6, line: 2084, baseType: !739, size: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "jv_status", scope: !1117, file: !6, line: 2085, baseType: !1127, size: 32, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobstatus_T", file: !6, line: 2067, baseType: !30)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "jv_stoponexit", scope: !1117, file: !6, line: 2086, baseType: !739, size: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "jv_termsig", scope: !1117, file: !6, line: 2088, baseType: !739, size: 64, offset: 448)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exitval", scope: !1117, file: !6, line: 2093, baseType: !744, size: 32, offset: 512)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "jv_exit_cb", scope: !1117, file: !6, line: 2094, baseType: !1132, size: 192, offset: 576)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "callback_T", file: !6, line: 1360, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 1356, size: 192, elements: !1134)
!1134 = !{!1135, !1136, !1137}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "cb_name", scope: !1133, file: !6, line: 1357, baseType: !739, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "cb_partial", scope: !1133, file: !6, line: 1358, baseType: !966, size: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "cb_free_name", scope: !1133, file: !6, line: 1359, baseType: !744, size: 32, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "jv_in_buf", scope: !1117, file: !6, line: 2096, baseType: !721, size: 64, offset: 768)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "jv_refcount", scope: !1117, file: !6, line: 2098, baseType: !744, size: 32, offset: 832)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "jv_copyID", scope: !1117, file: !6, line: 2099, baseType: !744, size: 32, offset: 864)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "jv_channel", scope: !1117, file: !6, line: 2101, baseType: !1142, size: 64, offset: 896)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "channel_T", file: !6, line: 1370, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "channel_S", file: !6, line: 2225, size: 11008, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "ch_next", scope: !1144, file: !6, line: 2226, baseType: !1142, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ch_prev", scope: !1144, file: !6, line: 2227, baseType: !1142, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ch_id", scope: !1144, file: !6, line: 2229, baseType: !744, size: 32, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ch_last_msg_id", scope: !1144, file: !6, line: 2230, baseType: !744, size: 32, offset: 160)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "ch_part", scope: !1144, file: !6, line: 2232, baseType: !1151, size: 9728, offset: 192)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1152, size: 9728, elements: !1087)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "chanpart_T", file: !6, line: 2223, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2177, size: 2432, elements: !1154)
!1154 = !{!1155, !1157, !1160, !1162, !1164, !1165, !1174, !1183, !1184, !1187, !1188, !1189, !1190, !1198, !1207, !1208, !1215, !1216, !1217, !1218, !1219}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "ch_fd", scope: !1153, file: !6, line: 2178, baseType: !1156, size: 32)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_T", file: !731, line: 1816, baseType: !744)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ch_inputHandler", scope: !1153, file: !6, line: 2188, baseType: !1158, size: 32, offset: 32)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !1159, line: 49, baseType: !744)
!1159 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/sahil/vim/src")
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "ch_mode", scope: !1153, file: !6, line: 2191, baseType: !1161, size: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_mode_T", file: !6, line: 2146, baseType: !36)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ch_io", scope: !1153, file: !6, line: 2192, baseType: !1163, size: 32, offset: 96)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "job_io_T", file: !6, line: 2154, baseType: !42)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ch_timeout", scope: !1153, file: !6, line: 2193, baseType: !744, size: 32, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ch_head", scope: !1153, file: !6, line: 2195, baseType: !1166, size: 256, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "readq_T", file: !6, line: 1366, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "readq_S", file: !6, line: 2108, size: 256, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1173}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "rq_buffer", scope: !1167, file: !6, line: 2110, baseType: !739, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "rq_buflen", scope: !1167, file: !6, line: 2111, baseType: !775, size: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "rq_next", scope: !1167, file: !6, line: 2112, baseType: !1172, size: 64, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "rq_prev", scope: !1167, file: !6, line: 2113, baseType: !1172, size: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "ch_json_head", scope: !1153, file: !6, line: 2196, baseType: !1175, size: 256, offset: 448)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsonq_T", file: !6, line: 1368, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jsonq_S", file: !6, line: 2123, size: 256, elements: !1177)
!1177 = !{!1178, !1179, !1181, !1182}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "jq_value", scope: !1176, file: !6, line: 2125, baseType: !1075, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "jq_next", scope: !1176, file: !6, line: 2126, baseType: !1180, size: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "jq_prev", scope: !1176, file: !6, line: 2127, baseType: !1180, size: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "jq_no_callback", scope: !1176, file: !6, line: 2128, baseType: !744, size: 32, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ch_block_ids", scope: !1153, file: !6, line: 2197, baseType: !985, size: 192, offset: 704)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ch_wait_len", scope: !1153, file: !6, line: 2203, baseType: !1185, size: 64, offset: 896)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1186, line: 62, baseType: !776)
!1186 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "ch_deadline", scope: !1153, file: !6, line: 2207, baseType: !1010, size: 128, offset: 960)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ch_block_write", scope: !1153, file: !6, line: 2209, baseType: !744, size: 32, offset: 1088)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ch_nonblocking", scope: !1153, file: !6, line: 2211, baseType: !744, size: 32, offset: 1120)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "ch_writeque", scope: !1153, file: !6, line: 2212, baseType: !1191, size: 320, offset: 1152)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "writeq_T", file: !6, line: 1367, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "writeq_S", file: !6, line: 2116, size: 320, elements: !1193)
!1193 = !{!1194, !1195, !1197}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "wq_ga", scope: !1192, file: !6, line: 2118, baseType: !985, size: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "wq_next", scope: !1192, file: !6, line: 2119, baseType: !1196, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "wq_prev", scope: !1192, file: !6, line: 2120, baseType: !1196, size: 64, offset: 256)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "ch_cb_head", scope: !1153, file: !6, line: 2214, baseType: !1199, size: 384, offset: 1472)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbq_T", file: !6, line: 1369, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbq_S", file: !6, line: 2131, size: 384, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1206}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "cq_callback", scope: !1200, file: !6, line: 2133, baseType: !1132, size: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "cq_seq_nr", scope: !1200, file: !6, line: 2134, baseType: !744, size: 32, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "cq_next", scope: !1200, file: !6, line: 2135, baseType: !1205, size: 64, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "cq_prev", scope: !1200, file: !6, line: 2136, baseType: !1205, size: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "ch_callback", scope: !1153, file: !6, line: 2215, baseType: !1132, size: 192, offset: 1856)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ch_bufref", scope: !1153, file: !6, line: 2217, baseType: !1209, size: 128, offset: 2048)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufref_T", file: !6, line: 102, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 98, size: 128, elements: !1211)
!1211 = !{!1212, !1213, !1214}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "br_buf", scope: !1210, file: !6, line: 99, baseType: !721, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "br_fnum", scope: !1210, file: !6, line: 100, baseType: !744, size: 32, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "br_buf_free_count", scope: !1210, file: !6, line: 101, baseType: !744, size: 32, offset: 96)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "ch_nomodifiable", scope: !1153, file: !6, line: 2218, baseType: !744, size: 32, offset: 2176)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ch_nomod_error", scope: !1153, file: !6, line: 2219, baseType: !744, size: 32, offset: 2208)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "ch_buf_append", scope: !1153, file: !6, line: 2220, baseType: !744, size: 32, offset: 2240)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "ch_buf_top", scope: !1153, file: !6, line: 2221, baseType: !730, size: 64, offset: 2304)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ch_buf_bot", scope: !1153, file: !6, line: 2222, baseType: !730, size: 64, offset: 2368)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ch_write_text_mode", scope: !1144, file: !6, line: 2233, baseType: !744, size: 32, offset: 9920)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ch_hostname", scope: !1144, file: !6, line: 2235, baseType: !718, size: 64, offset: 9984)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "ch_port", scope: !1144, file: !6, line: 2236, baseType: !744, size: 32, offset: 10048)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "ch_to_be_closed", scope: !1144, file: !6, line: 2238, baseType: !744, size: 32, offset: 10080)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ch_to_be_freed", scope: !1144, file: !6, line: 2241, baseType: !744, size: 32, offset: 10112)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "ch_error", scope: !1144, file: !6, line: 2243, baseType: !744, size: 32, offset: 10144)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ch_nb_close_cb", scope: !1144, file: !6, line: 2249, baseType: !1227, size: 64, offset: 10176)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{null}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ch_callback", scope: !1144, file: !6, line: 2256, baseType: !1132, size: 192, offset: 10240)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ch_close_cb", scope: !1144, file: !6, line: 2257, baseType: !1132, size: 192, offset: 10432)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "ch_drop_never", scope: !1144, file: !6, line: 2258, baseType: !744, size: 32, offset: 10624)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ch_keep_open", scope: !1144, file: !6, line: 2259, baseType: !744, size: 32, offset: 10656)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ch_nonblock", scope: !1144, file: !6, line: 2260, baseType: !744, size: 32, offset: 10688)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ch_job", scope: !1144, file: !6, line: 2262, baseType: !1115, size: 64, offset: 10752)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ch_job_killed", scope: !1144, file: !6, line: 2265, baseType: !744, size: 32, offset: 10816)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ch_anonymous_pipe", scope: !1144, file: !6, line: 2267, baseType: !744, size: 32, offset: 10848)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "ch_killing", scope: !1144, file: !6, line: 2268, baseType: !744, size: 32, offset: 10880)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "ch_refcount", scope: !1144, file: !6, line: 2270, baseType: !744, size: 32, offset: 10912)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ch_copyID", scope: !1144, file: !6, line: 2271, baseType: !744, size: 32, offset: 10944)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "jv_argv", scope: !1117, file: !6, line: 2102, baseType: !1242, size: 64, offset: 960)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "v_channel", scope: !865, file: !6, line: 1428, baseType: !1142, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "v_blob", scope: !865, file: !6, line: 1430, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "blob_T", file: !6, line: 1349, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blobvar_S", file: !6, line: 1561, size: 256, elements: !1248)
!1248 = !{!1249, !1250, !1251}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "bv_ga", scope: !1247, file: !6, line: 1563, baseType: !985, size: 192)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "bv_refcount", scope: !1247, file: !6, line: 1564, baseType: !744, size: 32, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "bv_lock", scope: !1247, file: !6, line: 1565, baseType: !719, size: 8, offset: 224)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "di_flags", scope: !855, file: !6, line: 1529, baseType: !740, size: 8, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "di_key", scope: !855, file: !6, line: 1530, baseType: !1254, size: 136, offset: 136)
!1254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 136, elements: !1255)
!1255 = !{!1256}
!1256 = !DISubrange(count: 17)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick", scope: !723, file: !6, line: 2679, baseType: !868, size: 64, offset: 1984)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_changedtick_pum", scope: !723, file: !6, line: 2681, baseType: !868, size: 64, offset: 2048)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "b_saving", scope: !723, file: !6, line: 2684, baseType: !744, size: 32, offset: 2112)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_set", scope: !723, file: !6, line: 2691, baseType: !744, size: 32, offset: 2144)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_top", scope: !723, file: !6, line: 2693, baseType: !730, size: 64, offset: 2176)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_bot", scope: !723, file: !6, line: 2694, baseType: !730, size: 64, offset: 2240)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "b_mod_xlines", scope: !723, file: !6, line: 2696, baseType: !732, size: 64, offset: 2304)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "b_wininfo", scope: !723, file: !6, line: 2699, baseType: !1265, size: 64, offset: 2368)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "wininfo_T", file: !6, line: 60, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wininfo_S", file: !6, line: 325, size: 11648, elements: !1268)
!1268 = !{!1269, !1270, !1271, !2063, !2064, !2065, !2066, !2067}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "wi_next", scope: !1267, file: !6, line: 327, baseType: !1265, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "wi_prev", scope: !1267, file: !6, line: 328, baseType: !1265, size: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "wi_win", scope: !1267, file: !6, line: 329, baseType: !1272, size: 64, offset: 128)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "win_T", file: !6, line: 59, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_S", file: !6, line: 3365, size: 72064, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1280, !1435, !1436, !1451, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1508, !1509, !1510, !1511, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1532, !1533, !1535, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1556, !1557, !1558, !1559, !1560, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1620, !1621, !1622, !1623, !1624, !1875, !1883, !1884, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1976, !1977, !1978, !1979, !2020, !2021, !2031, !2032, !2033, !2034, !2035, !2055, !2056, !2057, !2058, !2062}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "w_id", scope: !1274, file: !6, line: 3367, baseType: !744, size: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "w_buffer", scope: !1274, file: !6, line: 3369, baseType: !721, size: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "w_prev", scope: !1274, file: !6, line: 3371, baseType: !1272, size: 64, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "w_next", scope: !1274, file: !6, line: 3372, baseType: !1272, size: 64, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "w_s", scope: !1274, file: !6, line: 3375, baseType: !1281, size: 64, offset: 256)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "synblock_T", file: !6, line: 2618, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2542, size: 9920, elements: !1284)
!1284 = !{!1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1300, !1301, !1302, !1303, !1304, !1362, !1370, !1371, !1372, !1373, !1374, !1411, !1412, !1413, !1414, !1415, !1416, !1418, !1419, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1434}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab", scope: !1283, file: !6, line: 2544, baseType: !941, size: 2432)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "b_keywtab_ic", scope: !1283, file: !6, line: 2545, baseType: !941, size: 2432, offset: 2432)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_error", scope: !1283, file: !6, line: 2546, baseType: !744, size: 32, offset: 4864)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_slow", scope: !1283, file: !6, line: 2548, baseType: !744, size: 32, offset: 4896)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_ic", scope: !1283, file: !6, line: 2550, baseType: !744, size: 32, offset: 4928)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_foldlevel", scope: !1283, file: !6, line: 2551, baseType: !744, size: 32, offset: 4960)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_spell", scope: !1283, file: !6, line: 2552, baseType: !744, size: 32, offset: 4992)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_patterns", scope: !1283, file: !6, line: 2553, baseType: !985, size: 192, offset: 5056)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_clusters", scope: !1283, file: !6, line: 2554, baseType: !985, size: 192, offset: 5248)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_cluster_id", scope: !1283, file: !6, line: 2555, baseType: !744, size: 32, offset: 5440)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "b_nospell_cluster_id", scope: !1283, file: !6, line: 2556, baseType: !744, size: 32, offset: 5472)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_containedin", scope: !1283, file: !6, line: 2557, baseType: !744, size: 32, offset: 5504)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_flags", scope: !1283, file: !6, line: 2559, baseType: !744, size: 32, offset: 5536)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_id", scope: !1283, file: !6, line: 2560, baseType: !1299, size: 16, offset: 5568)
!1299 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_minlines", scope: !1283, file: !6, line: 2561, baseType: !732, size: 64, offset: 5632)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_maxlines", scope: !1283, file: !6, line: 2562, baseType: !732, size: 64, offset: 5696)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_sync_linebreaks", scope: !1283, file: !6, line: 2563, baseType: !732, size: 64, offset: 5760)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_pat", scope: !1283, file: !6, line: 2564, baseType: !739, size: 64, offset: 5824)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_prog", scope: !1283, file: !6, line: 2565, baseType: !1305, size: 64, offset: 5888)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "regprog_T", file: !1307, line: 56, baseType: !1308)
!1307 = !DIFile(filename: "./regexp.h", directory: "/home/sahil/vim/src")
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regprog", file: !1307, line: 49, size: 192, elements: !1309)
!1309 = !{!1310, !1358, !1359, !1360, !1361}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !1308, file: !1307, line: 51, baseType: !1311, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "regengine_T", file: !1307, line: 42, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regengine", file: !1307, line: 167, size: 320, elements: !1314)
!1314 = !{!1315, !1319, !1323, !1338, !1357}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "regcomp", scope: !1313, file: !1307, line: 169, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!1305, !739, !744}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "regfree", scope: !1313, file: !1307, line: 170, baseType: !1320, size: 64, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{null, !1305}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_nl", scope: !1313, file: !1307, line: 171, baseType: !1324, size: 64, offset: 128)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!744, !1327, !739, !813, !744}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_T", file: !1307, line: 137, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1307, line: 131, size: 1408, elements: !1330)
!1330 = !{!1331, !1332, !1336, !1337}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !1329, file: !1307, line: 133, baseType: !1305, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "startp", scope: !1329, file: !1307, line: 134, baseType: !1333, size: 640, offset: 64)
!1333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 640, elements: !1334)
!1334 = !{!1335}
!1335 = !DISubrange(count: 10)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "endp", scope: !1329, file: !1307, line: 135, baseType: !1333, size: 640, offset: 704)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "rm_ic", scope: !1329, file: !1307, line: 136, baseType: !744, size: 32, offset: 1344)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "regexec_multi", scope: !1313, file: !1307, line: 172, baseType: !1339, size: 64, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DISubroutineType(types: !1341)
!1341 = !{!732, !1342, !1272, !721, !730, !813, !1021, !1003}
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmmatch_T", file: !1307, line: 154, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1307, line: 147, size: 2688, elements: !1345)
!1345 = !{!1346, !1347, !1354, !1355, !1356}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "regprog", scope: !1344, file: !1307, line: 149, baseType: !1305, size: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "startpos", scope: !1344, file: !1307, line: 150, baseType: !1348, size: 1280, offset: 64)
!1348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1349, size: 1280, elements: !1334)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "lpos_T", file: !6, line: 41, baseType: !1350)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 37, size: 128, elements: !1351)
!1351 = !{!1352, !1353}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !1350, file: !6, line: 39, baseType: !730, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1350, file: !6, line: 40, baseType: !813, size: 32, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "endpos", scope: !1344, file: !1307, line: 151, baseType: !1348, size: 1280, offset: 1344)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_ic", scope: !1344, file: !1307, line: 152, baseType: !744, size: 32, offset: 2624)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "rmm_maxcol", scope: !1344, file: !1307, line: 153, baseType: !813, size: 32, offset: 2656)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1313, file: !1307, line: 173, baseType: !739, size: 64, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "regflags", scope: !1308, file: !1307, line: 52, baseType: !717, size: 32, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "re_engine", scope: !1308, file: !1307, line: 53, baseType: !717, size: 32, offset: 96)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "re_flags", scope: !1308, file: !1307, line: 54, baseType: !717, size: 32, offset: 128)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "re_in_use", scope: !1308, file: !1307, line: 55, baseType: !744, size: 32, offset: 160)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_time", scope: !1283, file: !6, line: 2567, baseType: !1363, size: 384, offset: 5952)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "syn_time_T", file: !6, line: 2475, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 2470, size: 384, elements: !1365)
!1365 = !{!1366, !1367, !1368, !1369}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1364, file: !6, line: 2471, baseType: !1009, size: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "slowest", scope: !1364, file: !6, line: 2472, baseType: !1009, size: 128, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1364, file: !6, line: 2473, baseType: !732, size: 64, offset: 256)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !1364, file: !6, line: 2474, baseType: !732, size: 64, offset: 320)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_linecont_ic", scope: !1283, file: !6, line: 2569, baseType: !744, size: 32, offset: 6336)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_topgrp", scope: !1283, file: !6, line: 2570, baseType: !744, size: 32, offset: 6368)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_conceal", scope: !1283, file: !6, line: 2572, baseType: !744, size: 32, offset: 6400)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_folditems", scope: !1283, file: !6, line: 2575, baseType: !744, size: 32, offset: 6432)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_array", scope: !1283, file: !6, line: 2592, baseType: !1375, size: 64, offset: 6464)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "synstate_T", file: !6, line: 1061, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syn_state", file: !6, line: 1063, size: 1728, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1403, !1404, !1405, !1407, !1410}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next", scope: !1377, file: !6, line: 1065, baseType: !1375, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "sst_lnum", scope: !1377, file: !6, line: 1066, baseType: !730, size: 64, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "sst_union", scope: !1377, file: !6, line: 1071, baseType: !1382, size: 1344, offset: 128)
!1382 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1377, file: !6, line: 1067, size: 1344, elements: !1383)
!1383 = !{!1384, !1402}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stack", scope: !1382, file: !6, line: 1069, baseType: !1385, size: 1344)
!1385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1386, size: 1344, elements: !1400)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "bufstate_T", file: !6, line: 1055, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_state", file: !6, line: 1046, size: 192, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392, !1393}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "bs_idx", scope: !1387, file: !6, line: 1048, baseType: !744, size: 32)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "bs_flags", scope: !1387, file: !6, line: 1049, baseType: !744, size: 32, offset: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "bs_seqnr", scope: !1387, file: !6, line: 1051, baseType: !744, size: 32, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "bs_cchar", scope: !1387, file: !6, line: 1052, baseType: !744, size: 32, offset: 96)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "bs_extmatch", scope: !1387, file: !6, line: 1054, baseType: !1394, size: 64, offset: 128)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_extmatch_T", file: !1307, line: 165, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1307, line: 161, size: 704, elements: !1397)
!1397 = !{!1398, !1399}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1396, file: !1307, line: 163, baseType: !1299, size: 16)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !1396, file: !1307, line: 164, baseType: !1333, size: 640, offset: 64)
!1400 = !{!1401}
!1401 = !DISubrange(count: 7)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "sst_ga", scope: !1382, file: !6, line: 1070, baseType: !985, size: 192)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_flags", scope: !1377, file: !6, line: 1072, baseType: !744, size: 32, offset: 1472)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "sst_stacksize", scope: !1377, file: !6, line: 1073, baseType: !744, size: 32, offset: 1504)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "sst_next_list", scope: !1377, file: !6, line: 1074, baseType: !1406, size: 64, offset: 1536)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "sst_tick", scope: !1377, file: !6, line: 1076, baseType: !1408, size: 16, offset: 1600)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "disptick_T", file: !731, line: 1689, baseType: !1409)
!1409 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "sst_change_lnum", scope: !1377, file: !6, line: 1077, baseType: !730, size: 64, offset: 1664)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_len", scope: !1283, file: !6, line: 2593, baseType: !744, size: 32, offset: 6528)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_first", scope: !1283, file: !6, line: 2594, baseType: !1375, size: 64, offset: 6592)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_firstfree", scope: !1283, file: !6, line: 2595, baseType: !1375, size: 64, offset: 6656)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_freecount", scope: !1283, file: !6, line: 2596, baseType: !744, size: 32, offset: 6720)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_check_lnum", scope: !1283, file: !6, line: 2597, baseType: !730, size: 64, offset: 6784)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "b_sst_lasttick", scope: !1283, file: !6, line: 2598, baseType: !1417, size: 16, offset: 6848)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "short_u", file: !731, line: 325, baseType: !1409)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "b_langp", scope: !1283, file: !6, line: 2603, baseType: !985, size: 192, offset: 6912)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw", scope: !1283, file: !6, line: 2604, baseType: !1420, size: 2048, offset: 7104)
!1420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 2048, elements: !1421)
!1421 = !{!1422}
!1422 = !DISubrange(count: 256)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "b_spell_ismw_mb", scope: !1283, file: !6, line: 2605, baseType: !739, size: 64, offset: 9152)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spc", scope: !1283, file: !6, line: 2606, baseType: !739, size: 64, offset: 9216)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "b_cap_prog", scope: !1283, file: !6, line: 2607, baseType: !1305, size: 64, offset: 9280)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spf", scope: !1283, file: !6, line: 2608, baseType: !739, size: 64, offset: 9344)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spl", scope: !1283, file: !6, line: 2609, baseType: !739, size: 64, offset: 9408)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "b_p_spo", scope: !1283, file: !6, line: 2610, baseType: !739, size: 64, offset: 9472)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "b_cjk", scope: !1283, file: !6, line: 2611, baseType: !744, size: 32, offset: 9536)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_chartab", scope: !1283, file: !6, line: 2616, baseType: !1431, size: 256, offset: 9568)
!1431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 256, elements: !1432)
!1432 = !{!1433}
!1433 = !DISubrange(count: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "b_syn_isk", scope: !1283, file: !6, line: 2617, baseType: !739, size: 64, offset: 9856)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "w_closing", scope: !1274, file: !6, line: 3378, baseType: !744, size: 32, offset: 320)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "w_frame", scope: !1274, file: !6, line: 3381, baseType: !1437, size: 64, offset: 384)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_T", file: !6, line: 61, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_S", file: !6, line: 3231, size: 512, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "fr_layout", scope: !1439, file: !6, line: 3233, baseType: !719, size: 8)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "fr_width", scope: !1439, file: !6, line: 3234, baseType: !744, size: 32, offset: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newwidth", scope: !1439, file: !6, line: 3235, baseType: !744, size: 32, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "fr_height", scope: !1439, file: !6, line: 3236, baseType: !744, size: 32, offset: 96)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "fr_newheight", scope: !1439, file: !6, line: 3237, baseType: !744, size: 32, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "fr_parent", scope: !1439, file: !6, line: 3238, baseType: !1437, size: 64, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "fr_next", scope: !1439, file: !6, line: 3239, baseType: !1437, size: 64, offset: 256)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "fr_prev", scope: !1439, file: !6, line: 3241, baseType: !1437, size: 64, offset: 320)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "fr_child", scope: !1439, file: !6, line: 3244, baseType: !1437, size: 64, offset: 384)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "fr_win", scope: !1439, file: !6, line: 3245, baseType: !1272, size: 64, offset: 448)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor", scope: !1274, file: !6, line: 3383, baseType: !1452, size: 128, offset: 448)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_T", file: !6, line: 31, baseType: !1453)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 26, size: 128, elements: !1454)
!1454 = !{!1455, !1456, !1457}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !1453, file: !6, line: 28, baseType: !730, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1453, file: !6, line: 29, baseType: !813, size: 32, offset: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "coladd", scope: !1453, file: !6, line: 30, baseType: !813, size: 32, offset: 96)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "w_curswant", scope: !1274, file: !6, line: 3385, baseType: !813, size: 32, offset: 576)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "w_set_curswant", scope: !1274, file: !6, line: 3389, baseType: !744, size: 32, offset: 608)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "w_last_cursorline", scope: !1274, file: !6, line: 3394, baseType: !730, size: 64, offset: 640)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_mode", scope: !1274, file: !6, line: 3400, baseType: !719, size: 8, offset: 704)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lnum", scope: !1274, file: !6, line: 3401, baseType: !730, size: 64, offset: 768)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_fcol", scope: !1274, file: !6, line: 3402, baseType: !813, size: 32, offset: 832)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_cursor_lcol", scope: !1274, file: !6, line: 3403, baseType: !813, size: 32, offset: 864)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_lnum", scope: !1274, file: !6, line: 3404, baseType: !730, size: 64, offset: 896)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_visual_col", scope: !1274, file: !6, line: 3405, baseType: !813, size: 32, offset: 960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_curswant", scope: !1274, file: !6, line: 3406, baseType: !813, size: 32, offset: 992)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "w_lcs_chars", scope: !1274, file: !6, line: 3408, baseType: !1469, size: 352, offset: 1024)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "lcs_chars_T", file: !6, line: 3358, baseType: !1470)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3343, size: 352, elements: !1471)
!1471 = !{!1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !1470, file: !6, line: 3345, baseType: !744, size: 32)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1470, file: !6, line: 3346, baseType: !744, size: 32, offset: 32)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !1470, file: !6, line: 3347, baseType: !744, size: 32, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "nbsp", scope: !1470, file: !6, line: 3348, baseType: !744, size: 32, offset: 96)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1470, file: !6, line: 3349, baseType: !744, size: 32, offset: 128)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "tab1", scope: !1470, file: !6, line: 3350, baseType: !744, size: 32, offset: 160)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "tab2", scope: !1470, file: !6, line: 3351, baseType: !744, size: 32, offset: 192)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "tab3", scope: !1470, file: !6, line: 3352, baseType: !744, size: 32, offset: 224)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "trail", scope: !1470, file: !6, line: 3353, baseType: !744, size: 32, offset: 256)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "lead", scope: !1470, file: !6, line: 3354, baseType: !744, size: 32, offset: 288)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "conceal", scope: !1470, file: !6, line: 3356, baseType: !744, size: 32, offset: 320)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline", scope: !1274, file: !6, line: 3414, baseType: !730, size: 64, offset: 1408)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_was_set", scope: !1274, file: !6, line: 3416, baseType: !719, size: 8, offset: 1472)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "w_botline", scope: !1274, file: !6, line: 3419, baseType: !730, size: 64, offset: 1536)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "w_topfill", scope: !1274, file: !6, line: 3423, baseType: !744, size: 32, offset: 1600)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_topfill", scope: !1274, file: !6, line: 3424, baseType: !744, size: 32, offset: 1632)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "w_botfill", scope: !1274, file: !6, line: 3425, baseType: !744, size: 32, offset: 1664)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "w_old_botfill", scope: !1274, file: !6, line: 3427, baseType: !744, size: 32, offset: 1696)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "w_leftcol", scope: !1274, file: !6, line: 3429, baseType: !813, size: 32, offset: 1728)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "w_skipcol", scope: !1274, file: !6, line: 3432, baseType: !813, size: 32, offset: 1760)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "w_empty_rows", scope: !1274, file: !6, line: 3435, baseType: !744, size: 32, offset: 1792)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "w_filler_rows", scope: !1274, file: !6, line: 3437, baseType: !744, size: 32, offset: 1824)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "w_winrow", scope: !1274, file: !6, line: 3445, baseType: !744, size: 32, offset: 1856)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "w_height", scope: !1274, file: !6, line: 3446, baseType: !744, size: 32, offset: 1888)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "w_status_height", scope: !1274, file: !6, line: 3449, baseType: !744, size: 32, offset: 1920)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "w_wincol", scope: !1274, file: !6, line: 3450, baseType: !744, size: 32, offset: 1952)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "w_width", scope: !1274, file: !6, line: 3451, baseType: !744, size: 32, offset: 1984)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "w_vsep_width", scope: !1274, file: !6, line: 3452, baseType: !744, size: 32, offset: 2016)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "w_save_cursor", scope: !1274, file: !6, line: 3454, baseType: !1501, size: 320, offset: 2048)
!1501 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_save_T", file: !6, line: 3330, baseType: !1502)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 3324, size: 320, elements: !1503)
!1503 = !{!1504, !1505, !1506, !1507}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_save", scope: !1502, file: !6, line: 3326, baseType: !744, size: 32)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "w_topline_corr", scope: !1502, file: !6, line: 3327, baseType: !744, size: 32, offset: 32)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_save", scope: !1502, file: !6, line: 3328, baseType: !1452, size: 128, offset: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "w_cursor_corr", scope: !1502, file: !6, line: 3329, baseType: !1452, size: 128, offset: 192)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_flags", scope: !1274, file: !6, line: 3457, baseType: !744, size: 32, offset: 2368)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_handled", scope: !1274, file: !6, line: 3458, baseType: !744, size: 32, offset: 2400)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_title", scope: !1274, file: !6, line: 3459, baseType: !739, size: 64, offset: 2432)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_pos", scope: !1274, file: !6, line: 3460, baseType: !1512, size: 32, offset: 2496)
!1512 = !DIDerivedType(tag: DW_TAG_typedef, name: "poppos_T", file: !6, line: 2524, baseType: !49)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_fixed", scope: !1274, file: !6, line: 3461, baseType: !744, size: 32, offset: 2528)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_type", scope: !1274, file: !6, line: 3462, baseType: !744, size: 32, offset: 2560)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_win", scope: !1274, file: !6, line: 3463, baseType: !1272, size: 64, offset: 2624)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_prop_id", scope: !1274, file: !6, line: 3464, baseType: !744, size: 32, offset: 2688)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "w_zindex", scope: !1274, file: !6, line: 3465, baseType: !744, size: 32, offset: 2720)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "w_minheight", scope: !1274, file: !6, line: 3466, baseType: !744, size: 32, offset: 2752)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "w_minwidth", scope: !1274, file: !6, line: 3467, baseType: !744, size: 32, offset: 2784)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxheight", scope: !1274, file: !6, line: 3468, baseType: !744, size: 32, offset: 2816)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth", scope: !1274, file: !6, line: 3469, baseType: !744, size: 32, offset: 2848)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "w_maxwidth_opt", scope: !1274, file: !6, line: 3470, baseType: !744, size: 32, offset: 2880)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantline", scope: !1274, file: !6, line: 3471, baseType: !744, size: 32, offset: 2912)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "w_wantcol", scope: !1274, file: !6, line: 3472, baseType: !744, size: 32, offset: 2944)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "w_firstline", scope: !1274, file: !6, line: 3473, baseType: !744, size: 32, offset: 2976)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "w_want_scrollbar", scope: !1274, file: !6, line: 3474, baseType: !744, size: 32, offset: 3008)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "w_has_scrollbar", scope: !1274, file: !6, line: 3475, baseType: !744, size: 32, offset: 3040)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "w_scrollbar_highlight", scope: !1274, file: !6, line: 3476, baseType: !739, size: 64, offset: 3072)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "w_thumb_highlight", scope: !1274, file: !6, line: 3477, baseType: !739, size: 64, offset: 3136)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "w_popup_padding", scope: !1274, file: !6, line: 3478, baseType: !1531, size: 128, offset: 3200)
!1531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 128, elements: !1087)
