; ModuleID = 'xdiff/xemit.c'
source_filename = "xdiff/xemit.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.s_xdchange = type { %struct.s_xdchange*, i64, i64, i64, i64, i32 }
%struct.s_xdemitconf = type { i64, i64, i64, i64 (i8*, i64, i8*, i64, i8*)*, i8*, i32 (i64, i64, i64, i64, i8*)* }
%struct.s_xdfenv = type { %struct.s_xdfile, %struct.s_xdfile }
%struct.s_xdfile = type { %struct.s_chastore, i64, i32, %struct.s_xrecord**, i64, i64, %struct.s_xrecord**, i8*, i64*, i64, i64* }
%struct.s_chastore = type { %struct.s_chanode*, %struct.s_chanode*, i64, i64, %struct.s_chanode*, %struct.s_chanode*, i64 }
%struct.s_chanode = type { %struct.s_chanode*, i64 }
%struct.s_xrecord = type { %struct.s_xrecord*, i8*, i64, i64 }
%struct.s_xdemitcb = type { i8*, i32 (i8*, %struct.s_mmbuffer*, i32)* }
%struct.s_mmbuffer = type { i8*, i64 }
%struct.func_line = type { i64, [80 x i8] }

@.str = private unnamed_addr constant [2 x i8] c" \00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"-\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"+\00", align 1

; Function Attrs: nounwind uwtable
define %struct.s_xdchange* @xdl_get_hunk(%struct.s_xdchange** nocapture, %struct.s_xdemitconf* nocapture readonly) local_unnamed_addr #0 !dbg !10 {
  call void @llvm.dbg.value(metadata %struct.s_xdchange** %0, metadata !53, metadata !DIExpression()), !dbg !65

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 6.0.1-14 (tags/RELEASE_601/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "xdiff/xemit.c", directory: "/home/sahil/vim/src")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!10 = distinct !DISubprogram(name: "xdl_get_hunk", scope: !1, file: !1, line: 52, type: !11, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !52)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !26, !27}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdchange_t", file: !15, line: 45, baseType: !16)
!15 = !DIFile(filename: "xdiff/xdiffi.h", directory: "/home/sahil/vim/src")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdchange", file: !15, line: 40, size: 384, elements: !17)
!17 = !{!18, !20, !21, !22, !23, !24}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !16, file: !15, line: 41, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !16, file: !15, line: 42, baseType: !5, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !16, file: !15, line: 42, baseType: !5, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "chg1", scope: !16, file: !15, line: 43, baseType: !5, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "chg2", scope: !16, file: !15, line: 43, baseType: !5, size: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !16, file: !15, line: 44, baseType: !25, size: 32, offset: 320)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdemitconf_t", file: !30, line: 105, baseType: !31)
!30 = !DIFile(filename: "xdiff/xdiff.h", directory: "/home/sahil/vim/src")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdemitconf", file: !30, line: 98, size: 384, elements: !32)
!32 = !{!33, !34, !35, !37, !46, !47}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ctxlen", scope: !31, file: !30, line: 99, baseType: !5, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "interhunkctxlen", scope: !31, file: !30, line: 100, baseType: !5, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !31, file: !30, line: 101, baseType: !36, size: 64, offset: 128)
!36 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "find_func", scope: !31, file: !30, line: 102, baseType: !38, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "find_func_t", file: !30, line: 92, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!5, !42, !5, !45, !5, !4}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "find_func_priv", scope: !31, file: !30, line: 103, baseType: !4, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hunk_func", scope: !31, file: !30, line: 104, baseType: !48, size: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdl_emit_hunk_consume_func_t", file: !30, line: 94, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!25, !5, !5, !5, !5, !4}
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61}
!53 = !DILocalVariable(name: "xscr", arg: 1, scope: !10, file: !1, line: 52, type: !26)
!54 = !DILocalVariable(name: "xecfg", arg: 2, scope: !10, file: !1, line: 52, type: !27)
!55 = !DILocalVariable(name: "xch", scope: !10, file: !1, line: 54, type: !13)
!56 = !DILocalVariable(name: "xchp", scope: !10, file: !1, line: 54, type: !13)
!57 = !DILocalVariable(name: "lxch", scope: !10, file: !1, line: 54, type: !13)
!58 = !DILocalVariable(name: "max_common", scope: !10, file: !1, line: 55, type: !5)
!59 = !DILocalVariable(name: "max_ignorable", scope: !10, file: !1, line: 56, type: !5)
!60 = !DILocalVariable(name: "ignored", scope: !10, file: !1, line: 57, type: !36)
!61 = !DILocalVariable(name: "distance", scope: !62, file: !1, line: 74, type: !5)
!62 = distinct !DILexicalBlock(scope: !63, file: !1, line: 73, column: 73)
!63 = distinct !DILexicalBlock(scope: !64, file: !1, line: 73, column: 2)
!64 = distinct !DILexicalBlock(scope: !10, file: !1, line: 73, column: 2)
!65 = !DILocation(line: 52, column: 39, scope: !10)
!66 = !DILocation(line: 52, column: 65, scope: !10)
!67 = !DILocation(line: 55, column: 31, scope: !10)
!68 = !{!69, !70, i64 0}
!69 = !{!"s_xdemitconf", !70, i64 0, !70, i64 8, !70, i64 16, !73, i64 24, !73, i64 32, !73, i64 40}
!70 = !{!"long", !71, i64 0}
!71 = !{!"omnipotent char", !72, i64 0}
!72 = !{!"Simple C/C++ TBAA"}
!73 = !{!"any pointer", !71, i64 0}
!74 = !DILocation(line: 55, column: 22, scope: !10)
!75 = !DILocation(line: 55, column: 47, scope: !10)
!76 = !{!69, !70, i64 8}
!77 = !DILocation(line: 55, column: 38, scope: !10)
!78 = !DILocation(line: 55, column: 7, scope: !10)
!79 = !DILocation(line: 56, column: 7, scope: !10)
!80 = !DILocation(line: 57, column: 16, scope: !10)
!81 = !DILocation(line: 54, column: 20, scope: !10)
!82 = !{!73, !73, i64 0}
!83 = !DILocation(line: 60, column: 21, scope: !84)
!84 = distinct !DILexicalBlock(scope: !85, file: !1, line: 60, column: 2)
!85 = distinct !DILexicalBlock(scope: !10, file: !1, line: 60, column: 2)
!86 = !DILocation(line: 60, column: 26, scope: !84)
!87 = !DILocation(line: 60, column: 35, scope: !84)
!88 = !{!89, !90, i64 40}
!89 = !{!"s_xdchange", !73, i64 0, !70, i64 8, !70, i64 16, !70, i64 24, !70, i64 32, !90, i64 40}
!90 = !{!"int", !71, i64 0}
!91 = !DILocation(line: 60, column: 2, scope: !85)
!92 = !DILocation(line: 61, column: 15, scope: !93)
!93 = distinct !DILexicalBlock(scope: !84, file: !1, line: 60, column: 62)
!94 = !{!89, !73, i64 0}
!95 = !DILocation(line: 54, column: 14, scope: !10)
!96 = !DILocation(line: 63, column: 11, scope: !97)
!97 = distinct !DILexicalBlock(scope: !93, file: !1, line: 63, column: 7)
!98 = !DILocation(line: 63, column: 19, scope: !97)
!99 = !DILocation(line: 64, column: 12, scope: !97)
!100 = !{!89, !70, i64 8}
!101 = !DILocation(line: 64, column: 24, scope: !97)
!102 = !DILocation(line: 64, column: 35, scope: !97)
!103 = !{!89, !70, i64 24}
!104 = !DILocation(line: 64, column: 27, scope: !97)
!105 = !DILocation(line: 64, column: 15, scope: !97)
!106 = !DILocation(line: 64, column: 41, scope: !97)
!107 = !DILocation(line: 63, column: 7, scope: !93)
!108 = !DILocation(line: 65, column: 10, scope: !97)
!109 = !DILocation(line: 65, column: 4, scope: !97)
!110 = distinct !{!110, !91, !111}
!111 = !DILocation(line: 66, column: 2, scope: !85)
!112 = !DILocation(line: 68, column: 6, scope: !113)
!113 = distinct !DILexicalBlock(scope: !10, file: !1, line: 68, column: 6)
!114 = !DILocation(line: 68, column: 12, scope: !113)
!115 = !DILocation(line: 68, column: 6, scope: !10)
!116 = !DILocation(line: 54, column: 27, scope: !10)
!117 = !DILocation(line: 73, column: 2, scope: !64)
!118 = !DILocation(line: 74, column: 36, scope: !62)
!119 = !DILocation(line: 74, column: 24, scope: !62)
!120 = !DILocation(line: 74, column: 47, scope: !62)
!121 = !DILocation(line: 74, column: 39, scope: !62)
!122 = !DILocation(line: 74, column: 27, scope: !62)
!123 = !DILocation(line: 74, column: 8, scope: !62)
!124 = !DILocation(line: 75, column: 16, scope: !125)
!125 = distinct !DILexicalBlock(scope: !62, file: !1, line: 75, column: 7)
!126 = !DILocation(line: 75, column: 7, scope: !62)
!127 = !DILocation(line: 78, column: 16, scope: !128)
!128 = distinct !DILexicalBlock(scope: !62, file: !1, line: 78, column: 7)
!129 = !DILocation(line: 78, column: 32, scope: !128)
!130 = !DILocation(line: 78, column: 42, scope: !128)
!131 = !DILocation(line: 78, column: 37, scope: !128)
!132 = !DILocation(line: 78, column: 57, scope: !128)
!133 = !DILocation(line: 78, column: 49, scope: !128)
!134 = !DILocation(line: 82, column: 20, scope: !135)
!135 = distinct !DILexicalBlock(scope: !136, file: !1, line: 81, column: 55)
!136 = distinct !DILexicalBlock(scope: !128, file: !1, line: 81, column: 14)
!137 = !{!89, !70, i64 32}
!138 = !DILocation(line: 82, column: 12, scope: !135)
!139 = !DILocation(line: 83, column: 3, scope: !135)
!140 = !DILocation(line: 83, column: 19, scope: !141)
!141 = distinct !DILexicalBlock(scope: !136, file: !1, line: 83, column: 14)
!142 = !DILocation(line: 83, column: 27, scope: !141)
!143 = !DILocation(line: 84, column: 40, scope: !141)
!144 = !DILocation(line: 84, column: 51, scope: !141)
!145 = !DILocation(line: 84, column: 43, scope: !141)
!146 = !DILocation(line: 84, column: 15, scope: !141)
!147 = !DILocation(line: 84, column: 31, scope: !141)
!148 = !DILocation(line: 84, column: 57, scope: !141)
!149 = !DILocation(line: 83, column: 14, scope: !136)
!150 = !DILocation(line: 86, column: 20, scope: !151)
!151 = distinct !DILexicalBlock(scope: !141, file: !1, line: 86, column: 14)
!152 = !DILocation(line: 86, column: 15, scope: !151)
!153 = !DILocation(line: 86, column: 14, scope: !141)
!154 = !DILocation(line: 90, column: 20, scope: !155)
!155 = distinct !DILexicalBlock(scope: !151, file: !1, line: 89, column: 10)
!156 = !DILocation(line: 90, column: 12, scope: !155)
!157 = distinct !{!157, !117, !158}
!158 = !DILocation(line: 92, column: 2, scope: !64)
!159 = !DILocation(line: 95, column: 1, scope: !10)
!160 = distinct !DISubprogram(name: "xdl_emit_diff", scope: !1, file: !1, line: 177, type: !161, isLocal: false, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !229)
!161 = !DISubroutineType(types: !162)
!162 = !{!25, !163, !13, !214, !27}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdfenv_t", file: !165, line: 63, baseType: !166)
!165 = !DIFile(filename: "xdiff/xtypes.h", directory: "/home/sahil/vim/src")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdfenv", file: !165, line: 61, size: 2176, elements: !167)
!167 = !{!168, !213}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "xdf1", scope: !166, file: !165, line: 62, baseType: !169, size: 1088)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdfile_t", file: !165, line: 59, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdfile", file: !165, line: 48, size: 1088, elements: !171)
!171 = !{!172, !190, !191, !193, !204, !205, !206, !207, !208, !210, !211}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "rcha", scope: !170, file: !165, line: 49, baseType: !173, size: 448)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "chastore_t", file: !165, line: 39, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_chastore", file: !165, line: 33, size: 448, elements: !175)
!175 = !{!176, !184, !185, !186, !187, !188, !189}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !174, file: !165, line: 34, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "chanode_t", file: !165, line: 31, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_chanode", file: !165, line: 28, size: 128, elements: !180)
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !165, line: 29, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "icurr", scope: !179, file: !165, line: 30, baseType: !5, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !174, file: !165, line: 34, baseType: !177, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "isize", scope: !174, file: !165, line: 35, baseType: !5, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !174, file: !165, line: 35, baseType: !5, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ancur", scope: !174, file: !165, line: 36, baseType: !177, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sncur", scope: !174, file: !165, line: 37, baseType: !177, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "scurr", scope: !174, file: !165, line: 38, baseType: !5, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nrec", scope: !170, file: !165, line: 50, baseType: !5, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "hbits", scope: !170, file: !165, line: 51, baseType: !192, size: 32, offset: 512)
!192 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rhash", scope: !170, file: !165, line: 52, baseType: !194, size: 64, offset: 576)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "xrecord_t", file: !165, line: 46, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xrecord", file: !165, line: 41, size: 256, elements: !198)
!198 = !{!199, !201, !202, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !165, line: 42, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !197, file: !165, line: 43, baseType: !42, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !165, line: 44, baseType: !5, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ha", scope: !197, file: !165, line: 45, baseType: !36, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "dstart", scope: !170, file: !165, line: 53, baseType: !5, size: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "dend", scope: !170, file: !165, line: 53, baseType: !5, size: 64, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "recs", scope: !170, file: !165, line: 54, baseType: !194, size: 64, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rchg", scope: !170, file: !165, line: 55, baseType: !45, size: 64, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !170, file: !165, line: 56, baseType: !209, size: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "nreff", scope: !170, file: !165, line: 57, baseType: !5, size: 64, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ha", scope: !170, file: !165, line: 58, baseType: !212, size: 64, offset: 1024)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "xdf2", scope: !166, file: !165, line: 62, baseType: !169, size: 1088, offset: 1088)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdemitcb_t", file: !30, line: 90, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdemitcb", file: !30, line: 87, size: 128, elements: !217)
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !216, file: !30, line: 88, baseType: !4, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "outf", scope: !216, file: !30, line: 89, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!25, !4, !223, !25}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "mmbuffer_t", file: !30, line: 77, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_mmbuffer", file: !30, line: 74, size: 128, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !225, file: !30, line: 75, baseType: !45, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !225, file: !30, line: 76, baseType: !5, size: 64, offset: 64)
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!230 = !DILocalVariable(name: "xe", arg: 1, scope: !160, file: !1, line: 177, type: !163)
!231 = !DILocalVariable(name: "xscr", arg: 2, scope: !160, file: !1, line: 177, type: !13)
!232 = !DILocalVariable(name: "ecb", arg: 3, scope: !160, file: !1, line: 177, type: !214)
!233 = !DILocalVariable(name: "xecfg", arg: 4, scope: !160, file: !1, line: 178, type: !27)
!234 = !DILocalVariable(name: "s1", scope: !160, file: !1, line: 179, type: !5)
!235 = !DILocalVariable(name: "s2", scope: !160, file: !1, line: 179, type: !5)
!236 = !DILocalVariable(name: "e1", scope: !160, file: !1, line: 179, type: !5)
!237 = !DILocalVariable(name: "e2", scope: !160, file: !1, line: 179, type: !5)
!238 = !DILocalVariable(name: "lctx", scope: !160, file: !1, line: 179, type: !5)
!239 = !DILocalVariable(name: "xch", scope: !160, file: !1, line: 180, type: !13)
!240 = !DILocalVariable(name: "xche", scope: !160, file: !1, line: 180, type: !13)
!241 = !DILocalVariable(name: "func_line", scope: !160, file: !1, line: 184, type: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "func_line", file: !1, line: 136, size: 704, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !242, file: !1, line: 137, baseType: !5, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !242, file: !1, line: 138, baseType: !246, size: 640, offset: 64)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 640, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 80)
!249 = !DILocation(line: 177, column: 29, scope: !160)
!250 = !DILocation(line: 177, column: 45, scope: !160)
!251 = !DILocation(line: 177, column: 63, scope: !160)
!252 = !DILocation(line: 178, column: 25, scope: !160)
!253 = !DILocation(line: 180, column: 2, scope: !160)
!254 = !DILocation(line: 184, column: 2, scope: !160)
!255 = !DILocation(line: 186, column: 12, scope: !160)
!256 = !DILocation(line: 186, column: 16, scope: !160)
!257 = !{!258, !70, i64 0}
!258 = !{!"func_line", !70, i64 0, !71, i64 8}
!259 = !DILocation(line: 180, column: 14, scope: !160)
!260 = !DILocation(line: 188, column: 2, scope: !261)
!261 = distinct !DILexicalBlock(scope: !160, file: !1, line: 188, column: 2)
!262 = !DILocation(line: 189, column: 10, scope: !263)
!263 = distinct !DILexicalBlock(scope: !264, file: !1, line: 188, column: 42)
!264 = distinct !DILexicalBlock(scope: !261, file: !1, line: 188, column: 2)
!265 = !DILocation(line: 180, column: 20, scope: !160)
!266 = !DILocation(line: 190, column: 8, scope: !267)
!267 = distinct !DILexicalBlock(scope: !263, file: !1, line: 190, column: 7)
!268 = !DILocation(line: 190, column: 7, scope: !263)
!269 = !DILocation(line: 193, column: 8, scope: !263)
!270 = !DILocation(line: 179, column: 7, scope: !160)
!271 = !DILocation(line: 194, column: 8, scope: !263)
!272 = !{!89, !70, i64 16}
!273 = !DILocation(line: 179, column: 11, scope: !160)
!274 = !DILocation(line: 179, column: 23, scope: !160)
!275 = !DILocation(line: 236, column: 10, scope: !263)
!276 = !{!277, !70, i64 56}
!277 = !{!"s_xdfenv", !278, i64 0, !278, i64 136}
!278 = !{!"s_xdfile", !279, i64 0, !70, i64 56, !90, i64 64, !73, i64 72, !70, i64 80, !70, i64 88, !73, i64 96, !73, i64 104, !73, i64 112, !70, i64 120, !73, i64 128}
!279 = !{!"s_chastore", !73, i64 0, !73, i64 8, !70, i64 16, !70, i64 24, !73, i64 32, !73, i64 40, !70, i64 48}
!280 = !DILocation(line: 237, column: 10, scope: !263)
!281 = !{!277, !70, i64 192}
!282 = !DILocation(line: 179, column: 15, scope: !160)
!283 = !DILocation(line: 240, column: 30, scope: !263)
!284 = !DILocation(line: 179, column: 19, scope: !160)
!285 = !DILocation(line: 284, column: 28, scope: !286)
!286 = distinct !DILexicalBlock(scope: !263, file: !1, line: 284, column: 7)
!287 = !DILocation(line: 239, column: 30, scope: !263)
!288 = !DILocation(line: 284, column: 36, scope: !286)
!289 = !DILocation(line: 284, column: 45, scope: !286)
!290 = !DILocation(line: 284, column: 53, scope: !286)
!291 = !DILocation(line: 285, column: 36, scope: !286)
!292 = !DILocation(line: 284, column: 7, scope: !286)
!293 = !DILocation(line: 285, column: 46, scope: !286)
!294 = !DILocation(line: 284, column: 7, scope: !263)
!295 = !DILocation(line: 291, column: 20, scope: !296)
!296 = distinct !DILexicalBlock(scope: !297, file: !1, line: 291, column: 3)
!297 = distinct !DILexicalBlock(scope: !263, file: !1, line: 291, column: 3)
!298 = !DILocation(line: 291, column: 13, scope: !296)
!299 = !DILocation(line: 291, column: 3, scope: !297)
!300 = !DILocation(line: 27, column: 14, scope: !301, inlinedAt: !310)
!301 = distinct !DISubprogram(name: "xdl_get_rec", scope: !1, file: !1, line: 25, type: !302, isLocal: true, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !306)
!302 = !DISubroutineType(types: !303)
!303 = !{!5, !304, !5, !305}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!306 = !{!307, !308, !309}
!307 = !DILocalVariable(name: "xdf", arg: 1, scope: !301, file: !1, line: 25, type: !304)
!308 = !DILocalVariable(name: "ri", arg: 2, scope: !301, file: !1, line: 25, type: !5)
