; ModuleID = 'xdiff/xhistogram.c'
source_filename = "xdiff/xhistogram.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.s_mmfile = type { i8*, i64 }
%struct.s_xpparam = type { i64, i8**, i64 }
%struct.s_xdfenv = type { %struct.s_xdfile, %struct.s_xdfile }
%struct.s_xdfile = type { %struct.s_chastore, i64, i32, %struct.s_xrecord**, i64, i64, %struct.s_xrecord**, i8*, i64*, i64, i64* }
%struct.s_chastore = type { %struct.s_chanode*, %struct.s_chanode*, i64, i64, %struct.s_chanode*, %struct.s_chanode*, i64 }
%struct.s_chanode = type { %struct.s_chanode*, i64 }
%struct.s_xrecord = type { %struct.s_xrecord*, i8*, i64, i64 }
%struct.histindex = type { %struct.record**, %struct.record**, %struct.s_chastore, i32*, i32, i32, i32, i32, i32, i32, i32, i32, %struct.s_xdfenv*, %struct.s_xpparam* }
%struct.record = type { i32, i32, %struct.record* }
%struct.region = type { i32, i32, i32, i32 }

; Function Attrs: nounwind uwtable
define i32 @xdl_do_histogram_diff(%struct.s_mmfile*, %struct.s_mmfile*, %struct.s_xpparam*, %struct.s_xdfenv*) local_unnamed_addr #0 !dbg !19 {
  call void @llvm.dbg.value(metadata %struct.s_mmfile* %0, metadata !96, metadata !DIExpression()), !dbg !100
  call void @llvm.dbg.value(metadata %struct.s_mmfile* %1, metadata !97, metadata !DIExpression()), !dbg !101
  call void @llvm.dbg.value(metadata %struct.s_xpparam* %2, metadata !98, metadata !DIExpression()), !dbg !102

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 6.0.1-14 (tags/RELEASE_601/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "xdiff/xhistogram.c", directory: "/home/sahil/vim/src")
!2 = !{}
!3 = !{!4, !12, !13, !14}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "record", file: !1, line: 55, size: 128, elements: !7)
!7 = !{!8, !10, !11}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !6, file: !1, line: 56, baseType: !9, size: 32)
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !6, file: !1, line: 56, baseType: !9, size: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !6, file: !1, line: 57, baseType: !5, size: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!13 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !{i32 2, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!19 = distinct !DISubprogram(name: "xdl_do_histogram_diff", scope: !1, file: !1, line: 377, type: !20, isLocal: false, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !95)
!20 = !DISubroutineType(types: !21)
!21 = !{!14, !22, !22, !32, !43}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "mmfile_t", file: !24, line: 72, baseType: !25)
!24 = !DIFile(filename: "xdiff/xdiff.h", directory: "/home/sahil/vim/src")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_mmfile", file: !24, line: 69, size: 128, elements: !26)
!26 = !{!27, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !25, file: !24, line: 70, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !25, file: !24, line: 71, baseType: !31, size: 64, offset: 64)
!31 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "xpparam_t", file: !24, line: 85, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xpparam", file: !24, line: 79, size: 192, elements: !36)
!36 = !{!37, !38, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !35, file: !24, line: 80, baseType: !13, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !35, file: !24, line: 83, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "anchors_nr", scope: !35, file: !24, line: 84, baseType: !41, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 62, baseType: !13)
!42 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdfenv_t", file: !45, line: 63, baseType: !46)
!45 = !DIFile(filename: "xdiff/xtypes.h", directory: "/home/sahil/vim/src")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdfenv", file: !45, line: 61, size: 2176, elements: !47)
!47 = !{!48, !94}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "xdf1", scope: !46, file: !45, line: 62, baseType: !49, size: 1088)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdfile_t", file: !45, line: 59, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdfile", file: !45, line: 48, size: 1088, elements: !51)
!51 = !{!52, !70, !71, !72, !85, !86, !87, !88, !89, !91, !92}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "rcha", scope: !50, file: !45, line: 49, baseType: !53, size: 448)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "chastore_t", file: !45, line: 39, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_chastore", file: !45, line: 33, size: 448, elements: !55)
!55 = !{!56, !64, !65, !66, !67, !68, !69}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !54, file: !45, line: 34, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "chanode_t", file: !45, line: 31, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_chanode", file: !45, line: 28, size: 128, elements: !60)
!60 = !{!61, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !45, line: 29, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "icurr", scope: !59, file: !45, line: 30, baseType: !31, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !54, file: !45, line: 34, baseType: !57, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "isize", scope: !54, file: !45, line: 35, baseType: !31, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !54, file: !45, line: 35, baseType: !31, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ancur", scope: !54, file: !45, line: 36, baseType: !57, size: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sncur", scope: !54, file: !45, line: 37, baseType: !57, size: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "scurr", scope: !54, file: !45, line: 38, baseType: !31, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nrec", scope: !50, file: !45, line: 50, baseType: !31, size: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "hbits", scope: !50, file: !45, line: 51, baseType: !9, size: 32, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rhash", scope: !50, file: !45, line: 52, baseType: !73, size: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "xrecord_t", file: !45, line: 46, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xrecord", file: !45, line: 41, size: 256, elements: !77)
!77 = !{!78, !80, !83, !84}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !45, line: 42, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !76, file: !45, line: 43, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !76, file: !45, line: 44, baseType: !31, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ha", scope: !76, file: !45, line: 45, baseType: !13, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "dstart", scope: !50, file: !45, line: 53, baseType: !31, size: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "dend", scope: !50, file: !45, line: 53, baseType: !31, size: 64, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "recs", scope: !50, file: !45, line: 54, baseType: !73, size: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "rchg", scope: !50, file: !45, line: 55, baseType: !28, size: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !50, file: !45, line: 56, baseType: !90, size: 64, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "nreff", scope: !50, file: !45, line: 57, baseType: !31, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ha", scope: !50, file: !45, line: 58, baseType: !93, size: 64, offset: 1024)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "xdf2", scope: !46, file: !45, line: 62, baseType: !49, size: 1088, offset: 1088)
!95 = !{!96, !97, !98, !99}
!96 = !DILocalVariable(name: "file1", arg: 1, scope: !19, file: !1, line: 377, type: !22)
!97 = !DILocalVariable(name: "file2", arg: 2, scope: !19, file: !1, line: 377, type: !22)
!98 = !DILocalVariable(name: "xpp", arg: 3, scope: !19, file: !1, line: 378, type: !32)
!99 = !DILocalVariable(name: "env", arg: 4, scope: !19, file: !1, line: 378, type: !43)
!100 = !DILocation(line: 377, column: 37, scope: !19)
!101 = !DILocation(line: 377, column: 54, scope: !19)
!102 = !DILocation(line: 378, column: 19, scope: !19)
!103 = !DILocation(line: 378, column: 34, scope: !19)
!104 = !DILocation(line: 380, column: 6, scope: !105)
!105 = distinct !DILexicalBlock(scope: !19, file: !1, line: 380, column: 6)
!106 = !DILocation(line: 380, column: 46, scope: !105)
!107 = !DILocation(line: 380, column: 6, scope: !19)
!108 = !DILocation(line: 384, column: 13, scope: !19)
!109 = !{!110, !116, i64 80}
!110 = !{!"s_xdfenv", !111, i64 0, !111, i64 136}
!111 = !{!"s_xdfile", !112, i64 0, !116, i64 56, !117, i64 64, !113, i64 72, !116, i64 80, !116, i64 88, !113, i64 96, !113, i64 104, !113, i64 112, !116, i64 120, !113, i64 128}
!112 = !{!"s_chastore", !113, i64 0, !113, i64 8, !116, i64 16, !116, i64 24, !113, i64 32, !113, i64 40, !116, i64 48}
!113 = !{!"any pointer", !114, i64 0}
!114 = !{!"omnipotent char", !115, i64 0}
!115 = !{!"Simple C/C++ TBAA"}
!116 = !{!"long", !114, i64 0}
!117 = !{!"int", !114, i64 0}
!118 = !DILocation(line: 384, column: 3, scope: !19)
!119 = !DILocation(line: 384, column: 35, scope: !19)
!120 = !{!110, !116, i64 88}
!121 = !DILocation(line: 384, column: 40, scope: !19)
!122 = !DILocation(line: 384, column: 25, scope: !19)
!123 = !DILocation(line: 385, column: 13, scope: !19)
!124 = !{!110, !116, i64 216}
!125 = !DILocation(line: 385, column: 3, scope: !19)
!126 = !DILocation(line: 385, column: 35, scope: !19)
!127 = !{!110, !116, i64 224}
!128 = !DILocation(line: 385, column: 40, scope: !19)
!129 = !DILocation(line: 385, column: 25, scope: !19)
!130 = !DILocation(line: 383, column: 9, scope: !19)
!131 = !DILocation(line: 383, column: 2, scope: !19)
!132 = !DILocation(line: 386, column: 1, scope: !19)
!133 = distinct !DISubprogram(name: "histogram_diff", scope: !1, file: !1, line: 316, type: !134, isLocal: true, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !136)
!134 = !DISubroutineType(types: !135)
!135 = !{!14, !32, !43, !14, !14, !14, !14}
!136 = !{!137, !138, !139, !140, !141, !142, !143, !150, !151}
!137 = !DILocalVariable(name: "xpp", arg: 1, scope: !133, file: !1, line: 316, type: !32)
!138 = !DILocalVariable(name: "env", arg: 2, scope: !133, file: !1, line: 316, type: !43)
!139 = !DILocalVariable(name: "line1", arg: 3, scope: !133, file: !1, line: 317, type: !14)
!140 = !DILocalVariable(name: "count1", arg: 4, scope: !133, file: !1, line: 317, type: !14)
!141 = !DILocalVariable(name: "line2", arg: 5, scope: !133, file: !1, line: 317, type: !14)
!142 = !DILocalVariable(name: "count2", arg: 6, scope: !133, file: !1, line: 317, type: !14)
!143 = !DILocalVariable(name: "lcs", scope: !133, file: !1, line: 319, type: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "region", file: !1, line: 77, size: 128, elements: !145)
!145 = !{!146, !147, !148, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "begin1", scope: !144, file: !1, line: 78, baseType: !9, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "end1", scope: !144, file: !1, line: 78, baseType: !9, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "begin2", scope: !144, file: !1, line: 79, baseType: !9, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "end2", scope: !144, file: !1, line: 79, baseType: !9, size: 32, offset: 96)
!150 = !DILocalVariable(name: "lcs_found", scope: !133, file: !1, line: 320, type: !14)
!151 = !DILocalVariable(name: "result", scope: !133, file: !1, line: 321, type: !14)
!152 = !DILocation(line: 316, column: 44, scope: !133)
!153 = !DILocation(line: 316, column: 59, scope: !133)
!154 = !DILocation(line: 317, column: 6, scope: !133)
!155 = !DILocation(line: 317, column: 17, scope: !133)
!156 = !DILocation(line: 317, column: 29, scope: !133)
!157 = !DILocation(line: 317, column: 40, scope: !133)
!158 = !DILocation(line: 321, column: 6, scope: !133)
!159 = !DILocation(line: 325, column: 13, scope: !160)
!160 = distinct !DILexicalBlock(scope: !133, file: !1, line: 325, column: 6)
!161 = !DILocation(line: 325, column: 28, scope: !160)
!162 = !DILocation(line: 325, column: 18, scope: !160)
!163 = !DILocation(line: 328, column: 6, scope: !164)
!164 = distinct !DILexicalBlock(scope: !133, file: !1, line: 328, column: 6)
!165 = !DILocation(line: 331, column: 7, scope: !166)
!166 = distinct !DILexicalBlock(scope: !133, file: !1, line: 331, column: 6)
!167 = !DILocation(line: 331, column: 6, scope: !133)
!168 = !DILocation(line: 332, column: 3, scope: !169)
!169 = distinct !DILexicalBlock(scope: !166, file: !1, line: 331, column: 15)
!170 = !DILocation(line: 332, column: 15, scope: !169)
!171 = !DILocation(line: 333, column: 14, scope: !169)
!172 = !{!110, !113, i64 240}
!173 = !DILocation(line: 333, column: 24, scope: !169)
!174 = !DILocation(line: 333, column: 27, scope: !169)
!175 = !DILocation(line: 333, column: 4, scope: !169)
!176 = !DILocation(line: 333, column: 32, scope: !169)
!177 = !{!114, !114, i64 0}
!178 = distinct !{!178, !179}
!179 = !{!"llvm.loop.unroll.disable"}
!180 = distinct !{!180, !168, !181}
!181 = !DILocation(line: 333, column: 34, scope: !169)
!182 = !DILocation(line: 335, column: 13, scope: !166)
!183 = !DILocation(line: 336, column: 3, scope: !184)
!184 = distinct !DILexicalBlock(scope: !185, file: !1, line: 335, column: 22)
!185 = distinct !DILexicalBlock(scope: !166, file: !1, line: 335, column: 13)
!186 = !DILocation(line: 336, column: 15, scope: !184)
!187 = !DILocation(line: 337, column: 14, scope: !184)
!188 = !{!110, !113, i64 104}
!189 = !DILocation(line: 337, column: 24, scope: !184)
!190 = !DILocation(line: 337, column: 27, scope: !184)
!191 = !DILocation(line: 337, column: 4, scope: !184)
!192 = !DILocation(line: 337, column: 32, scope: !184)
!193 = distinct !{!193, !179}
!194 = distinct !{!194, !183, !195}
!195 = !DILocation(line: 337, column: 34, scope: !184)
!196 = !DILocation(line: 319, column: 16, scope: !133)
!197 = !DILocalVariable(name: "xpp", arg: 1, scope: !198, file: !1, line: 254, type: !32)
!198 = distinct !DISubprogram(name: "find_lcs", scope: !1, file: !1, line: 254, type: !199, isLocal: true, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !202)
!199 = !DISubroutineType(types: !200)
!200 = !{!14, !32, !43, !201, !14, !14, !14, !14}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!202 = !{!197, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!203 = !DILocalVariable(name: "env", arg: 2, scope: !198, file: !1, line: 254, type: !43)
!204 = !DILocalVariable(name: "lcs", arg: 3, scope: !198, file: !1, line: 255, type: !201)
!205 = !DILocalVariable(name: "line1", arg: 4, scope: !198, file: !1, line: 256, type: !14)
!206 = !DILocalVariable(name: "count1", arg: 5, scope: !198, file: !1, line: 256, type: !14)
!207 = !DILocalVariable(name: "line2", arg: 6, scope: !198, file: !1, line: 256, type: !14)
!208 = !DILocalVariable(name: "count2", arg: 7, scope: !198, file: !1, line: 256, type: !14)
!209 = !DILocalVariable(name: "b_ptr", scope: !198, file: !1, line: 258, type: !14)
!210 = !DILocalVariable(name: "sz", scope: !198, file: !1, line: 259, type: !14)
!211 = !DILocalVariable(name: "ret", scope: !198, file: !1, line: 259, type: !14)
!212 = !DILocalVariable(name: "index", scope: !198, file: !1, line: 260, type: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "histindex", file: !1, line: 54, size: 1024, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !213, file: !1, line: 58, baseType: !4, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "line_map", scope: !213, file: !1, line: 59, baseType: !4, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "rcha", scope: !213, file: !1, line: 60, baseType: !53, size: 448, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next_ptrs", scope: !213, file: !1, line: 61, baseType: !12, size: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "table_bits", scope: !213, file: !1, line: 62, baseType: !9, size: 32, offset: 640)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "records_size", scope: !213, file: !1, line: 63, baseType: !9, size: 32, offset: 672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "line_map_size", scope: !213, file: !1, line: 64, baseType: !9, size: 32, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "max_chain_length", scope: !213, file: !1, line: 66, baseType: !9, size: 32, offset: 736)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "key_shift", scope: !213, file: !1, line: 67, baseType: !9, size: 32, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_shift", scope: !213, file: !1, line: 68, baseType: !9, size: 32, offset: 800)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !213, file: !1, line: 70, baseType: !9, size: 32, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "has_common", scope: !213, file: !1, line: 71, baseType: !9, size: 32, offset: 864)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !213, file: !1, line: 73, baseType: !43, size: 64, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "xpp", scope: !213, file: !1, line: 74, baseType: !32, size: 64, offset: 960)
!229 = !DILocation(line: 254, column: 38, scope: !198, inlinedAt: !230)
!230 = distinct !DILocation(line: 342, column: 14, scope: !133)
!231 = !DILocation(line: 254, column: 53, scope: !198, inlinedAt: !230)
!232 = !DILocation(line: 255, column: 22, scope: !198, inlinedAt: !230)
!233 = !DILocation(line: 256, column: 11, scope: !198, inlinedAt: !230)
!234 = !DILocation(line: 256, column: 22, scope: !198, inlinedAt: !230)
!235 = !DILocation(line: 256, column: 34, scope: !198, inlinedAt: !230)
!236 = !DILocation(line: 256, column: 45, scope: !198, inlinedAt: !230)
!237 = !DILocation(line: 259, column: 10, scope: !198, inlinedAt: !230)
!238 = !DILocation(line: 260, column: 2, scope: !198, inlinedAt: !230)
!239 = !DILocation(line: 262, column: 2, scope: !198, inlinedAt: !230)
!240 = !DILocation(line: 264, column: 12, scope: !198, inlinedAt: !230)
!241 = !{!242, !113, i64 112}
!242 = !{!"histindex", !113, i64 0, !113, i64 8, !112, i64 16, !113, i64 72, !117, i64 80, !117, i64 84, !117, i64 88, !117, i64 92, !117, i64 96, !117, i64 100, !117, i64 104, !117, i64 108, !113, i64 112, !113, i64 120}
!243 = !DILocation(line: 265, column: 12, scope: !198, inlinedAt: !230)
!244 = !{!242, !113, i64 120}
!245 = !DILocation(line: 268, column: 17, scope: !198, inlinedAt: !230)
!246 = !DILocation(line: 272, column: 21, scope: !198, inlinedAt: !230)
!247 = !DILocation(line: 272, column: 19, scope: !198, inlinedAt: !230)
!248 = !{!242, !117, i64 80}
!249 = !DILocation(line: 273, column: 30, scope: !198, inlinedAt: !230)
!250 = !DILocation(line: 273, column: 26, scope: !198, inlinedAt: !230)
!251 = !{!242, !117, i64 84}
!252 = !DILocation(line: 259, column: 6, scope: !198, inlinedAt: !230)
!253 = !DILocation(line: 274, column: 5, scope: !198, inlinedAt: !230)
!254 = !DILocation(line: 275, column: 43, scope: !255, inlinedAt: !230)
!255 = distinct !DILexicalBlock(scope: !198, file: !1, line: 275, column: 6)
!256 = !DILocation(line: 275, column: 22, scope: !255, inlinedAt: !230)
!257 = !{!242, !113, i64 0}
!258 = !DILocation(line: 275, column: 6, scope: !198, inlinedAt: !230)
!259 = !DILocation(line: 277, column: 2, scope: !198, inlinedAt: !230)
!260 = !DILocation(line: 279, column: 27, scope: !198, inlinedAt: !230)
!261 = !{!242, !117, i64 88}
!262 = !DILocation(line: 280, column: 5, scope: !198, inlinedAt: !230)
!263 = !DILocation(line: 281, column: 44, scope: !264, inlinedAt: !230)
!264 = distinct !DILexicalBlock(scope: !198, file: !1, line: 281, column: 6)
!265 = !DILocation(line: 281, column: 23, scope: !264, inlinedAt: !230)
!266 = !{!242, !113, i64 8}
!267 = !DILocation(line: 281, column: 6, scope: !198, inlinedAt: !230)
!268 = !DILocation(line: 283, column: 2, scope: !198, inlinedAt: !230)
!269 = !DILocation(line: 286, column: 5, scope: !198, inlinedAt: !230)
!270 = !DILocation(line: 287, column: 43, scope: !271, inlinedAt: !230)
!271 = distinct !DILexicalBlock(scope: !198, file: !1, line: 287, column: 6)
!272 = !DILocation(line: 287, column: 24, scope: !271, inlinedAt: !230)
!273 = !{!242, !113, i64 72}
!274 = !DILocation(line: 287, column: 6, scope: !198, inlinedAt: !230)
!275 = !DILocation(line: 289, column: 2, scope: !198, inlinedAt: !230)
!276 = !DILocation(line: 292, column: 62, scope: !277, inlinedAt: !230)
!277 = distinct !DILexicalBlock(scope: !198, file: !1, line: 292, column: 6)
!278 = !DILocation(line: 292, column: 66, scope: !277, inlinedAt: !230)
!279 = !DILocation(line: 292, column: 55, scope: !277, inlinedAt: !230)
!280 = !DILocation(line: 292, column: 6, scope: !277, inlinedAt: !230)
!281 = !DILocation(line: 292, column: 71, scope: !277, inlinedAt: !230)
!282 = !DILocation(line: 292, column: 6, scope: !198, inlinedAt: !230)
!283 = !DILocation(line: 295, column: 18, scope: !198, inlinedAt: !230)
!284 = !{!242, !117, i64 100}
!285 = !DILocation(line: 296, column: 25, scope: !198, inlinedAt: !230)
!286 = !{!242, !117, i64 92}
