; ModuleID = 'xdiff/xpatience.c'
source_filename = "xdiff/xpatience.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.s_mmfile = type { i8*, i64 }
%struct.s_xpparam = type { i64, i8**, i64 }
%struct.s_xdfenv = type { %struct.s_xdfile, %struct.s_xdfile }
%struct.s_xdfile = type { %struct.s_chastore, i64, i32, %struct.s_xrecord**, i64, i64, %struct.s_xrecord**, i8*, i64*, i64, i64* }
%struct.s_chastore = type { %struct.s_chanode*, %struct.s_chanode*, i64, i64, %struct.s_chanode*, %struct.s_chanode*, i64 }
%struct.s_chanode = type { %struct.s_chanode*, i64 }
%struct.s_xrecord = type { %struct.s_xrecord*, i8*, i64, i64 }
%struct.hashmap = type { i32, i32, %struct.entry*, %struct.entry*, %struct.entry*, i64, %struct.s_mmfile*, %struct.s_mmfile*, %struct.s_xdfenv*, %struct.s_xpparam* }
%struct.entry = type { i64, i64, i64, %struct.entry*, %struct.entry*, i8 }

; Function Attrs: nounwind uwtable
define i32 @xdl_do_patience_diff(%struct.s_mmfile*, %struct.s_mmfile*, %struct.s_xpparam*, %struct.s_xdfenv*) local_unnamed_addr #0 !dbg !22 {
  call void @llvm.dbg.value(metadata %struct.s_mmfile* %0, metadata !99, metadata !DIExpression()), !dbg !103
  call void @llvm.dbg.value(metadata %struct.s_mmfile* %1, metadata !100, metadata !DIExpression()), !dbg !104
  call void @llvm.dbg.value(metadata %struct.s_xpparam* %2, metadata !101, metadata !DIExpression()), !dbg !105

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 6.0.1-14 (tags/RELEASE_601/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "xdiff/xpatience.c", directory: "/home/sahil/vim/src")
!2 = !{}
!3 = !{!4, !15, !16, !17}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "entry", file: !1, line: 51, size: 384, elements: !6)
!6 = !{!7, !9, !10, !11, !12, !13}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !5, file: !1, line: 52, baseType: !8, size: 64)
!8 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "line1", scope: !5, file: !1, line: 58, baseType: !8, size: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "line2", scope: !5, file: !1, line: 58, baseType: !8, size: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !5, file: !1, line: 64, baseType: !4, size: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !5, file: !1, line: 64, baseType: !4, size: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "anchor", scope: !5, file: !1, line: 70, baseType: !14, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !{i32 2, !"Dwarf Version", i32 4}
!19 = !{i32 2, !"Debug Info Version", i32 3}
!20 = !{i32 1, !"wchar_size", i32 4}
!21 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!22 = distinct !DISubprogram(name: "xdl_do_patience_diff", scope: !1, file: !1, line: 384, type: !23, isLocal: false, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !98)
!23 = !DISubroutineType(types: !24)
!24 = !{!15, !25, !25, !35, !46}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "mmfile_t", file: !27, line: 72, baseType: !28)
!27 = !DIFile(filename: "xdiff/xdiff.h", directory: "/home/sahil/vim/src")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_mmfile", file: !27, line: 69, size: 128, elements: !29)
!29 = !{!30, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !28, file: !27, line: 70, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !28, file: !27, line: 71, baseType: !34, size: 64, offset: 64)
!34 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "xpparam_t", file: !27, line: 85, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xpparam", file: !27, line: 79, size: 192, elements: !39)
!39 = !{!40, !41, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !38, file: !27, line: 80, baseType: !8, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !38, file: !27, line: 83, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "anchors_nr", scope: !38, file: !27, line: 84, baseType: !44, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 62, baseType: !8)
!45 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdfenv_t", file: !48, line: 63, baseType: !49)
!48 = !DIFile(filename: "xdiff/xtypes.h", directory: "/home/sahil/vim/src")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdfenv", file: !48, line: 61, size: 2176, elements: !50)
!50 = !{!51, !97}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "xdf1", scope: !49, file: !48, line: 62, baseType: !52, size: 1088)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdfile_t", file: !48, line: 59, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdfile", file: !48, line: 48, size: 1088, elements: !54)
!54 = !{!55, !73, !74, !75, !88, !89, !90, !91, !92, !94, !95}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "rcha", scope: !53, file: !48, line: 49, baseType: !56, size: 448)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "chastore_t", file: !48, line: 39, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_chastore", file: !48, line: 33, size: 448, elements: !58)
!58 = !{!59, !67, !68, !69, !70, !71, !72}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !57, file: !48, line: 34, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "chanode_t", file: !48, line: 31, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_chanode", file: !48, line: 28, size: 128, elements: !63)
!63 = !{!64, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !62, file: !48, line: 29, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "icurr", scope: !62, file: !48, line: 30, baseType: !34, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !57, file: !48, line: 34, baseType: !60, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "isize", scope: !57, file: !48, line: 35, baseType: !34, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !57, file: !48, line: 35, baseType: !34, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ancur", scope: !57, file: !48, line: 36, baseType: !60, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "sncur", scope: !57, file: !48, line: 37, baseType: !60, size: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "scurr", scope: !57, file: !48, line: 38, baseType: !34, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nrec", scope: !53, file: !48, line: 50, baseType: !34, size: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "hbits", scope: !53, file: !48, line: 51, baseType: !14, size: 32, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "rhash", scope: !53, file: !48, line: 52, baseType: !76, size: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "xrecord_t", file: !48, line: 46, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xrecord", file: !48, line: 41, size: 256, elements: !80)
!80 = !{!81, !83, !86, !87}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !48, line: 42, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !79, file: !48, line: 43, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !79, file: !48, line: 44, baseType: !34, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ha", scope: !79, file: !48, line: 45, baseType: !8, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dstart", scope: !53, file: !48, line: 53, baseType: !34, size: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dend", scope: !53, file: !48, line: 53, baseType: !34, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "recs", scope: !53, file: !48, line: 54, baseType: !76, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "rchg", scope: !53, file: !48, line: 55, baseType: !31, size: 64, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !53, file: !48, line: 56, baseType: !93, size: 64, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "nreff", scope: !53, file: !48, line: 57, baseType: !34, size: 64, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ha", scope: !53, file: !48, line: 58, baseType: !96, size: 64, offset: 1024)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "xdf2", scope: !49, file: !48, line: 62, baseType: !52, size: 1088, offset: 1088)
!98 = !{!99, !100, !101, !102}
!99 = !DILocalVariable(name: "file1", arg: 1, scope: !22, file: !1, line: 384, type: !25)
!100 = !DILocalVariable(name: "file2", arg: 2, scope: !22, file: !1, line: 384, type: !25)
!101 = !DILocalVariable(name: "xpp", arg: 3, scope: !22, file: !1, line: 385, type: !35)
!102 = !DILocalVariable(name: "env", arg: 4, scope: !22, file: !1, line: 385, type: !46)
!103 = !DILocation(line: 384, column: 36, scope: !22)
!104 = !DILocation(line: 384, column: 53, scope: !22)
!105 = !DILocation(line: 385, column: 20, scope: !22)
!106 = !DILocation(line: 385, column: 35, scope: !22)
!107 = !DILocation(line: 387, column: 6, scope: !108)
!108 = distinct !DILexicalBlock(scope: !22, file: !1, line: 387, column: 6)
!109 = !DILocation(line: 387, column: 46, scope: !108)
!110 = !DILocation(line: 387, column: 6, scope: !22)
!111 = !DILocation(line: 392, column: 17, scope: !22)
!112 = !{!113, !119, i64 56}
!113 = !{!"s_xdfenv", !114, i64 0, !114, i64 136}
!114 = !{!"s_xdfile", !115, i64 0, !119, i64 56, !120, i64 64, !116, i64 72, !119, i64 80, !119, i64 88, !116, i64 96, !116, i64 104, !116, i64 112, !119, i64 120, !116, i64 128}
!115 = !{!"s_chastore", !116, i64 0, !116, i64 8, !119, i64 16, !119, i64 24, !116, i64 32, !116, i64 40, !119, i64 48}
!116 = !{!"any pointer", !117, i64 0}
!117 = !{!"omnipotent char", !118, i64 0}
!118 = !{!"Simple C/C++ TBAA"}
!119 = !{!"long", !117, i64 0}
!120 = !{!"int", !117, i64 0}
!121 = !DILocation(line: 392, column: 7, scope: !22)
!122 = !DILocation(line: 392, column: 36, scope: !22)
!123 = !{!113, !119, i64 192}
!124 = !DILocation(line: 392, column: 26, scope: !22)
!125 = !DILocation(line: 391, column: 9, scope: !22)
!126 = !DILocation(line: 391, column: 2, scope: !22)
!127 = !DILocation(line: 393, column: 1, scope: !22)
!128 = distinct !DISubprogram(name: "patience_diff", scope: !1, file: !1, line: 338, type: !129, isLocal: true, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !131)
!129 = !DISubroutineType(types: !130)
!130 = !{!15, !25, !25, !35, !46, !15, !15, !15, !15}
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !153, !154}
!132 = !DILocalVariable(name: "file1", arg: 1, scope: !128, file: !1, line: 338, type: !25)
!133 = !DILocalVariable(name: "file2", arg: 2, scope: !128, file: !1, line: 338, type: !25)
!134 = !DILocalVariable(name: "xpp", arg: 3, scope: !128, file: !1, line: 339, type: !35)
!135 = !DILocalVariable(name: "env", arg: 4, scope: !128, file: !1, line: 339, type: !46)
!136 = !DILocalVariable(name: "line1", arg: 5, scope: !128, file: !1, line: 340, type: !15)
!137 = !DILocalVariable(name: "count1", arg: 6, scope: !128, file: !1, line: 340, type: !15)
!138 = !DILocalVariable(name: "line2", arg: 7, scope: !128, file: !1, line: 340, type: !15)
!139 = !DILocalVariable(name: "count2", arg: 8, scope: !128, file: !1, line: 340, type: !15)
!140 = !DILocalVariable(name: "map", scope: !128, file: !1, line: 342, type: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashmap", file: !1, line: 49, size: 576, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !141, file: !1, line: 50, baseType: !15, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !141, file: !1, line: 50, baseType: !15, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !141, file: !1, line: 71, baseType: !4, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !141, file: !1, line: 71, baseType: !4, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !141, file: !1, line: 71, baseType: !4, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "has_matches", scope: !141, file: !1, line: 73, baseType: !8, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "file1", scope: !141, file: !1, line: 74, baseType: !25, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "file2", scope: !141, file: !1, line: 74, baseType: !25, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !141, file: !1, line: 75, baseType: !46, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "xpp", scope: !141, file: !1, line: 76, baseType: !35, size: 64, offset: 512)
!153 = !DILocalVariable(name: "first", scope: !128, file: !1, line: 343, type: !4)
!154 = !DILocalVariable(name: "result", scope: !128, file: !1, line: 344, type: !15)
!155 = !DILocation(line: 338, column: 36, scope: !128)
!156 = !DILocation(line: 338, column: 53, scope: !128)
!157 = !DILocation(line: 339, column: 20, scope: !128)
!158 = !DILocation(line: 339, column: 35, scope: !128)
!159 = !DILocation(line: 340, column: 7, scope: !128)
!160 = !DILocation(line: 340, column: 18, scope: !128)
!161 = !DILocation(line: 340, column: 30, scope: !128)
!162 = !DILocation(line: 340, column: 41, scope: !128)
!163 = !DILocation(line: 344, column: 6, scope: !128)
!164 = !DILocation(line: 347, column: 7, scope: !165)
!165 = distinct !DILexicalBlock(scope: !128, file: !1, line: 347, column: 6)
!166 = !DILocation(line: 347, column: 6, scope: !128)
!167 = !DILocation(line: 348, column: 3, scope: !168)
!168 = distinct !DILexicalBlock(scope: !165, file: !1, line: 347, column: 15)
!169 = !DILocation(line: 348, column: 15, scope: !168)
!170 = !DILocation(line: 349, column: 14, scope: !168)
!171 = !{!113, !116, i64 240}
!172 = !DILocation(line: 349, column: 24, scope: !168)
!173 = !DILocation(line: 349, column: 27, scope: !168)
!174 = !DILocation(line: 349, column: 4, scope: !168)
!175 = !DILocation(line: 349, column: 32, scope: !168)
!176 = !{!117, !117, i64 0}
!177 = distinct !{!177, !178}
!178 = !{!"llvm.loop.unroll.disable"}
!179 = distinct !{!179, !167, !180}
!180 = !DILocation(line: 349, column: 34, scope: !168)
!181 = !DILocation(line: 351, column: 13, scope: !165)
!182 = !DILocation(line: 352, column: 3, scope: !183)
!183 = distinct !DILexicalBlock(scope: !184, file: !1, line: 351, column: 22)
!184 = distinct !DILexicalBlock(scope: !165, file: !1, line: 351, column: 13)
!185 = !DILocation(line: 352, column: 15, scope: !183)
!186 = !DILocation(line: 353, column: 14, scope: !183)
!187 = !{!113, !116, i64 104}
!188 = !DILocation(line: 353, column: 24, scope: !183)
!189 = !DILocation(line: 353, column: 27, scope: !183)
!190 = !DILocation(line: 353, column: 4, scope: !183)
!191 = !DILocation(line: 353, column: 32, scope: !183)
!192 = distinct !{!192, !178}
!193 = distinct !{!193, !182, !194}
!194 = !DILocation(line: 353, column: 34, scope: !183)
!195 = !DILocation(line: 342, column: 17, scope: !128)
!196 = !DILocalVariable(name: "file1", arg: 1, scope: !197, file: !1, line: 148, type: !25)
!197 = distinct !DISubprogram(name: "fill_hashmap", scope: !1, file: !1, line: 148, type: !198, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !201)
!198 = !DISubroutineType(types: !199)
!199 = !{!15, !25, !25, !35, !46, !200, !15, !15, !15, !15}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!201 = !{!196, !202, !203, !204, !205, !206, !207, !208, !209}
!202 = !DILocalVariable(name: "file2", arg: 2, scope: !197, file: !1, line: 148, type: !25)
!203 = !DILocalVariable(name: "xpp", arg: 3, scope: !197, file: !1, line: 149, type: !35)
!204 = !DILocalVariable(name: "env", arg: 4, scope: !197, file: !1, line: 149, type: !46)
!205 = !DILocalVariable(name: "result", arg: 5, scope: !197, file: !1, line: 150, type: !200)
!206 = !DILocalVariable(name: "line1", arg: 6, scope: !197, file: !1, line: 151, type: !15)
!207 = !DILocalVariable(name: "count1", arg: 7, scope: !197, file: !1, line: 151, type: !15)
!208 = !DILocalVariable(name: "line2", arg: 8, scope: !197, file: !1, line: 151, type: !15)
!209 = !DILocalVariable(name: "count2", arg: 9, scope: !197, file: !1, line: 151, type: !15)
!210 = !DILocation(line: 148, column: 35, scope: !197, inlinedAt: !211)
!211 = distinct !DILocation(line: 358, column: 6, scope: !212)
!212 = distinct !DILexicalBlock(scope: !128, file: !1, line: 358, column: 6)
!213 = !DILocation(line: 148, column: 52, scope: !197, inlinedAt: !211)
