; ModuleID = 'xdiff/xprepare.c'
source_filename = "xdiff/xprepare.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.s_mmfile = type { i8*, i64 }
%struct.s_xpparam = type { i64, i8**, i64 }
%struct.s_xdfenv = type { %struct.s_xdfile, %struct.s_xdfile }
%struct.s_xdfile = type { %struct.s_chastore, i64, i32, %struct.s_xrecord**, i64, i64, %struct.s_xrecord**, i8*, i64*, i64, i64* }
%struct.s_chastore = type { %struct.s_chanode*, %struct.s_chanode*, i64, i64, %struct.s_chanode*, %struct.s_chanode*, i64 }
%struct.s_chanode = type { %struct.s_chanode*, i64 }
%struct.s_xrecord = type { %struct.s_xrecord*, i8*, i64, i64 }
%struct.s_xdlclassifier = type { i32, i64, %struct.s_xdlclass**, %struct.s_chastore, %struct.s_xdlclass**, i64, i64, i64 }
%struct.s_xdlclass = type { %struct.s_xdlclass*, i64, i8*, i64, i64, i64, i64 }

; Function Attrs: nounwind uwtable
define i32 @xdl_prepare_env(%struct.s_mmfile*, %struct.s_mmfile*, %struct.s_xpparam* nocapture readonly, %struct.s_xdfenv*) local_unnamed_addr #0 !dbg !42 {
  %5 = alloca %struct.s_xdlclassifier, align 8
  call void @llvm.dbg.value(metadata %struct.s_mmfile* %0, metadata !102, metadata !DIExpression()), !dbg !121
  call void @llvm.dbg.value(metadata %struct.s_mmfile* %1, metadata !103, metadata !DIExpression()), !dbg !122
  call void @llvm.dbg.value(metadata %struct.s_xpparam* %2, metadata !104, metadata !DIExpression()), !dbg !123

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 6.0.1-14 (tags/RELEASE_601/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "xdiff/xprepare.c", directory: "/home/sahil/vim/src")
!2 = !{}
!3 = !{!4, !5, !23, !34, !19, !35, !36, !37, !13}
!4 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdlclass_t", file: !1, line: 40, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdlclass", file: !1, line: 33, size: 448, elements: !9)
!9 = !{!10, !12, !14, !18, !20, !21, !22}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !8, file: !1, line: 34, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ha", scope: !8, file: !1, line: 35, baseType: !13, size: 64, offset: 64)
!13 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !8, file: !1, line: 36, baseType: !15, size: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !8, file: !1, line: 37, baseType: !19, size: 64, offset: 192)
!19 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !8, file: !1, line: 38, baseType: !19, size: 64, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "len1", scope: !8, file: !1, line: 39, baseType: !19, size: 64, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "len2", scope: !8, file: !1, line: 39, baseType: !19, size: 64, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "xrecord_t", file: !26, line: 46, baseType: !27)
!26 = !DIFile(filename: "xdiff/xtypes.h", directory: "/home/sahil/vim/src")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xrecord", file: !26, line: 41, size: 256, elements: !28)
!28 = !{!29, !31, !32, !33}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !26, line: 42, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !26, line: 43, baseType: !15, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !27, file: !26, line: 44, baseType: !19, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ha", scope: !27, file: !26, line: 45, baseType: !13, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!38 = !{i32 2, !"Dwarf Version", i32 4}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{!"clang version 6.0.1-14 (tags/RELEASE_601/final)"}
!42 = distinct !DISubprogram(name: "xdl_prepare_env", scope: !1, file: !1, line: 262, type: !43, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !101)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !46, !46, !53, !64}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "mmfile_t", file: !48, line: 72, baseType: !49)
!48 = !DIFile(filename: "xdiff/xdiff.h", directory: "/home/sahil/vim/src")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_mmfile", file: !48, line: 69, size: 128, elements: !50)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, file: !48, line: 70, baseType: !35, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !49, file: !48, line: 71, baseType: !19, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "xpparam_t", file: !48, line: 85, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xpparam", file: !48, line: 79, size: 192, elements: !57)
!57 = !{!58, !59, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !48, line: 80, baseType: !13, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !56, file: !48, line: 83, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "anchors_nr", scope: !56, file: !48, line: 84, baseType: !62, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 62, baseType: !13)
!63 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.1/include/stddef.h", directory: "/home/sahil/vim/src")
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdfenv_t", file: !26, line: 63, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdfenv", file: !26, line: 61, size: 2176, elements: !67)
!67 = !{!68, !100}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "xdf1", scope: !66, file: !26, line: 62, baseType: !69, size: 1088)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdfile_t", file: !26, line: 59, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdfile", file: !26, line: 48, size: 1088, elements: !71)
!71 = !{!72, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rcha", scope: !70, file: !26, line: 49, baseType: !73, size: 448)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "chastore_t", file: !26, line: 39, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_chastore", file: !26, line: 33, size: 448, elements: !75)
!75 = !{!76, !84, !85, !86, !87, !88, !89}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !74, file: !26, line: 34, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "chanode_t", file: !26, line: 31, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_chanode", file: !26, line: 28, size: 128, elements: !80)
!80 = !{!81, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !26, line: 29, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "icurr", scope: !79, file: !26, line: 30, baseType: !19, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !74, file: !26, line: 34, baseType: !77, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "isize", scope: !74, file: !26, line: 35, baseType: !19, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !74, file: !26, line: 35, baseType: !19, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ancur", scope: !74, file: !26, line: 36, baseType: !77, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "sncur", scope: !74, file: !26, line: 37, baseType: !77, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "scurr", scope: !74, file: !26, line: 38, baseType: !19, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "nrec", scope: !70, file: !26, line: 50, baseType: !19, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "hbits", scope: !70, file: !26, line: 51, baseType: !4, size: 32, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rhash", scope: !70, file: !26, line: 52, baseType: !23, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "dstart", scope: !70, file: !26, line: 53, baseType: !19, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dend", scope: !70, file: !26, line: 53, baseType: !19, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "recs", scope: !70, file: !26, line: 54, baseType: !23, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "rchg", scope: !70, file: !26, line: 55, baseType: !35, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !70, file: !26, line: 56, baseType: !36, size: 64, offset: 896)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nreff", scope: !70, file: !26, line: 57, baseType: !19, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ha", scope: !70, file: !26, line: 58, baseType: !37, size: 64, offset: 1024)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "xdf2", scope: !66, file: !26, line: 62, baseType: !69, size: 1088, offset: 1088)
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109}
!102 = !DILocalVariable(name: "mf1", arg: 1, scope: !42, file: !1, line: 262, type: !46)
!103 = !DILocalVariable(name: "mf2", arg: 2, scope: !42, file: !1, line: 262, type: !46)
!104 = !DILocalVariable(name: "xpp", arg: 3, scope: !42, file: !1, line: 262, type: !53)
!105 = !DILocalVariable(name: "xe", arg: 4, scope: !42, file: !1, line: 263, type: !64)
!106 = !DILocalVariable(name: "enl1", scope: !42, file: !1, line: 264, type: !19)
!107 = !DILocalVariable(name: "enl2", scope: !42, file: !1, line: 264, type: !19)
!108 = !DILocalVariable(name: "sample", scope: !42, file: !1, line: 264, type: !19)
!109 = !DILocalVariable(name: "cf", scope: !42, file: !1, line: 265, type: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdlclassifier_t", file: !1, line: 51, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s_xdlclassifier", file: !1, line: 42, size: 896, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "hbits", scope: !111, file: !1, line: 43, baseType: !4, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "hsize", scope: !111, file: !1, line: 44, baseType: !19, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rchash", scope: !111, file: !1, line: 45, baseType: !5, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ncha", scope: !111, file: !1, line: 46, baseType: !73, size: 448, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rcrecs", scope: !111, file: !1, line: 47, baseType: !5, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !111, file: !1, line: 48, baseType: !19, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !111, file: !1, line: 49, baseType: !19, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !111, file: !1, line: 50, baseType: !19, size: 64, offset: 832)
!121 = !DILocation(line: 262, column: 31, scope: !42)
!122 = !DILocation(line: 262, column: 46, scope: !42)
!123 = !DILocation(line: 262, column: 68, scope: !42)
!124 = !DILocation(line: 263, column: 17, scope: !42)
!125 = !DILocation(line: 265, column: 2, scope: !42)
!126 = !DILocation(line: 267, column: 2, scope: !42)
!127 = !DILocation(line: 276, column: 12, scope: !42)
!128 = !{!129, !130, i64 0}
!129 = !{!"s_xpparam", !130, i64 0, !133, i64 8, !130, i64 16}
!130 = !{!"long", !131, i64 0}
!131 = !{!"omnipotent char", !132, i64 0}
!132 = !{!"Simple C/C++ TBAA"}
!133 = !{!"any pointer", !131, i64 0}
!134 = !DILocation(line: 276, column: 37, scope: !42)
!135 = !DILocation(line: 276, column: 11, scope: !42)
!136 = !DILocation(line: 264, column: 19, scope: !42)
!137 = !DILocation(line: 279, column: 9, scope: !42)
!138 = !DILocation(line: 279, column: 38, scope: !42)
!139 = !DILocation(line: 264, column: 7, scope: !42)
!140 = !DILocation(line: 280, column: 9, scope: !42)
!141 = !DILocation(line: 280, column: 38, scope: !42)
!142 = !DILocation(line: 264, column: 13, scope: !42)
!143 = !DILocation(line: 282, column: 6, scope: !144)
!144 = distinct !DILexicalBlock(scope: !42, file: !1, line: 282, column: 6)
!145 = !DILocation(line: 282, column: 31, scope: !144)
!146 = !DILocation(line: 282, column: 53, scope: !144)
!147 = !DILocation(line: 283, column: 36, scope: !144)
!148 = !DILocation(line: 283, column: 43, scope: !144)
!149 = !DILocation(line: 265, column: 18, scope: !42)
!150 = !DILocalVariable(name: "cf", arg: 1, scope: !151, file: !1, line: 71, type: !154)
!151 = distinct !DISubprogram(name: "xdl_init_classifier", scope: !1, file: !1, line: 71, type: !152, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !155)
!152 = !DISubroutineType(types: !153)
!153 = !{!45, !154, !19, !19}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!155 = !{!150, !156, !157}
!156 = !DILocalVariable(name: "size", arg: 2, scope: !151, file: !1, line: 71, type: !19)
!157 = !DILocalVariable(name: "flags", arg: 3, scope: !151, file: !1, line: 71, type: !19)
!158 = !DILocation(line: 71, column: 49, scope: !151, inlinedAt: !159)
!159 = distinct !DILocation(line: 283, column: 6, scope: !144)
!160 = !DILocation(line: 71, column: 58, scope: !151, inlinedAt: !159)
!161 = !DILocation(line: 71, column: 69, scope: !151, inlinedAt: !159)
!162 = !DILocation(line: 72, column: 6, scope: !151, inlinedAt: !159)
!163 = !DILocation(line: 72, column: 12, scope: !151, inlinedAt: !159)
!164 = !{!165, !130, i64 104}
!165 = !{!"s_xdlclassifier", !166, i64 0, !130, i64 8, !133, i64 16, !167, i64 24, !133, i64 80, !130, i64 88, !130, i64 96, !130, i64 104}
!166 = !{!"int", !131, i64 0}
!167 = !{!"s_chastore", !133, i64 0, !133, i64 8, !130, i64 16, !130, i64 24, !133, i64 32, !133, i64 40, !130, i64 48}
!168 = !DILocation(line: 74, column: 27, scope: !151, inlinedAt: !159)
!169 = !DILocation(line: 74, column: 14, scope: !151, inlinedAt: !159)
!170 = !DILocation(line: 74, column: 6, scope: !151, inlinedAt: !159)
!171 = !DILocation(line: 74, column: 12, scope: !151, inlinedAt: !159)
!172 = !{!165, !166, i64 0}
!173 = !DILocation(line: 75, column: 16, scope: !151, inlinedAt: !159)
!174 = !DILocation(line: 75, column: 14, scope: !151, inlinedAt: !159)
!175 = !DILocation(line: 75, column: 6, scope: !151, inlinedAt: !159)
!176 = !DILocation(line: 75, column: 12, scope: !151, inlinedAt: !159)
!177 = !{!165, !130, i64 8}
!178 = !DILocation(line: 77, column: 24, scope: !179, inlinedAt: !159)
!179 = distinct !DILexicalBlock(scope: !151, file: !1, line: 77, column: 6)
!180 = !DILocation(line: 77, column: 55, scope: !179, inlinedAt: !159)
!181 = !DILocation(line: 77, column: 59, scope: !179, inlinedAt: !159)
!182 = !DILocation(line: 77, column: 6, scope: !179, inlinedAt: !159)
